{"AreaId":105911816,"ParentAreaId":null,"AreaName":"Illinois","Elevation":416.0,"ElevationUnits":"ft","Latitude":37.726,"Longitude":-89.217,"ViewsTotal":1902495,"ViewsMonth":10848,"SharedOn":"Jan 23, 2007","Overview":null,"Description":null,"GettingThere":null,"URL":"https://www.mountainproject.com/area/105911816/illinois"}
{"AreaId":106017458,"ParentAreaId":105911816,"AreaName":"Jackson Falls","Elevation":673.0,"ElevationUnits":"ft","Latitude":37.507,"Longitude":-88.682,"ViewsTotal":789585,"ViewsMonth":4698,"SharedOn":"Aug 30, 2007","Overview":null,"Description":"Jackson falls has the largest number of climbing routes in Illinois. Located in a forest canyon the 30-70 foot walls offer slopers, various sized pockets, roofs, and slabs. Jackson Falls is in the Shawnee National Forest in southern Illinois. It can get hot and humid in the summer but there's plenty of shade.   Here's a map based loosely off the map in the Ulner guide, but done from memory. Red ATCs represent accessible anchors for rap points, brown paths over the cliff represent places I know are safe to scramble in. Blue is the creek bed, and brown are the cut across paths. The paths2013-09-289508.53.34.jpg2013-09-289508.53.34.jpg on the bottom and top of the cliff are not marked    Breakdown of all the roped climbing areas for reference.","GettingThere":null,"URL":"https://www.mountainproject.com/area/106017458/jackson-falls"}
{"AreaId":108116766,"ParentAreaId":105911816,"AreaName":"The Holy Boulders","Elevation":530.0,"ElevationUnits":"ft","Latitude":37.618,"Longitude":-89.415,"ViewsTotal":353266,"ViewsMonth":3564,"SharedOn":"Apr 29, 2013","Overview":"Holy Boulder Comp Map 16","Description":"THE BOULDERS: The Holy Boulders is the largest concentration of boulders in Southern Illinois. There are over 200 developed boulder problems from V0 to V13 and has the potential for hundreds more. The sandstone boulders and cliff line are known for their Fontainebleau-like perfect friction and aesthetic lines.  THE SEASON: Its highly recommended to visit the Holy Boulders October to early April and avoid a trip May through September when the humidity is high and the poison ivy, ticks, and chiggers are out. A good network of trails have been improved since 2012, helping navigate the different zones.  THE RULES: Please remember to practice leave no trace ethics, pack it in-pack it out, and stay on existing trails where possible. Respect adjacent private property to the south and do not drive up or approach from Tripp's Lane. Overnight use, ORV/vehicular access, and hunting are not permitted on the property. Please contact ICA or Access Fund immediately if there are any concerns.  Stay tuned for updates and users are welcome to add boulders and boulder problems to this database. ICA still needs your support to raise the remaining acquisition costs: donate today at www.ilclimbers.org","GettingThere":null,"URL":"https://www.mountainproject.com/area/108116766/the-holy-boulders"}
{"AreaId":112811935,"ParentAreaId":105911816,"AreaName":"Alto Pass","Elevation":753.0,"ElevationUnits":"ft","Latitude":37.57,"Longitude":-89.317,"ViewsTotal":39639,"ViewsMonth":774,"SharedOn":"Apr 9, 2017","Overview":null,"Description":"In the Spring of 2017, a brand new crag was opened up for climbers. Welcome to Alto Pass! This project was made possible thanks to a great relationship between the town of Alto Pass and the Illinois Climbers Association. Primarily a sport and bouldering area with traditional lines mixed in, these shorter walls provide endless fun. The area is well suited for \"first leads\" because of the closely spaced bolts and fun climbing. With abundant shade in the warmer months and plentiful sun in the cooler months, this area is climber friendly year round. Alto Pass is still in its development phase, so keep your eyes peeled as route development continues.  Have fun!","GettingThere":"There is not an official address for the climbing area, but if you use the gps coordinates, your phone (or whatever device you use), will be able to guide you to the trail to access the climbing area.  GPS Coordinates 37.569875, -89.317272  Park at the Quetil Trail parking lot and hike down the old rail road bed. After about two minutes you reach the rock.  Refer to map","URL":"https://www.mountainproject.com/area/112811935/alto-pass"}
{"AreaId":107014884,"ParentAreaId":105911816,"AreaName":"The Beach","Elevation":384.0,"ElevationUnits":"ft","Latitude":37.663,"Longitude":-89.512,"ViewsTotal":23047,"ViewsMonth":182,"SharedOn":"Jan 19, 2011","Overview":null,"Description":"The Beach is yet another collection of great sandstone boulders in southern Illinois that are fun to play on!  This collection sits along side the mighty Mississippi River for a stretch of a half of a mile or so.  There are currently approximately 70-80 established boulder problems with possibilities for more.  The rock is pretty high quality and river polished.  The landings range from perfect soft sand to medium sized, ankle breaking talus with a few pads and spotters coming in handy more often than not.  The Beach can feel cooler than other areas in the summer due to the open nature of the boulders in contrast to other areas in So Ill buried in the woods seeming to trap in the humidity.  This coupled with the river a stones throw away can make for somewhat comfortable summertime conditions for a session especially in the mornings and evenings.  One drawback to the beach is the fact that the number of problems that are climbable can change from day to day due to changes in the water levels and the fact that the boulders can border the river.  For current water levels checkrivergauges.com - Mississippi River - Grand Tower, IL.  Please consult \"Sandstone Warrior\" by Matt Bliss for a great comprehensive guidebook on The Beach and many other areas in So Ill and Elephant Rocks, MO","GettingThere":"The \"Parking\" listed here is no longer public use. while there i ran into some logistical problems just getting parking and hiking with to many pads, but there is a hike from up top by fountain bluff road, find the power lines and use the map to the left to see where the lines intersect with the bouldering area. Its a little more of a hike but should keep both the climbers and the people working at the grain silos and the power plant happy. If the trail down is overgrown you can try you're luck down by the power plant, but be mindful of trespassing and private property signs.","URL":"https://www.mountainproject.com/area/107014884/the-beach"}
{"AreaId":110006177,"ParentAreaId":105911816,"AreaName":"Cedar Bluff","Elevation":685.0,"ElevationUnits":"ft","Latitude":37.519,"Longitude":-89.027,"ViewsTotal":43975,"ViewsMonth":565,"SharedOn":"Jan 29, 2015","Overview":null,"Description":"Thanks to the South/Southwest facing cliffs, Cedar Bluff is a great destination on any Sunny winter day. The Southern exposure creates a micro climate on the wall and temperatures average 10-20 degrees warmer on the wall.     Cedar Bluff is comprised of 30+ routes/problems along a half mile cliff band. The 80-90 ft tall cliffs provide a great resource for anyone desiring to practice multi pitch. The site contains 5 multi-pitch routes and over a dozen routes at or below 5.10 and you can set up a top rope on every one of them. The bouldering at Cedar Bluff ranges primarily from V0-V5, but there are harder lines and even unfinished projects on the site. If you come for bouldering, bring brushes to give the stone a little TLC.","GettingThere":null,"URL":"https://www.mountainproject.com/area/110006177/cedar-bluff"}
{"AreaId":114335250,"ParentAreaId":105911816,"AreaName":"Chicago Area","Elevation":590.0,"ElevationUnits":"ft","Latitude":41.844,"Longitude":-87.653,"ViewsTotal":52841,"ViewsMonth":1386,"SharedOn":"May 5, 2018","Overview":null,"Description":"This is in early access as we find more actual rock scattered around chicagoland. This is slightly different than \"Chicago Buildering\" Because it will hopefully include more actual real rock climbing.","GettingThere":"Use Gps ya dingus! Will put more info in the sub areas when applicable to get to those specifics spots.","URL":"https://www.mountainproject.com/area/114335250/chicago-area"}
{"AreaId":107286103,"ParentAreaId":105911816,"AreaName":"Cove Hollow","Elevation":649.0,"ElevationUnits":"ft","Latitude":37.64,"Longitude":-89.3,"ViewsTotal":18659,"ViewsMonth":157,"SharedOn":"Sep 13, 2011","Overview":null,"Description":"Cove Hollow is a hiking trail that follows the east side of Cedar Lake, just south of Carbondale.  The cliffs along the trail are home to several gear and bolted routes put up by Jim Thurmond (and others?) in the 70s and 80s.  Recently, a handful of quality bolted lines have gone up, bringing some new attention to the area.  At a twenty minute drive, Cove Hollow is the closest sport climbing to Carbondale, making it a great choice for quick mid-week sessions.    The summer, as with most climbing in southern Illinois, is hot, humid, and buggy.  Fall and spring are the prime time, but warm days in the winter can be perfect.  A few routes in the dugout will stay dry in light rain, but most of the other climbs here do not.","GettingThere":"The trailhead is located at the end of Cove Hollow Road in Pomona, IL.  All of the climbs are within a fifteen minute walk of the parking area.    g.co/maps/pkg77    Park in the gravel lot at the end of the road and follow the trail downhill and to the right.  This will soon join the top of the cliff line.  After about a hundred yards, a trail heads down to the base of the cliff.  Continuing in the same direction along the base will bring you to the main amphitheater with a waterfall and a fire circle.  Heingerous ascends the face just left of the prominent dihedral chimney on the right side of the wall.  Slimy Arches is the large arching dihedral on the left side of the wall.    Following the trail for another several minutes will lead you across a stream to the Dugout and the Shout area.      Sunny Side is accessed by taking the trail in the opposite direction after hiking down from the top of the cliff.","URL":"https://www.mountainproject.com/area/107286103/cove-hollow"}
{"AreaId":106226290,"ParentAreaId":105911816,"AreaName":"Dixon Springs State Park","Elevation":483.0,"ElevationUnits":"ft","Latitude":37.383,"Longitude":-88.668,"ViewsTotal":22894,"ViewsMonth":146,"SharedOn":"Aug 10, 2008","Overview":null,"Description":"Dixon Springs State Park is one of several state parks in the Illinois Shawnee Hills. The park is on a giant block of rock which was dropped 200 feet along a fault line that extends northwesterly across Pope County.    \"Bold cliffs and crags overhang a bubbling brook while large boulders, overgrown with ferns, lichens and moss fringe the hillside. Giant century-old trees interlock above the small creek as cliffs rise on either side and huge boulders are scattered through the valley. The principle canyon has walls nearly 60 feet high with a long, narrow passageway.\" (Illinois Department of Natural Resources).    Dixon Springs State Park is a unique area in Southern Illinois. You will not find a more meticulously clear and approachable destination in Illinois. Freshly cut grass, permanent grills, picnic tables, all combined with a super short approach make this area the most relaxing place to boulder. Pack a bunch of friends and crash pads into a car and head out to Dixon Springs to test yourselves on some of John Gills old boulder problems. Dixon contains one of John Gill's hardest problems Rebuttal V8 (proud send for the 1960's), and many other fun problems.     So if your feel like venturing somewhere new while barbecuing and bouldering then go enjoy yourself at Dixon Springs.","GettingThere":"Dixon Springs State Park is located in Pope County, just 30 miles south of Harrisburg, IL, or 20 miles north of Paducah, Ky. To reach Dixon Springs State Park from I-24 traveling East, take exit #16 to Rt. 146. At the stop sign turn left and the park is 13 miles on the left. If you are traveling West on I-24 you take exit #16 to Rt. 146. At the stop sign turn right and the park entrance is 13 miles on the left. The park entrance sign is across from the Chocolate Factory. Dixon Springs State Park is 1 mile east of Rt. 145.","URL":"https://www.mountainproject.com/area/106226290/dixon-springs-state-park"}
{"AreaId":112875162,"ParentAreaId":105911816,"AreaName":"Draper's Bluff","Elevation":829.0,"ElevationUnits":"ft","Latitude":37.515,"Longitude":-89.043,"ViewsTotal":12068,"ViewsMonth":240,"SharedOn":"May 4, 2017","Overview":null,"Description":"Great Sandstone climbing. Many classic 5 star trad lines. Must do climbs include Ant Killer (5.9), Southern Exposure (5.10a), High Over Camp (5.10a tricky crux) and Bloody Nose (5.6)","GettingThere":"I 57 South from Marion, IL to Lick Creek Exit. Go left for a few miles (it's on the right)","URL":"https://www.mountainproject.com/area/112875162/drapers-bluff"}
{"AreaId":110019237,"ParentAreaId":105911816,"AreaName":"Ferne Clyffe S.P.","Elevation":574.0,"ElevationUnits":"ft","Latitude":37.534,"Longitude":-88.983,"ViewsTotal":24259,"ViewsMonth":312,"SharedOn":"Feb 1, 2015","Overview":null,"Description":"Ferne Clyffe State Park is located a short drive from Interstate 57, about 1 mile south of Goreville Illinois. The park has seen technical climbing since the 1960's. Throughout its climbing history, routes have been established park wide. However, since the mid 1980's, park officials have changed their management plans. While this has greatly limited the amount of legal climbing, what still remains is comprised of some of the finest stone the park has to offer.     Most of the climbing that is available is primarily top roped. Fern also offers a small portion of quality traditional leads that are well protected. It is important to note that park management does not allow fixed anchors. When building anchors the standard is to establish them off strong/live trees on top, although many roots are exposed. Regardless, the available climbing found at Fern Cylffe will not disappoint. Enjoy the solitude of a sparsely populated crag and have fun pulling it's quality sandstone. This area should be a must for anyone passing through on the interstate and is curious about the climbing in Illinois.","GettingThere":"Ferne Clyffe State Park can be reached from I-57 and I-24. The park is well signed from both interstate highways. If traveling south on I-57, take the Goreville exit, #40, approximately 12 miles south of Marion, IL At exit #40 turn left (east), go 5 miles to IL Rt. 37. Turn right (south) on Rt. 37, you will see the park entrance 1 mile south of Goreville. Traveling north on I-57, take exit #40, Goreville, turn right (east), go 5 miles to IL. Rt. 37, turn right (south) on IL Rt. 37 and you will see the park entrance 1 mile south of Goreville. If traveling on I-24, take exit #7 (Goreville), turn west and go 2 miles to IL Rt. 37, turn left (south) and go ½ mile to park entrance.  From the park entrance, follow the road for 1.7 miles to the parking area. At .5 miles, take a left at the stop sign. At .8 miles turn right at the fork by the lake. On the North side of the parking lot there are round stepping stones for crossing the creek. Follow the grass trail straight and then take the trail to the far right and you will see a sign for Rebman Trail. Continue walking straight for about 100 ft. You will come to the boulder problems.","URL":"https://www.mountainproject.com/area/110019237/ferne-clyffe-sp"}
{"AreaId":120375332,"ParentAreaId":105911816,"AreaName":"The Forge","Elevation":812.0,"ElevationUnits":"ft","Latitude":37.561,"Longitude":-88.653,"ViewsTotal":919,"ViewsMonth":259,"SharedOn":"Mar 9, 2021","Overview":null,"Description":"A nice little boulder field located in the Burden Falls wilderness. Rock cleaning suggest they are undone. Some lines still out there. The place is pretty small, with all current lines being within less than a hundred yards of each other.","GettingThere":"5-10 mins. 37.561278, -88.653295 Park at this pull-in, walk down the path a ways until the fork of orange tape (37.562454,-88.652516), follow the left set (the right set is most likely a hunters that I repurposed form the from the car park to the fork). That being said It is pretty sparse. follow the cliff right with the end of the tape, leads to 37.563519,-88.653060 . Walk down the second set of rubble, you should be able to walk down easily. This should put you at the top half of Fly Mode. The High Roller is down a tier 37.563514,-88.653390 approx here. See aerial topo photo to get oriented.","URL":"https://www.mountainproject.com/area/120375332/the-forge"}
{"AreaId":106612569,"ParentAreaId":105911816,"AreaName":"Giant City State Park","Elevation":718.0,"ElevationUnits":"ft","Latitude":37.598,"Longitude":-89.188,"ViewsTotal":146061,"ViewsMonth":1038,"SharedOn":"Nov 27, 2009","Overview":null,"Description":"Southern Illinois boasts several climbing areas, but none have more history then Giant City State Park. For Illinois, this is the birthplace for hard, progressive climbing.  Within the park there are two main areas, Shelter 1 Bluff and the Devil's Standtable Area. The Makanda Bluff, \"aka Shelter 1\" is primarily a sport and traditional climbing area with the routes ranging 5.6 - 5.12. This area is great for short training sessions in preparation for other big areas. One route that deserve mentioning is City Limits. At the time it was established, it was one of the hardest routes in the country, and the world. Another climb worth mentioning is the Return to Forever boulder traverse that runs along the base of the bluff line. Beginning from Jills and running to the Camel's Hump, this challenging boulder problem will have you searching for rests while fighting to not get pumped. For those looking for more of a challenge, there is a low variation, and a super long variation that begins at the Chimney in the woods and stretches to the Camel's Hump.   Royal Robbins climbing George's sometime after his Yosemite adventures   The Devils Standtable area is primarily a bouldering area but does contain a few top rope and traditional lines. Fun intermediate boulder problems worth mentioning are The Standard, Buzz Arete, and the Center Line. Great advanced boulder problems that visitors are recommended to attempt are Devil on a Leash, Jah Arete, and Higher Education. All in all the area is great for quick bouldering sessions.   A visiting climber attempting Leashless Angel    For the sake of organizing areas on Mountain Project, another bouldering area nearby that is not exactly within the confines of Giant City, but is close enough, is The Orchards. This small, yet secluded area offers several challenging problems and contains one very hard project that supposedly is yet to be sent. The recommended problem here is Duraflame, and is a fun/challenging test of anyones roof climbing abilities.  As a last note, a huge thanks should be given to Giant City's early pioneers for their vision and dedication to Illinois first climbing destination. Thank you: Craig Barnes, Jim Foster, Cris Franks, Joe Dittamore, Joe Heally, Adam Grosowsky, Gene Charleton, Greg Bailey, Alan Carrier, and many others for all of your work.","GettingThere":"From Carbondale take Highway 13 East. Turn right (near the intersection of McDonalds and Walmart) and head South on Giant City Rd. Continue for about 15 minutes and the road leads directly to the park. From the entrance follow the signs to the appropriate destination.   Map of Giant City State Park   To have your phone/gps directly guide you, type the GPS Coordinates, exactly as written,  into your device for it to guide you to the specific area.  GPS Coordinates for Shelter 1 37.625665, -89.200118  GPS Coordinates for the Devils Standtable area 37.599566, -89.193393","URL":"https://www.mountainproject.com/area/106612569/giant-city-state-park"}
{"AreaId":109332535,"ParentAreaId":105911816,"AreaName":"The Graveyard","Elevation":424.0,"ElevationUnits":"ft","Latitude":37.782,"Longitude":-89.509,"ViewsTotal":22328,"ViewsMonth":268,"SharedOn":"Aug 9, 2014","Overview":null,"Description":"A nice area to boulder in southern Illinois since it is almost always empty despite having awesome quality sandstone routes 8 to 20 feet high.  Some boulder routes here are genuine southern Illinois classics!  The bluff is west facing above the mississippi river valley so expect morning shade and evening sun.  Also lake Kinkaid is not far from the graveyard and offers deep water soloing as well as swimming and fishing.","GettingThere":"3 miles north of HWY 149 off Route 3. If coming from the south head right onto Crain Rd and drive behind the church on your right.  Be respectful and you may want to refrain from climbing when church is in service. Walk up to the bluffline and follow to the right. Have fun!","URL":"https://www.mountainproject.com/area/109332535/the-graveyard"}
{"AreaId":110009688,"ParentAreaId":105911816,"AreaName":"Ice Climbing","Elevation":607.0,"ElevationUnits":"ft","Latitude":41.317,"Longitude":-88.992,"ViewsTotal":26704,"ViewsMonth":343,"SharedOn":"Jan 30, 2015","Overview":null,"Description":"This page was created in the intention of giving Ice Climbers a place to post the various ice climbs that can be found around state.","GettingThere":"Refer to specific areas","URL":"https://www.mountainproject.com/area/110009688/ice-climbing"}
{"AreaId":106659441,"ParentAreaId":105911816,"AreaName":"Kankakee River","Elevation":575.0,"ElevationUnits":"ft","Latitude":41.201,"Longitude":-87.976,"ViewsTotal":6756,"ViewsMonth":49,"SharedOn":"Jan 25, 2010","Overview":null,"Description":"Just needed a place here in Illinois pages to post up whatever we ice climbers can find to climb in our flatlands.","GettingThere":"Drive, and drive some more.","URL":"https://www.mountainproject.com/area/106659441/kankakee-river"}
{"AreaId":118064939,"ParentAreaId":105911816,"AreaName":"Lehigh Park","Elevation":645.0,"ElevationUnits":"ft","Latitude":41.298,"Longitude":-89.041,"ViewsTotal":18219,"ViewsMonth":946,"SharedOn":"Nov 18, 2019","Overview":null,"Description":"This area is completely unheard of! Mainly due to the fact it is hidden in central IL.    You have to park across from Lehigh Park in a parking lot.    Cross the road and continue towards the outdoor band stand. Go past the band stand towards the back left corner of the park.There you should stumble upon a trail. Follow that trail until it starts to go downhill.    Take the second trail on your left (this is a downhill mtb course so watch out!), it should take a sharp left and then open up into a a clearer area. Continue along the downhill course and look to your left.    Look all around we are finding new boulders every time we go out there.","GettingThere":"From Oglesby:   Drive east of Walnut St and you should see it on your left once you get outside the main town area.","URL":"https://www.mountainproject.com/area/118064939/lehigh-park"}
{"AreaId":113878460,"ParentAreaId":105911816,"AreaName":"Mississippi Palisades","Elevation":609.0,"ElevationUnits":"ft","Latitude":42.144,"Longitude":-90.164,"ViewsTotal":76025,"ViewsMonth":1753,"SharedOn":"Nov 27, 2017","Overview":null,"Description":"Walls are ordered North to South with A being the furthest North and L being the furthest South.  The Palisades is a great area for anyone living near Chicago who can get away for a weekend. It is located on the Illinois side of the Mississippi river, just across from Iowa. The limestone bluffs rise roughly 180 feet above the river level in some places, though none of the climbs are actually this long. Pretty much everything here is top-rope, with tons of natural anchor options in the trees and some boulders on top of the walls. This limestone can get pretty manky - especially with wet and even just humid weather. There are a few routes that are in bee territory here, which can make the climbing very exciting. Because of the humid and buggy summers, the best time to climb here is October to November. A nice dry crisp fall morning here is ideal.  The favorite section here goes by a few names, but most people know it as \"The Cove\". It is a stone ledge roughly 30 feet by 30 feet behind the dominant Sentinel Tower. Several routes can be found in this small space, easy to moderate, plus a few harder lines. Getting into The Cove requires a class 4 scramble over some well worn holds (smooth as glass) and a few boulders.  Due to the close nature of the routes in The Cove, things can get very crowded here. Overlapping belay stances can be a hassle, but climbers with half a wit and a dose of courtesy shouldn't have any trouble. During the busy summer weekends the whole area can become overrun with gearless trundle-happy yokels who WILL step on your rope, gear, dog, etc. Be advised. Watch for flying cigarette butts from the observation deck above.  There are a few other areas along the palisade - please contribute if you are familiar. I'll do my best to update this soon.","GettingThere":"Use a map to find Savannah, Il and then head north a few miles to Mississippi Palisades State Park. Camping is available at the north end of the park, but if you want to get away from the Good 'ol RV Folk (who mostly stay huddled within their giant rolling metal crap houses), you'll have to pack it in a mile or two to the primitive sites on the eastern hills. This is not recommended for climbers, however, as you'll be an awfully long walk from the crag. Instead, look for tent sites at the south end of the campground (sites #45-60). You'll be reasonably far from the RV's, and you can still car camp and then drive to the crag, which is located at the south end of the park. Ask park staff for more details and refer to below for a map.   Mississippi Palisades Overview - Scanned with permission of copyright owner","URL":"https://www.mountainproject.com/area/113878460/mississippi-palisades"}
{"AreaId":110006134,"ParentAreaId":105911816,"AreaName":"One Horse Gap","Elevation":638.0,"ElevationUnits":"ft","Latitude":37.518,"Longitude":-88.461,"ViewsTotal":10078,"ViewsMonth":129,"SharedOn":"Jan 29, 2015","Overview":null,"Description":"Looking to have a bouldering area to yourself? You came to the right place. One Horse Gap is Illinois most remote destination. Located on the Eastern side of the Shawnee National Forest, One Horse Gap provides a plethora of problems for any level climber. Although rock quality tends to be sandy, the stone cleans up well and climbs even better. I recommend bringing an assortment of brushes for cleaning and a group of friends to help. The more the area is climbed the better is will be. So gear up and get out there!","GettingThere":"From Harrisburg, follow Highway 34 south/east until you arrive at the town of Herod. Once there, locate and turn right on Williams Hill Road (you will see a Bethesda Baptist Church sign). From here reset your pedometer and precisely follow milage directions to parking area.    At .6 miles, fork left onto a gravel road.   At 3.3 miles, stay left.   At 4.1 miles, stay left and ignore the One Horse Gap sign.   At 6.5 miles, turn left on Dutton Chapel Road (the second cemetery you pass)   At 7.1 miles, turn left on forest device road 186 (very hard to see).   At 8.9 miles, you see a small pull off on the right side of the gravel road. Park here, but do not block the road.    From here walk the muddy road for about 10 mins and you will arrive at the horse campground. The actual One Horse Gap will be on the left side of the campground as you enter. Take it down and explore the site.    Crazy directions. Huge Kudos to Matt Bliss for finding this place and sharing the directions.","URL":"https://www.mountainproject.com/area/110006134/one-horse-gap"}
{"AreaId":114405527,"ParentAreaId":105911816,"AreaName":"Peoria - Rocky Glen","Elevation":668.0,"ElevationUnits":"ft","Latitude":40.694,"Longitude":-89.652,"ViewsTotal":3253,"ViewsMonth":87,"SharedOn":"May 25, 2018","Overview":null,"Description":"As of October 2018, Rocky Glen has officially become a park open to the public. A nice parking lot and new entrance to Rocky Glen has been added to Kickapoo Creek Road. Peoria Park District has recently posted a trail map at the entrance, along with a new trail, that is well marked, and leads to the spray painted sandstone formations. At the opposite end of the small creek that flows through the Glen is an abandoned coal mine entrance that is welded shut.","GettingThere":"Peoria Park Destrict has added a new parking lot on Kickapoo Creek Road. The parking lot has a trail map posted at the entrance. Follow the trail markers until you reach the small creek at the bottom of a ravine, head right (north) to find the sand stone formations, head left to find the abandoned coal mine.","URL":"https://www.mountainproject.com/area/114405527/peoria-rocky-glen"}
{"AreaId":112240918,"ParentAreaId":105911816,"AreaName":"Pere Marquette State Park","Elevation":671.0,"ElevationUnits":"ft","Latitude":38.971,"Longitude":-90.488,"ViewsTotal":155119,"ViewsMonth":2727,"SharedOn":"Oct 17, 2016","Overview":null,"Description":"The Illinois Climbers Association is proud to present Illinois' newest rock climbing destination, Pere Marquette State Park. Located an hour from St. Louis just outside the lively town of Grafton, Pere Marquette offers highly featured limestone formations great for climbing. Since early 2015 the ICA has been working with the Illinois Department of Natural Resources to gain their blessing for this project, which includes new trails, landscaping with natural rock steps, and both sport routes and top-anchors for traditional leads. This new climbing area will ultimately have over 60 climbing routes.","GettingThere":"There is not an official address for the climbing area, but if you use the gps coordinates, your phone (or whatever device you use) will be able to guide you to the trail to access the climbing area.   GPS Coordinates  38.969548, -90.488101  Also, make sure to check the map function built into the website/app to gain a better idea of where the climbing area is.","URL":"https://www.mountainproject.com/area/112240918/pere-marquette-state-park"}
{"AreaId":119978970,"ParentAreaId":105911816,"AreaName":"Pomona Bottoms / potential","Elevation":458.0,"ElevationUnits":"ft","Latitude":37.64,"Longitude":-89.344,"ViewsTotal":2670,"ViewsMonth":390,"SharedOn":"Nov 25, 2020","Overview":null,"Description":"Who would have guessed, there's more rock in Pomona. This area offers high quality rock but not many super hard (V7+) lines of it. Take all grades with a grain of salt, I have no clue. That being said there are certainly high quality boulder problems of moderate and low grades at the P.B. Rock quality is worst by the trail and other free standers closer to the road/ path, much better close to the cliff lines.","GettingThere":"Park at the pulloff on the right side of the road, and follow the path behind the no motor vehicles gate. Follow the path until you see boulders on the left. There are zero trails from here on as of now, so please try to make a minimal impact on plant life. I will try to include GPS to supplement these instructions, as describing these approaches well is an impossible task. Walk up the hill and past the initial lower rock quality boulders until you see the slabby short cliff line. It is behind the largest and first boulder you will see off of the path. Spot the large spike like boulder that marks the break in the short slabby cliff on the left side of it (see picture). Use this break to gain the cliff line. From here you should see two house sized boulders, one with a large roof that has foot prints painted on it. From here, the 'grateful fin' is the right side of the next rock formation up the hill, forming a hallway with another short, slabby cliff line. The main cliff line lies maybe one hundred yards left, past another large freestanding block that forms another steeper, slimmer and longer hallway with the main cliff line. Either walk around this boulder or slip through the cave like small corridor at the end of the hallway, which will pop you out to the main cliff line. To get to the Shawnee Solitaire area, from the right side of the grateful fin walk further from the footprint boulder and over the ridge. You will see that the cliff line ‘turns a corner’ and continues on the other side of the ridge. Follow this cliff line. It dies out once or twice but keep going.","URL":"https://www.mountainproject.com/area/119978970/pomona-bottoms-potential"}
{"AreaId":116546100,"ParentAreaId":105911816,"AreaName":"Pounds Lake","Elevation":522.0,"ElevationUnits":"ft","Latitude":37.619,"Longitude":-88.271,"ViewsTotal":8487,"ViewsMonth":297,"SharedOn":"Feb 19, 2019","Overview":null,"Description":"Pounds Lake is known as Southern Illinois most obscure bouldering area. Just outside of Pounds Hollow, several boulders hold quality problems of all grades. The problems are extremely fun, but receive little traffic, so be prepared to bring a brush. Have fun.","GettingThere":"From Harrisburg it is 15 miles on Route 34 North. There are signs for Pounds Hollow. Turn East on Karber's Ridge Road and follow it for 9 miles to the recreation area entrance. As you enter the area, follow the one-way road to the right. At .6 miles, park at the pull-off on the right. Walk straight down the hill to the edge of the lake. Continue walking right around the cove following the trail at the lakes edge. After a short hike you will come to a cement spillway. From there, cut straight up the hill toward the rock.","URL":"https://www.mountainproject.com/area/116546100/pounds-lake"}
{"AreaId":114406593,"ParentAreaId":105911816,"AreaName":"Rockford Area Climbing","Elevation":838.0,"ElevationUnits":"ft","Latitude":42.342,"Longitude":-88.988,"ViewsTotal":2429,"ViewsMonth":65,"SharedOn":"May 26, 2018","Overview":null,"Description":"Climbing options available all over the state, here is another great example. Rockford has a couple options. Rock Cut State Park and some rock formations along the Rock River. Not sure what the access issues are along rock river due to the railroad, but the Dawn Wall is worth checking out.","GettingThere":"Refer to specific areas for further details","URL":"https://www.mountainproject.com/area/114406593/rockford-area-climbing"}
{"AreaId":107017143,"ParentAreaId":105911816,"AreaName":"The Roost","Elevation":642.0,"ElevationUnits":"ft","Latitude":37.498,"Longitude":-88.719,"ViewsTotal":13751,"ViewsMonth":109,"SharedOn":"Jan 21, 2011","Overview":null,"Description":"The Roost is one of the newer boulder fields to be discovered and climbed at in southern Illinois.  It has, however, received quite a bit of notoriety due to a handful of hard classics that have been established here such as Chuck Norris (V9), Ring of Fire (V10), Eternal Sunshine (V9), Year of the Renegade (V12), Beaver Eater Delux (V8) and The Gobbler (aka Illinois biggest sloper) (V8) amongst others.  The rock quality ranges from perfect to mediocre with it usually improving as the grade rises.  The Roost is mostly a somewhat broken and usually very steep cliff line that goes on for maybe 150 yards along with a handful of free standing boulders that all sit in quiet woods next to a serene lake.  There are maybe 40 or so established problems here with some projects and possibilities for more.  I am not including any specifics for problems because I don't have any pictures and when I've been I just climb what looks fun or attempt what I have scene in videos.  I encourage you to do the same or better yet buy and reference Matt Bliss's awesome guidebook \"Sandstone Warrior\" documenting problems at The Roost, Jackson Falls bouldering, Elephant Rocks SP, Giant City SP, The Beach and many more bouldering areas in southern Illinois.","GettingThere":"To find The Roost you must first get to Jackson Falls.     To do this head south down I-24 until you can exit onto HWY 45 and head northeast until you reach the town of Ozark.  At the Ozark General Store take a right (east) down Ozark Road for approximately 4.5 miles until you make a sharp left curve at Zion Church/Cemetery.  Then make a right after a couple hundred yards onto Trigg Tower Road (which is gravel) (please drive slowly down this road as you pass a house and there are many blind spots you could easily smash into another climber coming out - it wouldn't be the first time).  After two miles of this you will come upon the main parking area for Jackson Falls.  Keep driving past this for another mile or so passing pull offs and many great, free camping spots and the dog walk for Jackson.    After you pass through Jackson the last main camping area is The Pines (please don't park here), across from this is a somewhat open field.  Park immediately after this on the right and follow the four wheeler trail into the woods.  Follow the trail - it will fork a few times but ends up reconnecting in the end.  You will come to a small creek that crosses the trail and a rock cairn.  Turn left here and follow it along the creek for a few minutes.  The trail will soon start dropping and boulders and the lake will come into view.","URL":"https://www.mountainproject.com/area/107017143/the-roost"}
{"AreaId":116111802,"ParentAreaId":105911816,"AreaName":"St. Francisville","Elevation":403.0,"ElevationUnits":"ft","Latitude":38.591,"Longitude":-87.641,"ViewsTotal":3161,"ViewsMonth":100,"SharedOn":"Nov 19, 2018","Overview":null,"Description":"This Sandstone climbing area is down by boat docks in St. Francisville. There is a chain of rock by the park area by the boat dock. This is a work in progress and are all virgin rock right now with potential for good bouldering. This area is similar to the Beach bouldering area in the sense that the climbing is better when the river level is low.","GettingThere":"From hwy 50, take Route 1 to Saint Francisville turn off. Once in St. Francisville, follow Main Street through town down to the park/boat dock area. It is right next to the Wabash River.","URL":"https://www.mountainproject.com/area/116111802/st-francisville"}
{"AreaId":114432676,"ParentAreaId":105911816,"AreaName":"Sterling Sinnissippi Park","Elevation":680.0,"ElevationUnits":"ft","Latitude":41.797,"Longitude":-89.662,"ViewsTotal":1104,"ViewsMonth":30,"SharedOn":"Jun 1, 2018","Overview":null,"Description":"This is a 160', 8\" band of white chert running 6'- 10' above the ground, on a sunny south-facing cliff of chossy limestone. This is mostly a traverse. Handholds are on the shelf the chert lies on. Footholds are wherever one finds them. The crux of the route is just to the right of the red stain, on the river-end. Bouldering and climbing may become safer as the wall loses it's chossiness. Please clean any chalk marks before leaving route.","GettingThere":"The Sinnissippi Grand Traverse is located within Sinnissippi Park, on the east side of Sterling. Illinois Rte 2, Follow sign at stoplights at Freeport Road. Once inside park gate, make two left-hand turns to park at 5 stall parking lot (left side)near road bridge. Take paved path under bridge and stay right to base of cliff. This is also the disc golf basket #23. The 160', 8\" band of white chert will be readily apparent.","URL":"https://www.mountainproject.com/area/114432676/sterling-sinnissippi-park"}
{"AreaId":113905423,"ParentAreaId":105911816,"AreaName":"Winston Tunnel","Elevation":935.0,"ElevationUnits":"ft","Latitude":42.356,"Longitude":-90.294,"ViewsTotal":2647,"ViewsMonth":61,"SharedOn":"Dec 5, 2017","Overview":null,"Description":"This is a new Bouldering area South of Galena. Short Cliffs South of the Abandon Winston Tunnel's West Portal. Multiple Bouldering routes around 20ft tall. The most interesting is a 150ft traverse route @ 10-20ft off the ground over the undercut. Hang 3 webs from the trees above and rope up for safety. I Traversed from East to West, Cleaning Moss as I went. This Area is new and most rocks are covered with moss and spider webs.    There are several short (20-25ft) high rocks to top rope or boulder in the area. I would like identify and name three main rocks. First, a large wide rock first approached from the south of the tunnel, call it Winston’s Boulder. Off to the right or east is another rock with several top rope routes, call it Veterans Boulder. Finally another smaller bouldering only rock off to the east of Veterans Boulder is a bouldering only small rock call it Tiny Tim.","GettingThere":"Jo Daviess County, 9 miles (14 km) west of Elizabeth, IL    Follow the Winston Tunnel Trail to arrive at the abandoned rail tunnel. The trail head is located at 2641 W Blackjack Rd Galena Illinois. After walking about 1.5 miles, you will arrive at the old grass-covered rail path perpendicular to the trail you were just walking. Take a left to head westbound towards the tunnel. The path is mowed grass, and slightly hilly, about 2 miles.  Once you find the tunnel, head south (or right if you are facing the tunnel). Keep walking straight about 1/4 mile to run into the boulder formations. You can use the trees at the top of the boulders for top-rope anchors. There are no cracks: trad-climbing is not recommended. Rock is a sandy, dolomite type.","URL":"https://www.mountainproject.com/area/113905423/winston-tunnel"}
{"AreaId":116192325,"ParentAreaId":105911816,"AreaName":"Closed Areas","Elevation":709.0,"ElevationUnits":"ft","Latitude":38.3,"Longitude":-90.272,"ViewsTotal":5337,"ViewsMonth":175,"SharedOn":"Dec 17, 2018","Overview":null,"Description":"Just remember, these areas are closed to the public so don’t screw things up and climb them. This page is for historical reference only. These are the lesser known areas that are unfortunately closed. This sub-area is here to serve as a way to not forget our climbing past. Feel free to post a now closed area. And who knows, maybe one day these areas can be open again to the public.","GettingThere":"Click on a specific area for more details.","URL":"https://www.mountainproject.com/area/116192325/closed-areas"}
{"AreaId":113717757,"ParentAreaId":106017458,"AreaName":"North Canyon","Elevation":539.0,"ElevationUnits":"ft","Latitude":37.505,"Longitude":-88.69,"ViewsTotal":132405,"ViewsMonth":2959,"SharedOn":"Oct 17, 2017","Overview":null,"Description":"The North-most part of the canyon. Includes Mr. Jimmy through Railroad Rock","GettingThere":"From the dogwalk, follow the canyon walls to and past the main falls, past many popular areas until you reach Mr Jimmy. Refer to specific areas from here.","URL":"https://www.mountainproject.com/area/113717757/north-canyon"}
{"AreaId":113717843,"ParentAreaId":106017458,"AreaName":"West Falls","Elevation":560.0,"ElevationUnits":"ft","Latitude":37.507,"Longitude":-88.686,"ViewsTotal":69961,"ViewsMonth":1561,"SharedOn":"Oct 17, 2017","Overview":null,"Description":"The Western intermittent waterfall area of the canyon.","GettingThere":"From the dogwalk, continue rightward, going past the main falls of the canyon. Continue until reach the Gallery with routes such as Group Therapy. This area includes everything from the Gallery to Dynasty Wall.","URL":"https://www.mountainproject.com/area/113717843/west-falls"}
{"AreaId":113718414,"ParentAreaId":106017458,"AreaName":"North Falls","Elevation":557.0,"ElevationUnits":"ft","Latitude":37.508,"Longitude":-88.683,"ViewsTotal":87649,"ViewsMonth":1957,"SharedOn":"Oct 17, 2017","Overview":null,"Description":"This main or \"North Falls\" area of the canyon. Includes Royal Arches through Wizard Wall","GettingThere":"As you enter the Jackson Falls canyon from the dogwalk, keep right as you make your way down, and you will enter what is known as the North Falls Area. As you continue with the cliff line to your right, the first wall you will come to is the Royal Arches Area.","URL":"https://www.mountainproject.com/area/113718414/north-falls"}
{"AreaId":113728761,"ParentAreaId":106017458,"AreaName":"East Falls","Elevation":611.0,"ElevationUnits":"ft","Latitude":37.504,"Longitude":-88.681,"ViewsTotal":16836,"ViewsMonth":376,"SharedOn":"Oct 19, 2017","Overview":null,"Description":"This is the dog walk area of the canyon. This area includes everything from the dog walk itself to Rainy Day Roof","GettingThere":"Enter Jackson Falls via the dog walk and continue leftward along the canyon walls","URL":"https://www.mountainproject.com/area/113728761/east-falls"}
{"AreaId":113728773,"ParentAreaId":106017458,"AreaName":"South Canyon","Elevation":620.0,"ElevationUnits":"ft","Latitude":37.505,"Longitude":-88.684,"ViewsTotal":94555,"ViewsMonth":2114,"SharedOn":"Oct 19, 2017","Overview":null,"Description":"This is the South side of the canyon. This area includes everything from the Industry Wall to Gentlemens Grotto.","GettingThere":"Access the canyon via the dog walk, continue leftward along the wall, past Rainy Day Roof and you reach the beginning of the South Canyon","URL":"https://www.mountainproject.com/area/113728773/south-canyon"}
{"AreaId":106920435,"ParentAreaId":106017458,"AreaName":"The Promised Land","Elevation":579.0,"ElevationUnits":"ft","Latitude":37.499,"Longitude":-88.694,"ViewsTotal":37852,"ViewsMonth":291,"SharedOn":"Oct 11, 2010","Overview":null,"Description":"In the shade for most of the day, Classic routes, worth the walk!","GettingThere":"Head towards the railroad by walking past battle axe tower and beaver wall, ect.","URL":"https://www.mountainproject.com/area/106920435/the-promised-land"}
{"AreaId":108794841,"ParentAreaId":106017458,"AreaName":"Bouldering in the Canyon Proper","Elevation":504.0,"ElevationUnits":"ft","Latitude":37.506,"Longitude":-88.684,"ViewsTotal":33294,"ViewsMonth":378,"SharedOn":"Mar 29, 2014","Overview":null,"Description":"A nice, albeit small, collection of boulders is nestled down inside this tight canyon. Look for classics such as the gorgeous Yosemite Slab v0, the brilliant holds on Juicy Fruit v2, the thuggy Body Karate v8, and O.B.D. v6, among others.    The rock is the famous fine grained sandstone of southern Illinois, which is bullet, but with less friction than the sandstone in, say, Chattanooga.   For those who are well travelled, grades may puzzle you in this area. Speaking as an outsider, they seem to be largely a result of the unique local bouldering culture. Perhaps this will change at some point. For now, take the grades with a grain of salt, check your ego at the door, and just enjoy these wonderful boulders.    N.b.: I noticed that the bouldering hasn't been recorded well here (as to date, just 2-3 boulders have been posted), and the boulders do not easily fit into the rope route categories already listed above. This is an attempt to make it easier to post problems, because this really is a great little area worth visiting. If you have an alternate idea, or if I missed where this has already been done, please send me a PM (not a comment - I may not see it). Thanks, and safe travels.","GettingThere":"Per directions on main page.    There are several bouldering spots close to the Jackson Falls canyon. For instance, The Roost is more easily thought of as a separate area.    The boulders on this page should be those actually in the canyon, starting at the Reefer Madness area back up towards the falls, where Praying Mantle and OBD are.","URL":"https://www.mountainproject.com/area/108794841/bouldering-in-the-canyon-proper"}
{"AreaId":106017463,"ParentAreaId":113717757,"AreaName":"Mr. Jimmy","Elevation":549.0,"ElevationUnits":"ft","Latitude":37.505,"Longitude":-88.689,"ViewsTotal":35409,"ViewsMonth":211,"SharedOn":"Aug 30, 2007","Overview":null,"Description":"Freestanding tower.","GettingThere":"250 yards west of The Munchkin Boulder, North of Jackson fall Creek.","URL":"https://www.mountainproject.com/area/106017463/mr-jimmy"}
{"AreaId":106705146,"ParentAreaId":113717757,"AreaName":"E.M.J. Wall","Elevation":549.0,"ElevationUnits":"ft","Latitude":37.505,"Longitude":-88.689,"ViewsTotal":9123,"ViewsMonth":67,"SharedOn":"Mar 22, 2010","Overview":null,"Description":"The routes of the E.M.J. Wall are the ones that are located on the cliff line, in the corridor between Luscious Babes and Spirit. These are located on the same side of the wall as Luscious Babes.","GettingThere":"Cliff line wall behind Mr. Jimmy","URL":"https://www.mountainproject.com/area/106705146/emj-wall"}
{"AreaId":111193887,"ParentAreaId":113717757,"AreaName":"Beaver Wall Right","Elevation":546.0,"ElevationUnits":"ft","Latitude":37.505,"Longitude":-88.689,"ViewsTotal":7283,"ViewsMonth":106,"SharedOn":"Oct 21, 2015","Overview":null,"Description":"This is the wall around the right hand corner from \"Spits or Swallows\" 12a, the rightmost route on the main Beaver Wall. It is described in Yusuf Daneshayar's guide as \"Beaver Wall Right,\" so I am adding it here as that.","GettingThere":"If coming from the dog walk/main parking/that side of the canyon, walk just past the Mr Jimmy boulder. If coming from the North Canyon Access, walk just past the main Beaver wall.","URL":"https://www.mountainproject.com/area/111193887/beaver-wall-right"}
{"AreaId":106109271,"ParentAreaId":113717757,"AreaName":"Beaver Wall","Elevation":538.0,"ElevationUnits":"ft","Latitude":37.505,"Longitude":-88.69,"ViewsTotal":25464,"ViewsMonth":157,"SharedOn":"Feb 19, 2008","Overview":null,"Description":"Overhanging high quality sport lines with one 5.12a trad route.  The wall is in the sun AM through the afternoon.  The routes range from 5.11a - 5.13a.","GettingThere":"Overhanging Wall 90 feet north of the Mr. Jimmy Boulder.  About a 10 min. walk from the \"falls\".","URL":"https://www.mountainproject.com/area/106109271/beaver-wall"}
{"AreaId":106278210,"ParentAreaId":113717757,"AreaName":"Big Star Wall","Elevation":569.0,"ElevationUnits":"ft","Latitude":37.506,"Longitude":-88.69,"ViewsTotal":25090,"ViewsMonth":162,"SharedOn":"Oct 14, 2008","Overview":null,"Description":"This is a really nice areas that has tons of classic climbs on good vertical bulgy sandstone.","GettingThere":"Big Star wall is the highly bolted wall just around the corner from Beaver Wall.","URL":"https://www.mountainproject.com/area/106278210/big-star-wall"}
{"AreaId":106931632,"ParentAreaId":113717757,"AreaName":"Big Star Wall Left","Elevation":496.0,"ElevationUnits":"ft","Latitude":37.507,"Longitude":-88.692,"ViewsTotal":12092,"ViewsMonth":93,"SharedOn":"Oct 20, 2010","Overview":null,"Description":"Nice wall with some hidden classics. This wall is not named in the guidebook but is connected with Big Star Wall. To be more specific I named it after the classic 5.12 on a arete.","GettingThere":"Walk past Big Star Wall with \"Express Checkout Line\" and head around the corner. Starts with \"No Name Dihedral\" 5.9 trad.","URL":"https://www.mountainproject.com/area/106931632/big-star-wall-left"}
{"AreaId":112548464,"ParentAreaId":113717757,"AreaName":"Big Star Boulders","Elevation":559.0,"ElevationUnits":"ft","Latitude":37.506,"Longitude":-88.69,"ViewsTotal":8372,"ViewsMonth":161,"SharedOn":"Mar 13, 2017","Overview":null,"Description":"The base of Big Star wall is home to roughly 20 climbable boulders. The Sandstone Warrior guidebook lists an area they call Railroad Boulders but provides no detail about specific problems. Most if not all of the problems have likely been climbed in the past. This page will allow some documentation and perhaps clarification about the history of the problems. All names given here are just working titles. If you know of existing names for a problem just leave a comment or send a message and I'll update the info. Increased traffic to these boulders will hopefully keep them from getting overgrown again.","GettingThere":"Hike from the main parking lot to the north access point at Railroad Rock. Head straight down to the tracks and walk south for about 500' to an obvious trail leading away from the tracks toward Big Star Wall. The main hiking trail weaves through the middle of the boulder field.","URL":"https://www.mountainproject.com/area/112548464/big-star-boulders"}
{"AreaId":106931751,"ParentAreaId":113717757,"AreaName":"Hobo Cave","Elevation":528.0,"ElevationUnits":"ft","Latitude":37.508,"Longitude":-88.692,"ViewsTotal":11088,"ViewsMonth":85,"SharedOn":"Oct 20, 2010","Overview":null,"Description":"Shady area found on your way to Railroad Rock.","GettingThere":"Walk past Beaver Wall and Raging Intensity Wall until you reach a dark cave area with a huge roof.","URL":"https://www.mountainproject.com/area/106931751/hobo-cave"}
{"AreaId":106061358,"ParentAreaId":113717757,"AreaName":"Railroad Rock","Elevation":518.0,"ElevationUnits":"ft","Latitude":37.509,"Longitude":-88.692,"ViewsTotal":29941,"ViewsMonth":181,"SharedOn":"Nov 13, 2007","Overview":null,"Description":"Mostly shady and occasionaly damp, this area provides some of Jackson Falls's finest climbing and one of the hardest climbs.  This area is a bit of an approach, but well worth it.","GettingThere":"To get here is a bit of a haul by most Jackson Falls standard.  The two ways are to head either down the access roap and to the right (toward the Gallery) and walk for quite some time until you hit the Railroad.  Turn right and follow that until the crag is on your right.  The other way is to follow the trail on the top of the cliffline until the trail takes you to a third class scramble to the rear entrance of the area.","URL":"https://www.mountainproject.com/area/106061358/railroad-rock"}
{"AreaId":116100052,"ParentAreaId":113717757,"AreaName":"Railroad Rock Cliffline","Elevation":540.0,"ElevationUnits":"ft","Latitude":37.509,"Longitude":-88.692,"ViewsTotal":10222,"ViewsMonth":322,"SharedOn":"Nov 15, 2018","Overview":null,"Description":"This is the cliff line directly behind Railroad Rock. This area includes Slab Stick Comedy and Bottom Feeder. Note, this is known and Railroad Rock Back Wall in the newest guidebook.","GettingThere":"This is at Railroad Rock.","URL":"https://www.mountainproject.com/area/116100052/railroad-rock-cliffline"}
{"AreaId":107384920,"ParentAreaId":113717757,"AreaName":"Higher Ed Zone","Elevation":532.0,"ElevationUnits":"ft","Latitude":37.51,"Longitude":-88.692,"ViewsTotal":3796,"ViewsMonth":33,"SharedOn":"Nov 27, 2011","Overview":null,"Description":"The area is north of Rail Road rocks.  It has a small number of routes that don't get much use.","GettingThere":"There are two was to get there.  The first is to follow the trail above the climbing area and walk down the second class a access point just north of Rail Road rocks.  Then turn right and head north to higher education.  The second way to get there is to walk to Mr. Jimmy and the walk to the rail road tracks.  Walk along the tracks until you past R.R rocks.","URL":"https://www.mountainproject.com/area/107384920/higher-ed-zone"}
{"AreaId":107384927,"ParentAreaId":107384920,"AreaName":"Graduation formation","Elevation":null,"ElevationUnits":null,"Latitude":37.51,"Longitude":-88.692,"ViewsTotal":1673,"ViewsMonth":14,"SharedOn":"Nov 27, 2011","Overview":null,"Description":"This is two free standing rocks just west of Higher education area. ****I would not recommend this area.  The rap tree on the left face is dead.  It is a very risky decent.****","GettingThere":"From Higher Ed Zone look to the west.  You will see the two free standing rock formations.","URL":"https://www.mountainproject.com/area/107384927/graduation-formation"}
{"AreaId":113652757,"ParentAreaId":107384920,"AreaName":"Higher Ed Zone Main Wall","Elevation":568.0,"ElevationUnits":"ft","Latitude":37.51,"Longitude":-88.692,"ViewsTotal":894,"ViewsMonth":20,"SharedOn":"Oct 1, 2017","Overview":null,"Description":"Across from the Graduation Formation","GettingThere":"Opposite side of the 2nd class scramble from Railroad Rock","URL":"https://www.mountainproject.com/area/113652757/higher-ed-zone-main-wall"}
{"AreaId":106357476,"ParentAreaId":113717843,"AreaName":"The Gallery","Elevation":537.0,"ElevationUnits":"ft","Latitude":37.507,"Longitude":-88.685,"ViewsTotal":23254,"ViewsMonth":155,"SharedOn":"Feb 13, 2009","Overview":null,"Description":"The area receives sun almost all day, and is one of the first areas to dry out after a rain. The climbs in this area are consistently good, although sometimes similar in nature. Check out the area classic, Group Therapy for a lesson in pump or battle one of the areas ubiquitous bulges just around the corner on Cut/Sore/Deep Throat. Try to avoid gear sprawl on the trail here, as this is a fairly high traffic area.","GettingThere":"Approach from the North Falls by either rappelling or downclimbing and keep the rock on your right. The Gallery begins after a low roof with a ledge underneath and continues around the corner.     Or descend the dog walk, walk up canyon to the lovely tower, then follow the trail left across the canyon directly to the gallery.","URL":"https://www.mountainproject.com/area/106357476/the-gallery"}
{"AreaId":108438307,"ParentAreaId":113717843,"AreaName":"Black Sheep Boulder","Elevation":524.0,"ElevationUnits":"ft","Latitude":37.507,"Longitude":-88.686,"ViewsTotal":4932,"ViewsMonth":53,"SharedOn":"Nov 13, 2013","Overview":null,"Description":"Freestanding boulder down the hill from the route Group Therapy.  Between the Gallery and The Battle Axe Tower.","GettingThere":"Take trail down from the Gallery.","URL":"https://www.mountainproject.com/area/108438307/black-sheep-boulder"}
{"AreaId":109472694,"ParentAreaId":113717843,"AreaName":"Applejack Wall","Elevation":564.0,"ElevationUnits":"ft","Latitude":37.507,"Longitude":-88.686,"ViewsTotal":10133,"ViewsMonth":123,"SharedOn":"Sep 15, 2014","Overview":null,"Description":"Just past Group Therapy, Applejack Wall covers from just before Applejack Crack up to Rajun Cajun and also included in this section are the newly developed routes from Rajun Cajun, down to the west falls.","GettingThere":"A couple hundred feet down the trail on the right from Group Therapy at The Gallery.  A short dirt trail leads directly up to the wall at the base of Extinguisher.  Rajun Cajun is about 100ft right.","URL":"https://www.mountainproject.com/area/109472694/applejack-wall"}
{"AreaId":106814125,"ParentAreaId":113717843,"AreaName":"Battle Axe Tower","Elevation":596.0,"ElevationUnits":"ft","Latitude":37.506,"Longitude":-88.686,"ViewsTotal":20117,"ViewsMonth":151,"SharedOn":"Jul 1, 2010","Overview":null,"Description":"Shaded in the afternoon, sunny in the morning.","GettingThere":"Keep walking after the Gallery, pass a waterfall until you get to his big free standing tower.","URL":"https://www.mountainproject.com/area/106814125/battle-axe-tower"}
{"AreaId":111701616,"ParentAreaId":113717843,"AreaName":"Exam Wall","Elevation":598.0,"ElevationUnits":"ft","Latitude":37.507,"Longitude":-88.686,"ViewsTotal":22248,"ViewsMonth":347,"SharedOn":"Mar 16, 2016","Overview":null,"Description":"Popular area 150 yards south from West Fall. If we going south-west first are the wall with The Off-Width Exam crack on right site. At The Bolted One crack, the wall turning east and making corridor with the big, free standing Battle Axe Tower on left.","GettingThere":"From the Gallery you fallow the trail below the cliff to West Falls and ca 500’ south from there. Or shorter, below Gallery down to south-west, through the small creek and few dozen steps to north site of Battle Axe Tower.","URL":"https://www.mountainproject.com/area/111701616/exam-wall"}
{"AreaId":106931770,"ParentAreaId":113717843,"AreaName":"Dynasty Wall","Elevation":578.0,"ElevationUnits":"ft","Latitude":37.506,"Longitude":-88.687,"ViewsTotal":10494,"ViewsMonth":81,"SharedOn":"Oct 20, 2010","Overview":null,"Description":"Some hard routes and one moderate 5.9+","GettingThere":"Around the corner from Battle Ax and before The Munchkin boulder.","URL":"https://www.mountainproject.com/area/106931770/dynasty-wall"}
{"AreaId":106931789,"ParentAreaId":113717843,"AreaName":"The Munchkin Boulder","Elevation":563.0,"ElevationUnits":"ft","Latitude":37.505,"Longitude":-88.687,"ViewsTotal":1717,"ViewsMonth":13,"SharedOn":"Oct 20, 2010","Overview":null,"Description":"25ft high boulder past Battle Ax and Emperor Wall with one 5.9 route.","GettingThere":"Just past Emperor Wall.","URL":"https://www.mountainproject.com/area/106931789/the-munchkin-boulder"}
{"AreaId":106243146,"ParentAreaId":113718414,"AreaName":"Royal Arches Wall","Elevation":563.0,"ElevationUnits":"ft","Latitude":37.506,"Longitude":-88.682,"ViewsTotal":26101,"ViewsMonth":167,"SharedOn":"Sep 1, 2008","Overview":null,"Description":"After entering the canyon via the dogwalk keep right. Hike downhill and cross a small creek, then continue following the trail back uphill where it joins back up with the cliff line. One of the first predominant features you will notice is a large detached boulder. This is the Yosemite Slab, continue past it to reach the Royal Arches Wall. Begin looking for the route Tina's Soul Food Kitchen in an easy to spot gulley as pictured here                Tina’s Soul Food Kitchen      . Once you find this, the rest of the routes continue to your left.  This sector has a good concentration of routes and will tend to be busy on crowded weekends.","GettingThere":"From Lovely Tower: Continue following the bluff line until you come to an arching roof with a large concentration of bolted routes.      From Dog Walk: Continue past Yosemite Slab and look for a series of bolted lines that start a top a shelf.","URL":"https://www.mountainproject.com/area/106243146/royal-arches-wall"}
{"AreaId":106679423,"ParentAreaId":113718414,"AreaName":"Snakes Roof","Elevation":560.0,"ElevationUnits":"ft","Latitude":37.506,"Longitude":-88.683,"ViewsTotal":13039,"ViewsMonth":95,"SharedOn":"Feb 21, 2010","Overview":null,"Description":"Snakes Roof is the obvious roof that you come to right after passing Lovely Tower on your way to Hidden Peaks.  The roof itself has Three excellent lines, characterized by big moves on good holds.","GettingThere":"Drop down the rope at Lovely Tower and walk 150 feet to your right.","URL":"https://www.mountainproject.com/area/106679423/snakes-roof"}
{"AreaId":117544353,"ParentAreaId":113718414,"AreaName":"Fuzzclump Boulder","Elevation":565.0,"ElevationUnits":"ft","Latitude":37.507,"Longitude":-88.683,"ViewsTotal":1395,"ViewsMonth":61,"SharedOn":"Aug 4, 2019","Overview":null,"Description":"This boulder has 3 short toprope routes & is great for kids, beginners, and groups.","GettingThere":"Located directly behind Snake's Roof. To access the anchors, scramble up the backside of the boulder. There is a single bolt that can be used for protection in setting up the bolted anchors on the frontside of the boulder. Bolts donated courtesy of Southeast Mountain Guides.","URL":"https://www.mountainproject.com/area/117544353/fuzzclump-boulder"}
{"AreaId":106032476,"ParentAreaId":113718414,"AreaName":"Lovely Tower","Elevation":548.0,"ElevationUnits":"ft","Latitude":37.506,"Longitude":-88.683,"ViewsTotal":25776,"ViewsMonth":154,"SharedOn":"Sep 25, 2007","Overview":null,"Description":"Lovely Tower is a freestanding boulder as tall as Wave Wall, right next door. Of the six routes it holds, five are are bolted and four are must-dos, particularly the Lovely Arete (5.11a). If you climb in the 11-to-12 range, this is the block for you.","GettingThere":"From the Dog Walk Gully, begin hiking with the cliffline to your right, roughly North/North West. Follow the cliffline past the Royal Arches Wall and continue until the wall blends into a large roof formation. The large roof is known as Snakes Roof, keep walking past it and directly uphill is a detached, standalone section of cliffline. This tower is known as Lovely Tower.","URL":"https://www.mountainproject.com/area/106032476/lovely-tower"}
{"AreaId":106125042,"ParentAreaId":113718414,"AreaName":"Spleef Peak","Elevation":546.0,"ElevationUnits":"ft","Latitude":37.507,"Longitude":-88.683,"ViewsTotal":19615,"ViewsMonth":121,"SharedOn":"Mar 20, 2008","Overview":null,"Description":"a large detached \"boulder\" adjacent to the falls. Good routes from 5.9 to 12+","GettingThere":"Walk away from the falls toward the large \"boulder\" (someone can help me improve these \"directions\"","URL":"https://www.mountainproject.com/area/106125042/spleef-peak"}
{"AreaId":106410761,"ParentAreaId":113718414,"AreaName":"The Doors","Elevation":611.0,"ElevationUnits":"ft","Latitude":37.507,"Longitude":-88.683,"ViewsTotal":14298,"ViewsMonth":96,"SharedOn":"Apr 21, 2009","Overview":null,"Description":"The Doors is located 150 yards east of the north falls (if your looking at the falls east is to your right), adjacent to Spleef Peak. This area has about a dozen sport climbs from 11a to 14-, and a few descent trad lines. The doors is marked by 3 prominent dihedrals.","GettingThere":"150 yards east of north falls","URL":"https://www.mountainproject.com/area/106410761/the-doors"}
{"AreaId":106032506,"ParentAreaId":113718414,"AreaName":"Main Pool","Elevation":520.0,"ElevationUnits":"ft","Latitude":37.508,"Longitude":-88.683,"ViewsTotal":8448,"ViewsMonth":50,"SharedOn":"Sep 25, 2007","Overview":null,"Description":"Following the trail from the main parking and camping area brings you to the North Falls, where a hand line will bring you down to the climbing, right on top of the route Lovin' Lizards. Not one of the best spots in the canyon, but has a few lines worth doing.","GettingThere":"From the main camping area, follow the trail until you cliff out at the falls and locate the hand line. From the Dog Walk, just head north until you see the falls.","URL":"https://www.mountainproject.com/area/106032506/main-pool"}
{"AreaId":106683920,"ParentAreaId":113718414,"AreaName":"Wizard Wall","Elevation":562.0,"ElevationUnits":"ft","Latitude":37.508,"Longitude":-88.684,"ViewsTotal":11409,"ViewsMonth":83,"SharedOn":"Feb 25, 2010","Overview":null,"Description":"Long wall between The Gallery and North Falls Area. South - east face.  Few 5.9 trad and sport routes.","GettingThere":"Just 2-3 minutes from north falls.","URL":"https://www.mountainproject.com/area/106683920/wizard-wall"}
{"AreaId":107017152,"ParentAreaId":113728761,"AreaName":"Manky Alcove","Elevation":614.0,"ElevationUnits":"ft","Latitude":37.504,"Longitude":-88.681,"ViewsTotal":4599,"ViewsMonth":36,"SharedOn":"Jan 21, 2011","Overview":null,"Description":"Walking down the dog walk and taking a left (west) down the cliff line this is the first area with bolted routes (5) you will find.","GettingThere":"Walk down the dog walk, head west and walk for 100 yards or so.","URL":"https://www.mountainproject.com/area/107017152/manky-alcove"}
{"AreaId":108284145,"ParentAreaId":113728761,"AreaName":"Dolphin Rock Hallway","Elevation":643.0,"ElevationUnits":"ft","Latitude":37.504,"Longitude":-88.682,"ViewsTotal":4010,"ViewsMonth":42,"SharedOn":"Aug 11, 2013","Overview":null,"Description":"The hallway just prior to Rainy day roof. Shadey with a cool air pumping crack in the back.","GettingThere":"The hallway just prior to Rainy day roof","URL":"https://www.mountainproject.com/area/108284145/dolphin-rock-hallway"}
{"AreaId":106958063,"ParentAreaId":113728761,"AreaName":"Rainy Day Roof","Elevation":617.0,"ElevationUnits":"ft","Latitude":37.505,"Longitude":-88.684,"ViewsTotal":12233,"ViewsMonth":95,"SharedOn":"Nov 12, 2010","Overview":null,"Description":"Great for technical climbs and fancy foot work!","GettingThere":"Fastest approach is to descend the dog walk and continue walking down canyon (left), pass the manky alcove, then dolphin rock, and right around that corner you will arrive at this aptly named crag.","URL":"https://www.mountainproject.com/area/106958063/rainy-day-roof"}
{"AreaId":113728782,"ParentAreaId":113728773,"AreaName":"Industry Wall","Elevation":622.0,"ElevationUnits":"ft","Latitude":37.504,"Longitude":-88.685,"ViewsTotal":3221,"ViewsMonth":72,"SharedOn":"Oct 19, 2017","Overview":null,"Description":"This is the first area you reach after Rainy Day Roof. Worth the stop.","GettingThere":"Access the canyon via the dog walk. Continue past Rainy Day Roof, the next bolted route you find is Industry, and marks the beginning of the Industry Wall.","URL":"https://www.mountainproject.com/area/113728782/industry-wall"}
{"AreaId":113740378,"ParentAreaId":113728773,"AreaName":"Sheen Wall","Elevation":614.0,"ElevationUnits":"ft","Latitude":37.503,"Longitude":-88.685,"ViewsTotal":3912,"ViewsMonth":88,"SharedOn":"Oct 22, 2017","Overview":null,"Description":"Smaller area past the Industry Wall with some stout climbing","GettingThere":"First area past the Industry Wall. Locate Hearty Boys Crack and your there.","URL":"https://www.mountainproject.com/area/113740378/sheen-wall"}
{"AreaId":115364555,"ParentAreaId":113728773,"AreaName":"Hidden Peaks","Elevation":611.0,"ElevationUnits":"ft","Latitude":37.502,"Longitude":-88.686,"ViewsTotal":28040,"ViewsMonth":841,"SharedOn":"Sep 28, 2018","Overview":null,"Description":"This is an excellent, sublime clearing within a collection of freestanding towers (Prickler Peak, the Monument) and next to a sizeable crag holding a collection of good routes (Crainial/Detox wall).  Click on specific areas for more details.     This area also sports the 2nd class Emergency-Services entrance/exit to the canyon, is adjacent to the Helipad, and has a First Aid kit installed by the Beta Fund in 2017.","GettingThere":"On the rim from the main falls, hike 5 minutes past the Dogwalk gully to find the 2nd class down to the freestanding Hidden peaks.     15 minutes total from the road.    Alternatively, a usually-wet 5 minutes past the Dogwalk on the canyon floor brings you past the less-often climbed Industry & Sheen walls to accomplish the same thing.","URL":"https://www.mountainproject.com/area/115364555/hidden-peaks"}
{"AreaId":106954218,"ParentAreaId":113728773,"AreaName":"The Basement","Elevation":620.0,"ElevationUnits":"ft","Latitude":37.501,"Longitude":-88.688,"ViewsTotal":6161,"ViewsMonth":48,"SharedOn":"Nov 8, 2010","Overview":null,"Description":"Cold & Wet","GettingThere":"Just before the ranch","URL":"https://www.mountainproject.com/area/106954218/the-basement"}
{"AreaId":107090482,"ParentAreaId":113728773,"AreaName":"Belleville - Space Cowboy Wall","Elevation":611.0,"ElevationUnits":"ft","Latitude":37.501,"Longitude":-88.688,"ViewsTotal":13342,"ViewsMonth":107,"SharedOn":"Apr 4, 2011","Overview":null,"Description":"The wall that wraps around the Town Square (Between the basement and the SS Minnow).  This area is north-facing and shady.","GettingThere":"After passing the basement toward the minnow, there will be several bolted routes to your left before you enter the channel between Town Square and the wall.  The remainder of the routes are on the SSE wall, from the chimney to the corner.","URL":"https://www.mountainproject.com/area/107090482/belleville-space-cowboy-wall"}
{"AreaId":108112090,"ParentAreaId":113728773,"AreaName":"The SS Minnow","Elevation":576.0,"ElevationUnits":"ft","Latitude":37.5,"Longitude":-88.688,"ViewsTotal":5547,"ViewsMonth":56,"SharedOn":"Apr 27, 2013","Overview":null,"Description":"Large detached block with north and south exposure","GettingThere":"Heading south 150ft past the the Town Square block, across from Possum Grits","URL":"https://www.mountainproject.com/area/108112090/the-ss-minnow"}
{"AreaId":106061415,"ParentAreaId":113728773,"AreaName":"The Ranch","Elevation":598.0,"ElevationUnits":"ft","Latitude":37.5,"Longitude":-88.687,"ViewsTotal":17568,"ViewsMonth":106,"SharedOn":"Nov 13, 2007","Overview":null,"Description":"One of my favorite areas in all of the Falls.  A really cool south facing wall that I think holds some of the best climbing and is usuall devoid of people.","GettingThere":"When you take the access rope down turn left and cross the creek.  follow the trail for a long way (past The Monument and Rainy Day Roof) through the Town Square Area and then you are there.","URL":"https://www.mountainproject.com/area/106061415/the-ranch"}
{"AreaId":108188747,"ParentAreaId":113728773,"AreaName":"Vista Wall","Elevation":594.0,"ElevationUnits":"ft","Latitude":37.5,"Longitude":-88.687,"ViewsTotal":7158,"ViewsMonth":73,"SharedOn":"Jun 11, 2013","Overview":null,"Description":"5 new routes ranging from left to right 5.7, 5.6, 5.9-,5.9+, 5.11","GettingThere":"Slab just left of Cowboys and Cross Dressers.","URL":"https://www.mountainproject.com/area/108188747/vista-wall"}
{"AreaId":108112038,"ParentAreaId":113728773,"AreaName":"La Haceinda","Elevation":644.0,"ElevationUnits":"ft","Latitude":37.499,"Longitude":-88.687,"ViewsTotal":6058,"ViewsMonth":61,"SharedOn":"Apr 27, 2013","Overview":null,"Description":"Faces north","GettingThere":"South past the Ranch. Walls to the right and left of the waterfall","URL":"https://www.mountainproject.com/area/108112038/la-haceinda"}
{"AreaId":108167488,"ParentAreaId":113728773,"AreaName":"The Gentleman's Grotto","Elevation":646.0,"ElevationUnits":"ft","Latitude":37.498,"Longitude":-88.688,"ViewsTotal":8640,"ViewsMonth":88,"SharedOn":"May 29, 2013","Overview":null,"Description":"Full day shade with short, ~35', climbs","GettingThere":"Continuing along the main wall past the waterfall at the end of the Ranch and La Haceinda. The cliffline will shrink and then reappear. Continue to a hallway with a series of four close free standing towers","URL":"https://www.mountainproject.com/area/108167488/the-gentlemans-grotto"}
{"AreaId":113740425,"ParentAreaId":115364555,"AreaName":"Cranial/Detox Wall","Elevation":641.0,"ElevationUnits":"ft","Latitude":37.502,"Longitude":-88.685,"ViewsTotal":12092,"ViewsMonth":271,"SharedOn":"Oct 22, 2017","Overview":null,"Description":"The cliff line next to Hidden Peaks.","GettingThere":"From the dogwalk, continue left, following the cliff line. Go past the Industry Wall and continue until you reach two large separated towers. This is the cliff line next to the towers.","URL":"https://www.mountainproject.com/area/113740425/cranialdetox-wall"}
{"AreaId":113740456,"ParentAreaId":115364555,"AreaName":"Pricker Peak","Elevation":616.0,"ElevationUnits":"ft","Latitude":37.502,"Longitude":-88.686,"ViewsTotal":9489,"ViewsMonth":212,"SharedOn":"Oct 22, 2017","Overview":null,"Description":"Awesome climbing on a unique detached cliff line.","GettingThere":"Enter via the dog walk, and continue leftward along the cliff line. Go past the Industry Wall and eventually you will find an area with two large detached towers. Pricker Peak is the closer of the two towers and you enter the area.","URL":"https://www.mountainproject.com/area/113740456/pricker-peak"}
{"AreaId":113740476,"ParentAreaId":115364555,"AreaName":"The Monument","Elevation":608.0,"ElevationUnits":"ft","Latitude":37.502,"Longitude":-88.686,"ViewsTotal":9238,"ViewsMonth":207,"SharedOn":"Oct 22, 2017","Overview":null,"Description":"The second of the two detached towers of the Hidden Peaks.","GettingThere":"Enter via the dog walk and continue leftward along the cliff line. Go past the Industry Wall and you eventually reach two large detached towers. The Monument is the tower behind Pricker Peak.","URL":"https://www.mountainproject.com/area/113740476/the-monument"}
{"AreaId":119901282,"ParentAreaId":108794841,"AreaName":"New Sub-Area 2","Elevation":504.0,"ElevationUnits":"ft","Latitude":37.506,"Longitude":-88.684,"ViewsTotal":112,"ViewsMonth":15,"SharedOn":"Nov 11, 2020","Overview":null,"Description":"Enter a description of this area.","GettingThere":"Provide some directions to this area.","URL":"https://www.mountainproject.com/area/119901282/new-sub-area-2"}
{"AreaId":119901279,"ParentAreaId":108794841,"AreaName":"Yosemite Slab","Elevation":514.0,"ElevationUnits":"ft","Latitude":37.506,"Longitude":-88.684,"ViewsTotal":4759,"ViewsMonth":639,"SharedOn":"Nov 11, 2020","Overview":null,"Description":"Enter a description of this area.","GettingThere":"Provide some directions to this area.","URL":"https://www.mountainproject.com/area/119901279/yosemite-slab"}
{"AreaId":112464429,"ParentAreaId":108116766,"AreaName":"Alamo Boulder","Elevation":661.0,"ElevationUnits":"ft","Latitude":37.612,"Longitude":-89.409,"ViewsTotal":4181,"ViewsMonth":78,"SharedOn":"Jan 26, 2017","Overview":null,"Description":"A amazing boulder containing a handful of classics.","GettingThere":"Follow same directions as Texas Revolution Boulder. Only just past it and to the right into the clearing.","URL":"https://www.mountainproject.com/area/112464429/alamo-boulder"}
{"AreaId":112464387,"ParentAreaId":108116766,"AreaName":"Texas Revolution Boulder","Elevation":689.0,"ElevationUnits":"ft","Latitude":37.613,"Longitude":-89.409,"ViewsTotal":3395,"ViewsMonth":63,"SharedOn":"Jan 26, 2017","Overview":null,"Description":"A tall beautiful boulder with excellent problems on it.","GettingThere":"It's a little tricky getting to this boulder due to private property (although the boulder is on Shawnee). So please be very careful and respectful when getting to this boulder! For reference, this boulder is to the left, across the clearing from the Red Sea boulder. To get there without crossing private property, you must go up to where the entrance to the Sink Hole is, but instead of going down into it, head right, down the hill.","URL":"https://www.mountainproject.com/area/112464387/texas-revolution-boulder"}
{"AreaId":110027889,"ParentAreaId":108116766,"AreaName":"Red Sea Boulder","Elevation":660.0,"ElevationUnits":"ft","Latitude":37.613,"Longitude":-89.41,"ViewsTotal":15885,"ViewsMonth":204,"SharedOn":"Feb 3, 2015","Overview":null,"Description":"stand alone boulder with (at least) 3 phenomenal lines on it.","GettingThere":"continue on the trail past shadow of a man and atlas boulder.  will eventually head down hill a bit and come across a big boulder, climbs are to the left and on the back.  this is the last boulder with allowed access, so DO NOT GO PAST THIS BOULDER.","URL":"https://www.mountainproject.com/area/110027889/red-sea-boulder"}
{"AreaId":110027701,"ParentAreaId":108116766,"AreaName":"Atlas Boulder","Elevation":745.0,"ElevationUnits":"ft","Latitude":37.615,"Longitude":-89.409,"ViewsTotal":13228,"ViewsMonth":170,"SharedOn":"Feb 3, 2015","Overview":null,"Description":"Boulder with several climbs, the most popular being on the cliff side, atlas.","GettingThere":"continue following the trail past shadow of a man to the big boulder sitting basically on the trail. hard to miss.","URL":"https://www.mountainproject.com/area/110027701/atlas-boulder"}
{"AreaId":108577909,"ParentAreaId":108116766,"AreaName":"E: 911 Aretes","Elevation":765.0,"ElevationUnits":"ft","Latitude":37.616,"Longitude":-89.41,"ViewsTotal":6880,"ViewsMonth":76,"SharedOn":"Jan 13, 2014","Overview":null,"Description":"A small area nearby Shadow of a Man with a few worthwhile lowball problems. Very close to Shadow of a Man and Worm's Way, making it a good area to warm up in. Doesn't see nearly as much traffic as some of the more classic areas, but has a high concentration.","GettingThere":"From Shadow of a Man, walk uphill a bit towards the cliffline until you hit the trail that runs with the cliffline. Follow this for a little bit and there should be a small cluster of boulders to your right. Alternatively, simply walk uphill a bit from the Comfortably Numb face of the Shadow boulder. Shouldn't be hard to find.","URL":"https://www.mountainproject.com/area/108577909/e-911-aretes"}
{"AreaId":108312151,"ParentAreaId":108116766,"AreaName":"Shadow of a Man Area","Elevation":761.0,"ElevationUnits":"ft","Latitude":37.616,"Longitude":-89.41,"ViewsTotal":33512,"ViewsMonth":352,"SharedOn":"Aug 28, 2013","Overview":null,"Description":"The Shadow of a Man boulder and the surrounding area is home to a ton of problems ranging from very easy to very hard.","GettingThere":"From the Mollusk boulder, simply follow the trail until you reach the cliffline. The trail will fork to the left and to the right; the left fork leads to the Illuminati area, and the right fork leads to the Shadow of a Man boulder. Turn right and follow the trail until you hit a large, obvious boulder.","URL":"https://www.mountainproject.com/area/108312151/shadow-of-a-man-area"}
{"AreaId":120242089,"ParentAreaId":108116766,"AreaName":"Worms Way","Elevation":770.0,"ElevationUnits":"ft","Latitude":37.616,"Longitude":-89.41,"ViewsTotal":1187,"ViewsMonth":244,"SharedOn":"Jan 29, 2021","Overview":null,"Description":"Facing the Shadow of a Man boulder, turn around and walk to the cliffline. You will know you're here when you see an obvious, angling jug feature.","GettingThere":"Walk as if you are going to the Shadow of a Man area. it is the cliffline that faces it.","URL":"https://www.mountainproject.com/area/120242089/worms-way"}
{"AreaId":111305231,"ParentAreaId":108116766,"AreaName":"The Bar Stool","Elevation":734.0,"ElevationUnits":"ft","Latitude":37.616,"Longitude":-89.411,"ViewsTotal":6404,"ViewsMonth":94,"SharedOn":"Nov 14, 2015","Overview":null,"Description":"Nice little boulder with about 5 problems.","GettingThere":"Down the hill and left from Public Enemy Boulder","URL":"https://www.mountainproject.com/area/111305231/the-bar-stool"}
{"AreaId":108408290,"ParentAreaId":108116766,"AreaName":"Public Enemy Boulder","Elevation":652.0,"ElevationUnits":"ft","Latitude":37.618,"Longitude":-89.413,"ViewsTotal":16714,"ViewsMonth":179,"SharedOn":"Oct 27, 2013","Overview":null,"Description":"A short overhung boulder that features a variety of problems with some very cool holds.","GettingThere":"Following the main trail from the Mollusk, after passing by Tyler Durden and some more boulders you will hit a fork near the cliffline. The Public Enemy boulder is directly to your left.","URL":"https://www.mountainproject.com/area/108408290/public-enemy-boulder"}
{"AreaId":108411069,"ParentAreaId":108116766,"AreaName":"Tyler Durden Area","Elevation":701.0,"ElevationUnits":"ft","Latitude":37.616,"Longitude":-89.411,"ViewsTotal":11690,"ViewsMonth":125,"SharedOn":"Oct 28, 2013","Overview":null,"Description":"About halfway between the Mollusk boulder and the fork that leads to Public Enemy and Shadow of a Man is a sizable boulder to the left of the trail. There isn't a huge concentration of problems here, but what is here is quite good. A bit down the trail and to the right is a short boulder with a couple of easy climbs on it that for convenience sake is listed in this area.","GettingThere":"Take the trail from the Mollusk and you will pass a couple small boulders on your left before encountering a large clearing on the left with the Tyler Durden boulder. About 5 minutes from the Mollusk boulder.","URL":"https://www.mountainproject.com/area/108411069/tyler-durden-area"}
{"AreaId":108408789,"ParentAreaId":108116766,"AreaName":"Brown Cow Area","Elevation":694.0,"ElevationUnits":"ft","Latitude":37.615,"Longitude":-89.411,"ViewsTotal":25385,"ViewsMonth":272,"SharedOn":"Oct 27, 2013","Overview":null,"Description":"This area includes three separate boulders and a number of problems ranging from V0 to V6 including many unique and really fun V4s.","GettingThere":"From the Mollusk boulder, follow the path until you see a small creek and a trail that heads up a hill and to your right. If you get to Tyler Durden you have walked too far. Take this trail accross the stream and up the hill. You will arrive on the right side of the \"warmup\" boulder. If you continue past this boulder on the right side, you will come to a boulder with a obvious brown wall coated in chalk and many holds. This is Brown Cow.","URL":"https://www.mountainproject.com/area/108408789/brown-cow-area"}
{"AreaId":108312132,"ParentAreaId":108116766,"AreaName":"Mollusk Boulder","Elevation":625.0,"ElevationUnits":"ft","Latitude":37.616,"Longitude":-89.412,"ViewsTotal":15782,"ViewsMonth":166,"SharedOn":"Aug 28, 2013","Overview":null,"Description":"The first boulder you will encounter when you enter the Holy Boulders. Will have the obvious trademark slopy scoop feature on the right side of the boulder.","GettingThere":"Approx. 1 mile hike from parking. First boulder you arrive at.","URL":"https://www.mountainproject.com/area/108312132/mollusk-boulder"}
{"AreaId":111911328,"ParentAreaId":108116766,"AreaName":"Bubble Wrap Area","Elevation":643.0,"ElevationUnits":"ft","Latitude":37.618,"Longitude":-89.413,"ViewsTotal":4656,"ViewsMonth":76,"SharedOn":"Jun 7, 2016","Overview":null,"Description":"Two small clusters of boulders, each with a few problems. Located in a lesser travelled area off the trail before the more trafficked \"Main Area\" boulders. Grades range from V0 to V6, with the namesake of this area being Bubble Wrap, V6.","GettingThere":"Take the normal trail up from the parking lot. Continue past the  Mollusk, but take a left on the trail just before the first two boulders in the Tyler Durden area. (If you reach Tyler Durden proper or the Bar Stool, you have gone too far.) Shortly after taking this trail you will reach the Bubble Wrap boulder. Continue along the trail to reach the next cluster of boulders.","URL":"https://www.mountainproject.com/area/111911328/bubble-wrap-area"}
{"AreaId":113743045,"ParentAreaId":108116766,"AreaName":"Star Wars Boulder","Elevation":631.0,"ElevationUnits":"ft","Latitude":37.617,"Longitude":-89.413,"ViewsTotal":4979,"ViewsMonth":111,"SharedOn":"Oct 23, 2017","Overview":null,"Description":"Fun boulder providing great warm ups for the Bio-Terrorism Boulder. Check it out.","GettingThere":"This boulder is located uphill from Bio-Terrorism. The boulder is rather slabby with horizontal seams for holds. Locate the large Heuco.","URL":"https://www.mountainproject.com/area/113743045/star-wars-boulder"}
{"AreaId":112460442,"ParentAreaId":108116766,"AreaName":"Bio-Terrorism Boulder","Elevation":585.0,"ElevationUnits":"ft","Latitude":37.619,"Longitude":-89.415,"ViewsTotal":3807,"ViewsMonth":71,"SharedOn":"Jan 23, 2017","Overview":null,"Description":"A large boulder on Shawnee property that holds a handful of problems.","GettingThere":"Starting at the problem Bubble Wrap, continue towards the problem Hourglass. From here look into the woods, you should be able to see tags on the trees. These tags should lead you to the Bio-Terrorism boulder.","URL":"https://www.mountainproject.com/area/112460442/bio-terrorism-boulder"}
{"AreaId":112464366,"ParentAreaId":108116766,"AreaName":"Chernobyl Boulder","Elevation":431.0,"ElevationUnits":"ft","Latitude":37.62,"Longitude":-89.417,"ViewsTotal":1530,"ViewsMonth":29,"SharedOn":"Jan 26, 2017","Overview":null,"Description":"A lonely boulder that has one problem on it.","GettingThere":"Starting from the parking lot, walk up the trail till you see the first boulder to your left in the clearing. This is the Chernobyl boulder.","URL":"https://www.mountainproject.com/area/112464366/chernobyl-boulder"}
{"AreaId":108312209,"ParentAreaId":108116766,"AreaName":"Illuminati Boulders","Elevation":736.0,"ElevationUnits":"ft","Latitude":37.617,"Longitude":-89.411,"ViewsTotal":30722,"ViewsMonth":323,"SharedOn":"Aug 28, 2013","Overview":null,"Description":"One of the more popular areas at the holys, this collection of boulders offer classic moderates such as Enlightenment (V4) and Undercling King (V6) as well as rarely repeated but just as classic testpieces such as Michael Jordan (V11/12) and The New Zero (V13) and a number of other great jems in between. Easy to find and a great area to spend a whole day session ing some of So Ills best boulders.    **MANY OF THESE BOULDERS CAN BE SEEN HERE***https://vimeo.com/38856823  vimeo.com/63945016","GettingThere":"Follow the trail from the Mullusk boulder to a split. To your right is a tall boulder with a few face climbs and further down a classic V5, Shadow of a Man. To your left is a shorter cliffline like boulder. Turn left and follow the trail until you come upon an arête with juggy slopers pinches and huecos. This is \"Enlightenment\" (V4)","URL":"https://www.mountainproject.com/area/108312209/illuminati-boulders"}
{"AreaId":111359223,"ParentAreaId":108116766,"AreaName":"Jump for Jesus Area","Elevation":642.0,"ElevationUnits":"ft","Latitude":37.618,"Longitude":-89.413,"ViewsTotal":23538,"ViewsMonth":347,"SharedOn":"Nov 28, 2015","Overview":null,"Description":"A collection of boulders with a variety of different styles of problems, from a dyno to a fingercrack to slabs and more.","GettingThere":"Continue down the trail after the Illuminati boulders. There are two trails that cut downhill to this area. The first brings you down to the bottom past Bill Cosby to Jump for Jesus. The second brings you down past the Full Grain slab then down below to the left side of Jump for Jesus.","URL":"https://www.mountainproject.com/area/111359223/jump-for-jesus-area"}
{"AreaId":120240692,"ParentAreaId":108116766,"AreaName":"Cliffline Problems","Elevation":726.0,"ElevationUnits":"ft","Latitude":37.619,"Longitude":-89.411,"ViewsTotal":657,"ViewsMonth":134,"SharedOn":"Jan 28, 2021","Overview":null,"Description":"These are the boulder problems that are on the cliffline starting near the Illuminati Boulders","GettingThere":"It's the cliffline. Refer to photos/problems for specifics.","URL":"https://www.mountainproject.com/area/120240692/cliffline-problems"}
{"AreaId":108587347,"ParentAreaId":108116766,"AreaName":"Brown Recluse Boulder","Elevation":532.0,"ElevationUnits":"ft","Latitude":37.618,"Longitude":-89.415,"ViewsTotal":6243,"ViewsMonth":69,"SharedOn":"Jan 17, 2014","Overview":null,"Description":"A beautiful boulder with one of the best problems for the grade the Midwest has to offer. Worth the hike. Nice, relaxing vibe.","GettingThere":"The main trial of the Holies, when followed long enough, will basically lead you to this problem, as it is the last boulder that is located on this trail. From the Mollusk, follow it to Illuminati and walk past the problems here, continuing on the main, best-defined trial. Walk past a creek and after a bit of walking there should be some very tall boulders directly on your right and two big slabs down and left indicating you are at the Jump for Jesus area. Continue on the main trail past these slabs for about 3 minutes until you see a large boulder on your left, with the faces viewable from the trail likely covered in moss. The trail will then take your left and down a short but steep hill, depositing you in front of Brown Recluse.","URL":"https://www.mountainproject.com/area/108587347/brown-recluse-boulder"}
{"AreaId":108601176,"ParentAreaId":108116766,"AreaName":"Vultures Nest Boulders","Elevation":724.0,"ElevationUnits":"ft","Latitude":37.62,"Longitude":-89.411,"ViewsTotal":8577,"ViewsMonth":95,"SharedOn":"Jan 22, 2014","Overview":null,"Description":"Nice exposed sloped feature for the top-out. This small area holds problems ranging from V1-V7+.","GettingThere":"This boulder is located just up the hill from Brown Recluse on the main cliff line. The top is a massive sloped feature and is nicely cleaned, making it hard to miss.","URL":"https://www.mountainproject.com/area/108601176/vultures-nest-boulders"}
{"AreaId":110192011,"ParentAreaId":108116766,"AreaName":"Open Gates Boulder","Elevation":701.0,"ElevationUnits":"ft","Latitude":37.62,"Longitude":-89.411,"ViewsTotal":8370,"ViewsMonth":110,"SharedOn":"Mar 15, 2015","Overview":null,"Description":"Like many of the boulders at the Holies, this one has recently seen some development and now offers one of the most popular moderates in the area. That being said, there's clearly still more potential yet to be sussed out.","GettingThere":"Take the trail straight down the hill from the Vulture's Nest area. This overhanging boulder will appear on your right. Follow the trail around the backside to find several steep, nicely featured climbs.","URL":"https://www.mountainproject.com/area/110192011/open-gates-boulder"}
{"AreaId":112510408,"ParentAreaId":108116766,"AreaName":"Bowfin Boulder","Elevation":637.0,"ElevationUnits":"ft","Latitude":37.619,"Longitude":-89.413,"ViewsTotal":1670,"ViewsMonth":32,"SharedOn":"Feb 22, 2017","Overview":null,"Description":"Another boulder hidden in the woods like bioterrorism. I'm pretty sure it just has one problem on it.","GettingThere":"Starting from Open Gates, go down the lower trail for about a minute, then head downhill. Starting from Bio-Terrorism, head towards Open Gates and you should come across Bowfin.","URL":"https://www.mountainproject.com/area/112510408/bowfin-boulder"}
{"AreaId":112296291,"ParentAreaId":108116766,"AreaName":"The Sinkhole","Elevation":768.0,"ElevationUnits":"ft","Latitude":37.615,"Longitude":-89.407,"ViewsTotal":7134,"ViewsMonth":127,"SharedOn":"Nov 6, 2016","Overview":null,"Description":"The Sinkhole area is a recently developed and opened area just above the cliffline, partially removed from the rest of the main boulder field. It is currently home to 20-30 problems of a variety of grades.    If anyone knows the actual names of existing problems, please let me know so I can update them.","GettingThere":"Take the main trail up past the Mollusk, through the Shadow of a Man area, and down the cliffline to the right until you reach an intersection in the trail. Continue up the trail, to the left (continuing on the trail will bring you to Atlas boulder), to a very short scramble up the dirt trail to the top of the cliffline. Follow this trail until it merges with a larger trail and trends left for a few feet until a new trail can be taken on the right down into the Sinkhole valley.","URL":"https://www.mountainproject.com/area/112296291/the-sinkhole"}
{"AreaId":111201977,"ParentAreaId":108116766,"AreaName":"Cliffline Trad","Elevation":795.0,"ElevationUnits":"ft","Latitude":37.617,"Longitude":-89.411,"ViewsTotal":3607,"ViewsMonth":52,"SharedOn":"Oct 23, 2015","Overview":null,"Description":"Extensive bluff along the eastern edge of the Holy Boulders property. Seem to stay pretty shady when the leaves are on the trees, expect it gets enough sun to stay warm in the winter.","GettingThere":"Follow the main trail to Worm's Way and Shadow of a Man. The cliff is just uphill from them.","URL":"https://www.mountainproject.com/area/111201977/cliffline-trad"}
{"AreaId":112814830,"ParentAreaId":112811935,"AreaName":"Quetil Trail Bluff","Elevation":785.0,"ElevationUnits":"ft","Latitude":37.569,"Longitude":-89.315,"ViewsTotal":14806,"ViewsMonth":289,"SharedOn":"Apr 10, 2017","Overview":null,"Description":"This is the rock just off/basically touching the Quetil Trail","GettingThere":"Park at the Quetil Trail parking lot, hike for two minutes and you will reach the cliff line. These route are the first one's you find as you hike in.","URL":"https://www.mountainproject.com/area/112814830/quetil-trail-bluff"}
{"AreaId":112811951,"ParentAreaId":112811935,"AreaName":"Carol Lamb's Bedroom","Elevation":792.0,"ElevationUnits":"ft","Latitude":37.569,"Longitude":-89.316,"ViewsTotal":2912,"ViewsMonth":57,"SharedOn":"Apr 9, 2017","Overview":null,"Description":"Hidden through a narrow hallway, this area lies behind the Quetil Trail cliff line. Inside a square shaped corridor lies the inscription of Carol Lamb.","GettingThere":"Inside the first corridor when you come down the trail.","URL":"https://www.mountainproject.com/area/112811951/carol-lambs-bedroom"}
{"AreaId":113906990,"ParentAreaId":112811935,"AreaName":"Root Beer Saloon","Elevation":794.0,"ElevationUnits":"ft","Latitude":37.568,"Longitude":-89.314,"ViewsTotal":2471,"ViewsMonth":57,"SharedOn":"Dec 5, 2017","Overview":null,"Description":"This is the wall located directly behind the railroad boulder. The route Fitz's can be found here.","GettingThere":"From the parking area hike 5ish minutes and this wall is located behind a boulder.","URL":"https://www.mountainproject.com/area/113906990/root-beer-saloon"}
{"AreaId":114487487,"ParentAreaId":112811935,"AreaName":"Red Bud Meadow","Elevation":793.0,"ElevationUnits":"ft","Latitude":37.569,"Longitude":-89.315,"ViewsTotal":2046,"ViewsMonth":56,"SharedOn":"Jun 16, 2018","Overview":null,"Description":"This is the meadow siginified by the opening of the cliff line from the main trail, and the overhung wall where Flying Pig is located. In the spring you will find a blooming Red Bud tree.","GettingThere":"Hike past the Root Beer Saloon and look for where the cliff line opens up away from the trail.","URL":"https://www.mountainproject.com/area/114487487/red-bud-meadow"}
{"AreaId":114488626,"ParentAreaId":112811935,"AreaName":"Overlook Wall","Elevation":801.0,"ElevationUnits":"ft","Latitude":37.568,"Longitude":-89.314,"ViewsTotal":987,"ViewsMonth":27,"SharedOn":"Jun 16, 2018","Overview":null,"Description":"This is the wall directly underneath the famous overlook of Alto Pass.","GettingThere":"Hike down the trail to Red Bud Meadow, and go to where the cliff line goes into the woods. Here is the Overlook Wall","URL":"https://www.mountainproject.com/area/114488626/overlook-wall"}
{"AreaId":113830211,"ParentAreaId":112811935,"AreaName":"Bouldering","Elevation":729.0,"ElevationUnits":"ft","Latitude":37.568,"Longitude":-89.316,"ViewsTotal":8279,"ViewsMonth":189,"SharedOn":"Nov 15, 2017","Overview":null,"Description":"Although Alto Pass is known as a great place to begin sport climbing outdoor, several fun boulder problems exist as well.","GettingThere":"Check out specific boulders for more details","URL":"https://www.mountainproject.com/area/113830211/bouldering"}
{"AreaId":113830296,"ParentAreaId":113830211,"AreaName":"420 Boulder","Elevation":757.0,"ElevationUnits":"ft","Latitude":37.568,"Longitude":-89.315,"ViewsTotal":478,"ViewsMonth":11,"SharedOn":"Nov 15, 2017","Overview":null,"Description":"Located just off the trail, the 420 boulder is tall and has several boulder problems located on it.","GettingThere":"Hike down the trail and this is the first large boulder on the right. Note this will have \"420\" graffitied on the uphill side of it. Refer to photo for exact location.","URL":"https://www.mountainproject.com/area/113830296/420-boulder"}
{"AreaId":113830357,"ParentAreaId":113830211,"AreaName":"Cliffside Bouldering","Elevation":791.0,"ElevationUnits":"ft","Latitude":37.569,"Longitude":-89.316,"ViewsTotal":1081,"ViewsMonth":25,"SharedOn":"Nov 15, 2017","Overview":null,"Description":"Sections of the cliff line are short and make for great bouldering.","GettingThere":"Short sections of the clifflike. Refer to photos for specifics.","URL":"https://www.mountainproject.com/area/113830357/cliffside-bouldering"}
{"AreaId":118810558,"ParentAreaId":113830211,"AreaName":"Creek Boulder","Elevation":785.0,"ElevationUnits":"ft","Latitude":37.57,"Longitude":-89.316,"ViewsTotal":298,"ViewsMonth":21,"SharedOn":"Apr 29, 2020","Overview":null,"Description":"Short broken cliff line that follows a creek drainage.  Potential for a few more problems.","GettingThere":"From parking lot, first left hand side trail that follows the initial cliff band you encounter towards the road.  Follow this back to a drainage/creek area and you will see a short, pocketed overhanging section.","URL":"https://www.mountainproject.com/area/118810558/creek-boulder"}
{"AreaId":113830234,"ParentAreaId":113830211,"AreaName":"Eye of Sauron Boulder","Elevation":729.0,"ElevationUnits":"ft","Latitude":37.568,"Longitude":-89.316,"ViewsTotal":661,"ViewsMonth":15,"SharedOn":"Nov 15, 2017","Overview":null,"Description":"This boulder is easy to pick out due to the two pronounced horns located on the top of it. It contains several easy to moderate boulder problems.","GettingThere":"Walk downhill from the 420 Boulder refer to photos for specifics.","URL":"https://www.mountainproject.com/area/113830234/eye-of-sauron-boulder"}
{"AreaId":113830314,"ParentAreaId":113830211,"AreaName":"Railroad Boulder","Elevation":787.0,"ElevationUnits":"ft","Latitude":37.569,"Longitude":-89.315,"ViewsTotal":3040,"ViewsMonth":69,"SharedOn":"Nov 15, 2017","Overview":null,"Description":"Large boulder located directly on the trail.","GettingThere":"Hike down the trail, this boulder is on the left and located in front of the sport route Fitz's. Refer to photo for specifics","URL":"https://www.mountainproject.com/area/113830314/railroad-boulder"}
{"AreaId":112851604,"ParentAreaId":113830211,"AreaName":"Southern Overhang","Elevation":702.0,"ElevationUnits":"ft","Latitude":37.567,"Longitude":-89.315,"ViewsTotal":1414,"ViewsMonth":28,"SharedOn":"Apr 24, 2017","Overview":null,"Description":"Lots of bouldering potential here.","GettingThere":"Refer to specific directions, boulders, or photos.","URL":"https://www.mountainproject.com/area/112851604/southern-overhang"}
{"AreaId":113830305,"ParentAreaId":113830211,"AreaName":"Tom Dooley Boulder","Elevation":714.0,"ElevationUnits":"ft","Latitude":37.568,"Longitude":-89.316,"ViewsTotal":853,"ViewsMonth":19,"SharedOn":"Nov 15, 2017","Overview":null,"Description":"The tallest boulder downhill from the trail. Has a featured face that blends into a tall slab.","GettingThere":"Downhill from the 420 Boulder. This boulder is easily distinguishable by the large/tall slab on top of it. Refer to photo for specifics","URL":"https://www.mountainproject.com/area/113830305/tom-dooley-boulder"}
{"AreaId":107014918,"ParentAreaId":107014884,"AreaName":"Sex on the Beach","Elevation":347.0,"ElevationUnits":"ft","Latitude":37.667,"Longitude":-89.514,"ViewsTotal":7285,"ViewsMonth":57,"SharedOn":"Jan 19, 2011","Overview":null,"Description":"This is one of the first boulders you will encounter and one of the best!  Perfect sandy landings around the block with ten or so problems circling the boulder.  The steep southern side hosts the namesake problem \"Sex on the Beach\" (V4)","GettingThere":"Follow the directions on how to get to The Beach and this is the first boulder you will come to.","URL":"https://www.mountainproject.com/area/107014918/sex-on-the-beach"}
{"AreaId":116620853,"ParentAreaId":107014884,"AreaName":"Sunset Boulders","Elevation":344.0,"ElevationUnits":"ft","Latitude":37.667,"Longitude":-89.514,"ViewsTotal":596,"ViewsMonth":22,"SharedOn":"Mar 18, 2019","Overview":null,"Description":"A good assortment of moderate boulder problems.","GettingThere":"50 yards from the Picnic Boulders","URL":"https://www.mountainproject.com/area/116620853/sunset-boulders"}
{"AreaId":116620865,"ParentAreaId":107014884,"AreaName":"Picnic Boulders","Elevation":344.0,"ElevationUnits":"ft","Latitude":37.668,"Longitude":-89.514,"ViewsTotal":604,"ViewsMonth":22,"SharedOn":"Mar 18, 2019","Overview":null,"Description":"Tall boulder that needs low river levels to access. If the flow is low, check out Tall Boy","GettingThere":"50 yards from the Sunset Boulder","URL":"https://www.mountainproject.com/area/116620865/picnic-boulders"}
{"AreaId":116620886,"ParentAreaId":107014884,"AreaName":"The Gallery","Elevation":348.0,"ElevationUnits":"ft","Latitude":37.672,"Longitude":-89.513,"ViewsTotal":476,"ViewsMonth":17,"SharedOn":"Mar 18, 2019","Overview":null,"Description":"A short boulder with easy lines.","GettingThere":"10 minute walk North from the Picnic Boulder","URL":"https://www.mountainproject.com/area/116620886/the-gallery"}
{"AreaId":116620902,"ParentAreaId":107014884,"AreaName":"The Wasteland","Elevation":344.0,"ElevationUnits":"ft","Latitude":37.672,"Longitude":-89.513,"ViewsTotal":793,"ViewsMonth":29,"SharedOn":"Mar 18, 2019","Overview":null,"Description":"Super featured boulder with an abundance of problems.","GettingThere":"A few minute walk from the Gallery","URL":"https://www.mountainproject.com/area/116620902/the-wasteland"}
{"AreaId":112398774,"ParentAreaId":107014884,"AreaName":"Bootleg Boulder","Elevation":344.0,"ElevationUnits":"ft","Latitude":37.674,"Longitude":-89.513,"ViewsTotal":2097,"ViewsMonth":38,"SharedOn":"Dec 19, 2016","Overview":null,"Description":"This boulder is a hollow, saucer shaped boulder home to a handful of problems.","GettingThere":"From the Sex on the Beach boulder, walk down the beach. The Bootleg boulder is almost at the end of the boulder field, before the Nessy boulder and the Lunkers.","URL":"https://www.mountainproject.com/area/112398774/bootleg-boulder"}
{"AreaId":112464168,"ParentAreaId":107014884,"AreaName":"Nessy","Elevation":344.0,"ElevationUnits":"ft","Latitude":37.674,"Longitude":-89.512,"ViewsTotal":1004,"ViewsMonth":19,"SharedOn":"Jan 26, 2017","Overview":null,"Description":"One of the biggest, if not the biggest boulder at the beach. Nessy has a handful of problems, including some that are stil projects! Unfortunately, to be able to climb this problem, the water levels have to be pretty low (around 10ft).","GettingThere":"Nessy is between the Bootleg boulder and the Lunkers.","URL":"https://www.mountainproject.com/area/112464168/nessy"}
{"AreaId":109211811,"ParentAreaId":107014884,"AreaName":"The Lunkers","Elevation":347.0,"ElevationUnits":"ft","Latitude":37.675,"Longitude":-89.512,"ViewsTotal":1601,"ViewsMonth":19,"SharedOn":"Jul 10, 2014","Overview":null,"Description":"Two very featured boulders loaded with problems.","GettingThere":"Refer to the Sandstone Warrior guidebook.","URL":"https://www.mountainproject.com/area/109211811/the-lunkers"}
{"AreaId":110006313,"ParentAreaId":110006177,"AreaName":"Playground Wall -Detention Area","Elevation":685.0,"ElevationUnits":"ft","Latitude":37.519,"Longitude":-89.027,"ViewsTotal":11470,"ViewsMonth":147,"SharedOn":"Jan 29, 2015","Overview":null,"Description":"The is the first wall you come to upon completion of the approach","GettingThere":"From the parking lot at the church, hike up the old road and eventually you will reach the cliff line after about 10 minutes","URL":"https://www.mountainproject.com/area/110006313/playground-wall-detention-area"}
{"AreaId":112883029,"ParentAreaId":110006177,"AreaName":"Above Detention Wall","Elevation":685.0,"ElevationUnits":"ft","Latitude":37.519,"Longitude":-89.027,"ViewsTotal":1630,"ViewsMonth":33,"SharedOn":"May 8, 2017","Overview":null,"Description":"100 feet to the left of Africa is a hallway that leads up and right to a large ledge.","GettingThere":"100 feet left of Africa","URL":"https://www.mountainproject.com/area/112883029/above-detention-wall"}
{"AreaId":110006202,"ParentAreaId":110006177,"AreaName":"Little Big Wall","Elevation":685.0,"ElevationUnits":"ft","Latitude":37.519,"Longitude":-89.027,"ViewsTotal":2062,"ViewsMonth":26,"SharedOn":"Jan 29, 2015","Overview":null,"Description":"From the overhang, step back and look up at the lower left part of the upper wall. Locate a fixed belay station atop a grassy ledge. This serves as a belay station for the routes topping out","GettingThere":"Upon reaching the cliff line via the approach trail, turn left and walk until you reach the large overhang.","URL":"https://www.mountainproject.com/area/110006202/little-big-wall"}
{"AreaId":110006328,"ParentAreaId":110006177,"AreaName":"PG Wall -Coal House Area","Elevation":685.0,"ElevationUnits":"ft","Latitude":37.519,"Longitude":-89.027,"ViewsTotal":10745,"ViewsMonth":138,"SharedOn":"Jan 29, 2015","Overview":null,"Description":"The right fork in the main trail leads directly to the Coal House Area.","GettingThere":"From the approach trail, head right when you reach the cliff line","URL":"https://www.mountainproject.com/area/110006328/pg-wall-coal-house-area"}
{"AreaId":112883018,"ParentAreaId":110006177,"AreaName":"Bouldering","Elevation":637.0,"ElevationUnits":"ft","Latitude":37.518,"Longitude":-89.025,"ViewsTotal":7666,"ViewsMonth":153,"SharedOn":"May 8, 2017","Overview":null,"Description":"Cedar Bluff has a fair amount of good boulder problems available. Click on each individual boulder for more information","GettingThere":"Click on each specific boulder for more information.","URL":"https://www.mountainproject.com/area/112883018/bouldering"}
{"AreaId":110006430,"ParentAreaId":112883018,"AreaName":"Bouldering Cave","Elevation":null,"ElevationUnits":null,"Latitude":37.518,"Longitude":-89.025,"ViewsTotal":4255,"ViewsMonth":55,"SharedOn":"Jan 29, 2015","Overview":null,"Description":"Less than 100 yards from Cool Down. it is the large cave providing many pump problems","GettingThere":"Hike east from Cool Down and you will reach a gully that takes you to the top. Just past that is the Bouldering Cave","URL":"https://www.mountainproject.com/area/110006430/bouldering-cave"}
{"AreaId":110006394,"ParentAreaId":112883018,"AreaName":"Maynjo Boulder","Elevation":null,"ElevationUnits":null,"Latitude":37.518,"Longitude":-89.025,"ViewsTotal":1767,"ViewsMonth":23,"SharedOn":"Jan 29, 2015","Overview":null,"Description":"This boulder defines the right side of a dihedral which starts about 30 paces west of the bouldering cave. There are 2 cool v4ish problems on the side which is (at first) hidden from view.","GettingThere":"Before the bouldering cave on the right side of trail","URL":"https://www.mountainproject.com/area/110006394/maynjo-boulder"}
{"AreaId":110006382,"ParentAreaId":112883018,"AreaName":"Trinity Boulder","Elevation":null,"ElevationUnits":null,"Latitude":37.518,"Longitude":-89.025,"ViewsTotal":1704,"ViewsMonth":22,"SharedOn":"Jan 29, 2015","Overview":null,"Description":"Locate the boulder on the left side of the trail before the overhang","GettingThere":"Head up the trail from the church and hang right at the bluff line, they are about 20 ft before you hit the cave, in an overhang.","URL":"https://www.mountainproject.com/area/110006382/trinity-boulder"}
{"AreaId":120346154,"ParentAreaId":114335250,"AreaName":"18th St Bridge","Elevation":586.0,"ElevationUnits":"ft","Latitude":41.858,"Longitude":-87.632,"ViewsTotal":200,"ViewsMonth":56,"SharedOn":"Mar 3, 2021","Overview":null,"Description":"Between Clark St and Wentworth Ave in the south loop on 18th st. The underpass has 4 separate sets of man-made limestone walls, totaling around 200 ft of traverse climbing, with endless boulder problem potential.","GettingThere":"There are a few free parking spaces available on Wentworth Ave, north of 18th St, as well as on 18th st east of Clark. There is also paid parking availability on Wentworth. The walls total 1 city block, between Wentworth and Clark, so parking and walking should be relatively easy.","URL":"https://www.mountainproject.com/area/120346154/18th-st-bridge"}
{"AreaId":118088097,"ParentAreaId":114335250,"AreaName":"Blue Island Bridge","Elevation":596.0,"ElevationUnits":"ft","Latitude":41.653,"Longitude":-87.684,"ViewsTotal":601,"ViewsMonth":31,"SharedOn":"Nov 24, 2019","Overview":null,"Description":"This old concrete bridge is just ruined enough to have a few potential climbs on it. If you're close by it is a fun time.","GettingThere":"From Western, take Vermont St. west. Take a left on Ann St.   Park in the lot by the school. Walk south down Ann St. until it dead ends. There should be a bridge on your right. Slip between the left side of the bridge and the concrete wall. You will see Stony Creek at the bottom. The wall is on your left.","URL":"https://www.mountainproject.com/area/118088097/blue-island-bridge"}
{"AreaId":114086601,"ParentAreaId":114335250,"AreaName":"Chicago Buildering","Elevation":600.0,"ElevationUnits":"ft","Latitude":41.895,"Longitude":-87.606,"ViewsTotal":25848,"ViewsMonth":635,"SharedOn":"Feb 14, 2018","Overview":null,"Description":"This seems to be a legit activity in Chicago, so why not list all climbs here! Post your buildering spot and share with others.","GettingThere":"Click on specific areas for more details.","URL":"https://www.mountainproject.com/area/114086601/chicago-buildering"}
{"AreaId":119774284,"ParentAreaId":114335250,"AreaName":"Elmhurst Area","Elevation":628.0,"ElevationUnits":"ft","Latitude":41.879,"Longitude":-87.869,"ViewsTotal":390,"ViewsMonth":47,"SharedOn":"Oct 19, 2020","Overview":null,"Description":"Elmhurst is a west suburb of Chicago.  so far there isn't much known/discovered about the bouldering scene here but there's potential for some good bouldering in and around certain areas!","GettingThere":"Straight west about 20 miles from downtown Chicago.","URL":"https://www.mountainproject.com/area/119774284/elmhurst-area"}
{"AreaId":117775178,"ParentAreaId":114335250,"AreaName":"Henry C. Palmisano Nature Park","Elevation":593.0,"ElevationUnits":"ft","Latitude":41.842,"Longitude":-87.649,"ViewsTotal":9646,"ViewsMonth":452,"SharedOn":"Sep 22, 2019","Overview":null,"Description":"Man made boulders","GettingThere":"Palmisano park right off 29th street near the West entrance","URL":"https://www.mountainproject.com/area/117775178/henry-c-palmisano-nature-park"}
{"AreaId":117020563,"ParentAreaId":114335250,"AreaName":"Lies Area","Elevation":781.0,"ElevationUnits":"ft","Latitude":41.929,"Longitude":-88.108,"ViewsTotal":1191,"ViewsMonth":47,"SharedOn":"May 25, 2019","Overview":null,"Description":"8 ft. boulder on the side of Lies road.","GettingThere":"Off of Lies road.","URL":"https://www.mountainproject.com/area/117020563/lies-area"}
{"AreaId":114335319,"ParentAreaId":114335250,"AreaName":"Louis Pasteur Statue Park","Elevation":590.0,"ElevationUnits":"ft","Latitude":41.859,"Longitude":-87.671,"ViewsTotal":4491,"ViewsMonth":118,"SharedOn":"May 5, 2018","Overview":null,"Description":"Cute little park, very nice little Yoda Lowball boulder here. Just try not to chalk it up too much, so that we don't piss anyone off and can keep it climbable. The first real rock boulder that I know of in Chicago!","GettingThere":"Right off 290 the park is next to Rush University Medical Center.  Very Hard to miss. So is the boulder.","URL":"https://www.mountainproject.com/area/114335319/louis-pasteur-statue-park"}
{"AreaId":119859063,"ParentAreaId":114335250,"AreaName":"Montrose Lakefront Trail Bridge","Elevation":596.0,"ElevationUnits":"ft","Latitude":41.962,"Longitude":-87.644,"ViewsTotal":691,"ViewsMonth":91,"SharedOn":"Nov 3, 2020","Overview":null,"Description":"The bridge where the lakefront trail goes under Montrose. Rough limestone blocks, squared sandstone cornerstones, lots of fun.","GettingThere":"Travel time from the lakefront trail: 0min    Travel time from Montrose Ave: 0min","URL":"https://www.mountainproject.com/area/119859063/montrose-lakefront-trail-bridge"}
{"AreaId":116484487,"ParentAreaId":114335250,"AreaName":"Romeo Rock","Elevation":657.0,"ElevationUnits":"ft","Latitude":41.644,"Longitude":-88.12,"ViewsTotal":1047,"ViewsMonth":36,"SharedOn":"Jan 26, 2019","Overview":null,"Description":"Classic overhanging wall. Superb granite. Little-known, undeveloped area with multiple routes possible.","GettingThere":"Full-day hike from downtown. Approach via lawn, elevation gain 15'. Snakes, aggressive lawnmowers in warmer months. Potable water unavailable but McDonald's isn't far.","URL":"https://www.mountainproject.com/area/116484487/romeo-rock"}
{"AreaId":119008362,"ParentAreaId":114335250,"AreaName":"Skokie","Elevation":593.0,"ElevationUnits":"ft","Latitude":41.844,"Longitude":-87.653,"ViewsTotal":276,"ViewsMonth":22,"SharedOn":"Jun 8, 2020","Overview":null,"Description":"A suburb near Chicago.","GettingThere":"Just put Skokie in google maps.","URL":"https://www.mountainproject.com/area/119008362/skokie"}
{"AreaId":114583975,"ParentAreaId":114335250,"AreaName":"Steelworkers Park","Elevation":589.0,"ElevationUnits":"ft","Latitude":41.74,"Longitude":-87.531,"ViewsTotal":2865,"ViewsMonth":80,"SharedOn":"Jul 12, 2018","Overview":null,"Description":"Outdoor Climbing Park located in the former Steelworker's Site. Former building concrete walls have been outfitted with holds, bolts, and autobelays.Autobelays:Currently being developed - there are four autobelays that were padlocked at the time of visit, early July 2018.Leading:The two lead routes at the time of writing this have some pieces missing - there are two lines of bolts, but only a single bolt at the top and not a proper two-bolt anchor for cleaning gear at the time of posting. Can top out and rap off the autobelay support beams but that is not the intention. Can also leave a 'leaver biner' on the bolt and lower, or backclimb using jugs since these climbs are extremely easy.My advice for safely leading the lead climbs is suggestive only and should not be relied on for your safety, if you do not understand safe leading outdoors find an experienced climber, and see the resources available on-line and in book form. The park needs to install a second bolt at the top for cleaning. There are also no lead bolts on the routes using the volumes and roofs. Bouldering:There is also a bouldering traverse set to the left of the roped climbs.Property Access: Chicago Park District project with rules posted on wall.All climbs in the 5.2 - 5.7 range at time of posting July 2018","GettingThere":"Can park less than 100 ft from the wall. Access off 87th and Lake Shore drive.","URL":"https://www.mountainproject.com/area/114583975/steelworkers-park"}
{"AreaId":116243066,"ParentAreaId":114335250,"AreaName":"The Tar Boulder","Elevation":817.0,"ElevationUnits":"ft","Latitude":42.042,"Longitude":-88.145,"ViewsTotal":2030,"ViewsMonth":68,"SharedOn":"Jan 5, 2019","Overview":null,"Description":"Got the urge to get out on some real rock but you're stuck in the midwest? This single mystery boulder will help you quench that urge. Short but fun climbing.","GettingThere":"Park anywhere in the Mariano's/ Dunkin Donuts parking lot on Barrington Rd. Once parked, walk south on Barrington road for about 5 minutes and you will see the boulder just off the road on the right. There are two boulders in the field. It is the bigger of the two boulders.","URL":"https://www.mountainproject.com/area/116243066/the-tar-boulder"}
{"AreaId":119335613,"ParentAreaId":114335250,"AreaName":"Union Pacific Traverse","Elevation":601.0,"ElevationUnits":"ft","Latitude":41.889,"Longitude":-87.675,"ViewsTotal":394,"ViewsMonth":37,"SharedOn":"Aug 5, 2020","Overview":null,"Description":"The Union Pacific Traverse – the first major urban crag in Chicago – is a continuous 1.1 mile stretch of stone wall that runs west-east on Kinzie Ave, from Western Ave (Near West Side neighborhood) to North Armour St (West Loop neighborhood). The wall was built to support the Union Pacific train line, formerly known as the Chicago-Rock Island and Pacific Railroad, which was established in the 1850s. It’s unclear when the wall was constructed. Similarly, the composition of rock is unknown (research is underway).The wall is composed of several traverse “routes”. Streets heading north-south provide natural break points for each route along the Union Pacific Crag. Generally speaking, the rock quality is questionable, however with a bit of pulling loose rock away by hand, toothbrush maintenance, and cleaning summer weeds with a machete, stellar bouldering problems and quite stable rock can be revealed. In most sections the top of the wall is lined with metal posts; the approximate distance between each post is 10 ft. This makes it easy to estimate the length of each traverse as well as break each route down into 10-20’ sectors so that it is easier to keep track of progress and mark cruxes along your journey.The first known ascent of a route at this crag was on Wednesday, July 29 2020 by Brian T. Murphy. The route was a 255 ft long segment named Tell ‘em you’re with Mac.","GettingThere":"Accessible by bicycle, car, and train (Pink and Green lines).","URL":"https://www.mountainproject.com/area/119335613/union-pacific-traverse"}
{"AreaId":111741148,"ParentAreaId":114086601,"AreaName":"Braeside Chimney","Elevation":668.0,"ElevationUnits":"ft","Latitude":42.155,"Longitude":-87.773,"ViewsTotal":2307,"ViewsMonth":36,"SharedOn":"Mar 31, 2016","Overview":null,"Description":"A 50 foot 5.5 buildering route on the side of an old chimney. Do not climb during school hours. Route gets sun in the afternoon. There is no protection on this route or any way to lower off currently it's free solo up and free solo down.","GettingThere":"Pull into the parking lot of the school. You'll see the chimney.","URL":"https://www.mountainproject.com/area/111741148/braeside-chimney"}
{"AreaId":114073502,"ParentAreaId":114086601,"AreaName":"Buildering Bridges East Side","Elevation":691.0,"ElevationUnits":"ft","Latitude":41.978,"Longitude":-88.293,"ViewsTotal":1662,"ViewsMonth":41,"SharedOn":"Feb 7, 2018","Overview":null,"Description":"This small area is packed full of problems on both the East & West Side of the river.    -The railroad bridge have spots to boulder, sport climb, and top rope   - The Stearns road bridge has 8-12 Routes","GettingThere":"You can Park at the Jon J Duerr Forest Preserve and take the bicycle trail towards Elgin.   You can Park at Seba Park and take the bicycle trail towards St.Charles.   The quickest way would be to park on Hancock Ave, walk along Rt.31 until the bridge, go under the bridge and follow the train tracks.   There is a closer parking spot on the East Side, but it's still under construction and closed to the public.","URL":"https://www.mountainproject.com/area/114073502/buildering-bridges-east-side"}
{"AreaId":114073130,"ParentAreaId":114086601,"AreaName":"Buildering Bridges West Side","Elevation":691.0,"ElevationUnits":"ft","Latitude":41.978,"Longitude":-88.294,"ViewsTotal":3109,"ViewsMonth":76,"SharedOn":"Feb 7, 2018","Overview":null,"Description":"This small area is packed full of problems on both the East & West Side of the river.    -The railroad bridge have spots to boulder, sport climb, and top rope   - The Stearns road bridge has 8-12 Routes","GettingThere":"You can Park at the Jon J Duerr Forest Preserve and take the bicycle trail towards Elgin.   You can Park at Seba Park and take the bicycle trail towards St.Charles.   The quickest way would be to park on Hancock Ave, walk along Rt.31 until the bridge, go under the bridge and follow the train tracks.   There is a closer parking spot on the East Side, but it's still under construction and closed to the public.","URL":"https://www.mountainproject.com/area/114073130/buildering-bridges-west-side"}
{"AreaId":114565347,"ParentAreaId":114086601,"AreaName":"Canyon creek falls walls","Elevation":653.0,"ElevationUnits":"ft","Latitude":41.69,"Longitude":-88.002,"ViewsTotal":1823,"ViewsMonth":51,"SharedOn":"Jul 7, 2018","Overview":null,"Description":"These walls are located in the waterfall glen forest preserve. It does not get much sun so it stays wet for a long time after a rain. The best looking wall is right next to the water fall and is solid rock, which is pretty neat. the others have more moss/lichen on them. So far every time I have visited this location it was too wet to climb, hence why there are no problems set yet. I am thinking that they will be better in the fall. If you go and are able to climb it be sure to add the problem to this page. Also should mention its a bit of a highball.","GettingThere":"The best way to get to this spot is to drive to these coordinates (41.690246, -88.000947) and park on the side of the road in the gravel before the gate. Do not go past the gate with your car. There is a trail that leads around the gate which gets you into the preserve. Once you're past the gate there is another trail between the railroad tracks and the gate that will lead you to the creek's cascades, turn left on the trail and head down stream until you see the wall/waterfall","URL":"https://www.mountainproject.com/area/114565347/canyon-creek-falls-walls"}
{"AreaId":113347091,"ParentAreaId":114086601,"AreaName":"Logan Square Boulders","Elevation":594.0,"ElevationUnits":"ft","Latitude":41.922,"Longitude":-87.696,"ViewsTotal":5982,"ViewsMonth":125,"SharedOn":"Jul 18, 2017","Overview":null,"Description":"For the truly desperate Chicago climber, a few boulders of surprising amounts of fun can be had right off the California stop on the blue line. The rock (possibly basalt?) is a little chossy but will probably clean up. There are only two boulders that are really climbable. Don't expect anything and you'll be pleasantly surprised.","GettingThere":"Take the blue line to the California stop. Walk towards Milwaukee and turn right. The boulders are in between the two apartment buildings on the left.","URL":"https://www.mountainproject.com/area/113347091/logan-square-boulders"}
{"AreaId":114498691,"ParentAreaId":114086601,"AreaName":"Nature Valley (A.K.A. Downtown Lemont)","Elevation":606.0,"ElevationUnits":"ft","Latitude":41.673,"Longitude":-88.004,"ViewsTotal":1550,"ViewsMonth":42,"SharedOn":"Jun 18, 2018","Overview":null,"Description":"Have you ever bitten into a nature valley granola bar and have a ton of crumbs fall to the ground, well that is what it is like to climb this wall. The wall is located in the parking lot of a business named Englewood construction. It gets lots of sun and there are lots of bugs. Its super crumbly so you will have to check each hold before putting all your weight on it. The wall is nice and long and great for traversing, but not so great for toping out. If you decide to climb here there is plenty of room for new problems and we hope that people put more up. After you finish climbing there be sure to move all the rocks that have fallen off the wall out of the parking lot and up against the base of the wall; we would like to keep it clean so we don't get banned from there.","GettingThere":"The wall is located in downtown Lemont in the parking lot of englewood construction, which is right off of main st. You can drive right up to it.","URL":"https://www.mountainproject.com/area/114498691/nature-valley-aka-downtown-lemont"}
{"AreaId":116579685,"ParentAreaId":114086601,"AreaName":"North Park University","Elevation":594.0,"ElevationUnits":"ft","Latitude":41.975,"Longitude":-87.711,"ViewsTotal":1233,"ViewsMonth":44,"SharedOn":"Mar 4, 2019","Overview":null,"Description":"Small private college with some climbing opportunities","GettingThere":"Located in Albany Park, last stop off the Brown Line.","URL":"https://www.mountainproject.com/area/116579685/north-park-university"}
{"AreaId":114564422,"ParentAreaId":114086601,"AreaName":"The Pillers","Elevation":722.0,"ElevationUnits":"ft","Latitude":41.832,"Longitude":-88.041,"ViewsTotal":994,"ViewsMonth":28,"SharedOn":"Jul 7, 2018","Overview":null,"Description":"It beats plastic,its outside and it’s in the shade.","GettingThere":"Just off the road","URL":"https://www.mountainproject.com/area/114564422/the-pillers"}
{"AreaId":120701591,"ParentAreaId":114086601,"AreaName":"The Point Underpass Bridge","Elevation":589.0,"ElevationUnits":"ft","Latitude":41.796,"Longitude":-87.579,"ViewsTotal":50,"ViewsMonth":40,"SharedOn":"May 13, 2021","Overview":null,"Description":"Decent buildering. Watch out for spiders. Beats nothing if you're in the Hyde Park area.","GettingThere":"The bridge around the underpass below LSD at 55th St.","URL":"https://www.mountainproject.com/area/120701591/the-point-underpass-bridge"}
{"AreaId":112825384,"ParentAreaId":114086601,"AreaName":"Red Oak Cave","Elevation":651.0,"ElevationUnits":"ft","Latitude":41.818,"Longitude":-88.323,"ViewsTotal":3099,"ViewsMonth":61,"SharedOn":"Apr 15, 2017","Overview":null,"Description":"In the suburbs? Desperate to climb some rock outside? It's not much, but this cave offers a little bit of fun. The ground stays fairly dry after rain, just make sure the fox river isn't flooded/high. There is a fair amount of choss, but it's easily identifiable and avoidable.    The cave has a main room that is approximately 7 feet wide at the largest part and 10 feet long. There is a small crawl that loops from the left side to the back, and a tiny room just off the left of the crawl. Not really caving, but this is as good as it gets this close to Chicago.","GettingThere":"Park near the Red Oak nature center. If you are facing the building, start walking to your left. It's around a five minute walk from the nature center, just past the private property crossing.    Bring a headlamp or some source of light. A lot of light is let in during the day, but it may be difficult to find holds without a light.","URL":"https://www.mountainproject.com/area/112825384/red-oak-cave"}
{"AreaId":118994471,"ParentAreaId":114086601,"AreaName":"Resist","Elevation":596.0,"ElevationUnits":"ft","Latitude":41.954,"Longitude":-87.724,"ViewsTotal":1236,"ViewsMonth":97,"SharedOn":"Jun 6, 2020","Overview":null,"Description":"Rock is dusty but solid.  Some morning and midday sun, afternoon shade.  The \"main\" wall is about 10 feet tall and 20 feet wide.","GettingThere":"Northwest corner of N Avers and W Irving Park, just north of Independence Park. It's not too far from the Irving Park blue line stop.","URL":"https://www.mountainproject.com/area/118994471/resist"}
{"AreaId":118953749,"ParentAreaId":114086601,"AreaName":"School House Rock","Elevation":593.0,"ElevationUnits":"ft","Latitude":41.958,"Longitude":-87.702,"ViewsTotal":457,"ViewsMonth":35,"SharedOn":"May 30, 2020","Overview":null,"Description":"Bateman Elementary School Sign","GettingThere":"Walk down the sidewalk.","URL":"https://www.mountainproject.com/area/118953749/school-house-rock"}
{"AreaId":113585843,"ParentAreaId":114086601,"AreaName":"Underpass buildering","Elevation":788.0,"ElevationUnits":"ft","Latitude":42.357,"Longitude":-88.048,"ViewsTotal":659,"ViewsMonth":14,"SharedOn":"Sep 14, 2017","Overview":null,"Description":"The underpass that was recently finished has some serious potential for bouldering. Both on the carved out murals and that fake stone brick texture of the wall itself.","GettingThere":"A bike path and a side walk on either side of the road allow easy access, the Metra station just near by could be used for parking, there are daily fees though.","URL":"https://www.mountainproject.com/area/113585843/underpass-buildering"}
{"AreaId":114335381,"ParentAreaId":114335319,"AreaName":"Yoda Lowball Boulder","Elevation":590.0,"ElevationUnits":"ft","Latitude":41.875,"Longitude":-87.672,"ViewsTotal":3312,"ViewsMonth":87,"SharedOn":"May 5, 2018","Overview":null,"Description":"There is real granite in Chicago! It comes in the compact size of a lowball boulder. So for the difficulty of each problem to be true, you have to follow the \"contrived\" rules for each line. It's so small that otherwise you can turn everything into a v1-2. Also, you'd be missing out in some really fun movement! So bare with the rules to each line. All they are is maybe omit using one side of the boulder, or only use a hold to start on.  Otherwise, when you can't get away from the city, here is a real boulder to play on!","GettingThere":"It's the obvious boulder in the middle of the small park.","URL":"https://www.mountainproject.com/area/114335381/yoda-lowball-boulder"}
{"AreaId":116693030,"ParentAreaId":107286103,"AreaName":"Cove Hollow Trail South","Elevation":642.0,"ElevationUnits":"ft","Latitude":37.627,"Longitude":-89.301,"ViewsTotal":718,"ViewsMonth":27,"SharedOn":"Apr 4, 2019","Overview":null,"Description":"Secluded, scenic area along the western shore of Cedar Lake accessed from Boat dock road trail head.  This is the southern section of the Cove Hollow Trail #385.  After roughly a mile, the broken, east facing cliff system continues all the way to the Cove Hollow area.  Many good boulder problems ranging in style and difficulty are to be found, but will require some work on your part.  Bring a brush and an eye for lines.  This is a beautiful place, and not the trash covered, graffitied amphitheatre of the northern section.  Let’s make sure it stays that way by practicing strong LNT ethics.  Please stay on established trails and limit climbing related impacts.","GettingThere":"From route 127, turn East on to Boat Dock rd. Directly adjacent to the turnoff for the town of Pomona. Park at a trail head marked with a USFS sign. If you end up at the boat ramp simply turn around. This is the southern access of the CHT. Hike/bike North on this trail for roughly 1 mike before encountering the cliff line.  Remain on CHT to continue at the base of the cliff by staying right at the wolf den loop sign.  Going up at the Wolf Den trail will take you on a loop skirting the top of the cliff.","URL":"https://www.mountainproject.com/area/116693030/cove-hollow-trail-south"}
{"AreaId":107286281,"ParentAreaId":107286103,"AreaName":"The Dugout","Elevation":null,"ElevationUnits":null,"Latitude":37.64,"Longitude":-89.3,"ViewsTotal":2943,"ViewsMonth":25,"SharedOn":"Sep 13, 2011","Overview":null,"Description":"These climbs are capped by a large roof, making them better candidates for wet weather.  They also tend to be pretty sandy.  Unfortunately, no names or FA info is known on these routes.","GettingThere":"Follow the trail past the amphitheater, across the creek, and head left along the cliff line.  The giant roof over these climbs is hard to miss.","URL":"https://www.mountainproject.com/area/107286281/the-dugout"}
{"AreaId":107286183,"ParentAreaId":107286103,"AreaName":"Main Amphitheater","Elevation":null,"ElevationUnits":null,"Latitude":37.64,"Longitude":-89.3,"ViewsTotal":4964,"ViewsMonth":42,"SharedOn":"Sep 13, 2011","Overview":null,"Description":"This is the large amphitheater sporting a beautiful waterfall, accentuated by broken bottles, trash and graffiti around the fire pit under the overhang... the price of being close to town and in Southern Illinois.    The clean overhanging wall left of the waterfall is undercut by a large chossy roof, which is why all the climbs share a start on the left side of the wall.  By working these routes, if nothing else, you will absolutely dial the shared boulder problem that serves as a start to these routes.    Be sure to watch out for the large icicles that form above the shared start  during the winter.  They have been known to break free and bludgeon the heads of unwary belayers.","GettingThere":"Along the main trail, it's the large, obvious amphitheater with a waterfall.","URL":"https://www.mountainproject.com/area/107286183/main-amphitheater"}
{"AreaId":107286111,"ParentAreaId":107286103,"AreaName":"Moon Rock","Elevation":null,"ElevationUnits":null,"Latitude":37.64,"Longitude":-89.3,"ViewsTotal":3139,"ViewsMonth":26,"SharedOn":"Sep 13, 2011","Overview":null,"Description":"This is the large freestanding boulder next to the main amphitheater.  As of now it holds about five routes.","GettingThere":"Stand in front of the slimy arches dihedral.  Turn around.","URL":"https://www.mountainproject.com/area/107286111/moon-rock"}
{"AreaId":107286328,"ParentAreaId":107286103,"AreaName":"Shout Area","Elevation":null,"ElevationUnits":null,"Latitude":37.64,"Longitude":-89.3,"ViewsTotal":1937,"ViewsMonth":16,"SharedOn":"Sep 13, 2011","Overview":null,"Description":"This area is home to a few old Thurmond routes and a new fun overhanging sport route that is still waiting for a name (Phillip's Overhang).","GettingThere":"From the Dugout, head left along the cliffline for about 50 yards.  Shout is the obvious overhanging arete.","URL":"https://www.mountainproject.com/area/107286328/shout-area"}
{"AreaId":107286267,"ParentAreaId":107286103,"AreaName":"Sunny Side","Elevation":null,"ElevationUnits":null,"Latitude":37.64,"Longitude":-89.3,"ViewsTotal":564,"ViewsMonth":5,"SharedOn":"Sep 13, 2011","Overview":null,"Description":"There is currently only one route on this wall, bolted by Chris Lesh last year.  It has not yet been completed, so please do not climb it.  I'll update the site when it is open.  There is potential for a few more bolted lines.","GettingThere":"When descending the trail from the top of the cliff on the way in, follow the base of the cliff back the way you came for a short distance.  This is the small cliff with a cave undercutting it at about head height.  This cave apparently provides inspiration to many aspiring graffiti artists.  It is still seeing new installations regularly.","URL":"https://www.mountainproject.com/area/107286267/sunny-side"}
{"AreaId":109374035,"ParentAreaId":106226290,"AreaName":"Ghost Dance Canyon","Elevation":499.0,"ElevationUnits":"ft","Latitude":37.381,"Longitude":-88.673,"ViewsTotal":9032,"ViewsMonth":108,"SharedOn":"Aug 20, 2014","Overview":null,"Description":"Ghost Dance Canyon is a small canyon with boulder strewn hillsides and a beautiful meandering creek. Everywhere you look there is something good to climb. Ghost Dance has seen the feats of John Gill and holds many decades of climbing. Unfortunately the climbs here have been poorly documented. Feel free to add boulder problems, but you must include PHOTOS!A strong case could be made that this is the most beautiful bouldering area in Southern Illinois. A So much potential here people, get out and climb!","GettingThere":"The following information is from Jim Detterline's 1982 guidebook \"A Climber's Guide To The Mid-South, Selected Routes\".The canyon, just south of the swimming pool, offers several possibilities for solid routes as high as 60'. One of (John) Gill's hardest boulder problems, the PERSIAN WALL, is located here. Park behind the swimming pool and follow the Ghost Dance Canyon trail for 1/2 mile into the canyon.","URL":"https://www.mountainproject.com/area/109374035/ghost-dance-canyon"}
{"AreaId":118898067,"ParentAreaId":106226290,"AreaName":"Picnic Area Boulderfield","Elevation":458.0,"ElevationUnits":"ft","Latitude":37.386,"Longitude":-88.67,"ViewsTotal":4701,"ViewsMonth":356,"SharedOn":"May 19, 2020","Overview":null,"Description":"This is the boulder field near the swimming pool. Lots of options here. Click on specific boulders for more information.","GettingThere":"Refer to map","URL":"https://www.mountainproject.com/area/118898067/picnic-area-boulderfield"}
{"AreaId":120280781,"ParentAreaId":109374035,"AreaName":"Lepidoptera Lines","Elevation":477.0,"ElevationUnits":"ft","Latitude":37.381,"Longitude":-88.673,"ViewsTotal":151,"ViewsMonth":35,"SharedOn":"Feb 9, 2021","Overview":null,"Description":"Lone boulder with a crack facing away from the cliff line. High up on the east side of the canyon.","GettingThere":"Follow the trail until you get to the USS Enterprise and hike up to the cliff line. Just downhill from the back exit of the lost hallway.","URL":"https://www.mountainproject.com/area/120280781/lepidoptera-lines"}
{"AreaId":120182055,"ParentAreaId":109374035,"AreaName":"Lost Hallway","Elevation":477.0,"ElevationUnits":"ft","Latitude":37.381,"Longitude":-88.673,"ViewsTotal":366,"ViewsMonth":69,"SharedOn":"Jan 12, 2021","Overview":null,"Description":"This hallway feature holds a lot of potential for new problems, it is hidden up in the far cliff line by a number of maze-like boulders.","GettingThere":"Located on the east side of the cliff line high above the water right before the cliff line loses view of the river.","URL":"https://www.mountainproject.com/area/120182055/lost-hallway"}
{"AreaId":120182666,"ParentAreaId":109374035,"AreaName":"The Maze","Elevation":477.0,"ElevationUnits":"ft","Latitude":37.381,"Longitude":-88.673,"ViewsTotal":361,"ViewsMonth":67,"SharedOn":"Jan 12, 2021","Overview":null,"Description":"This boulder field up the hill from the river is full of some really amazing and sticky large grain sandstone. There are plenty of tall climbs to be done for those who enjoy them on both slab and overhung.","GettingThere":"Follow the trail past the bridge into the canyon and over the first crossing of the river. When you get to the large and obvious roof, start moving down the trail closer to the river maybe another 100 yards, then cross the river again into the boulder field on the west side of the river. This is the maze, it's easy to get turned around walking around the boulders for the first time as there is no trail, but the large boulders become quite memorable.","URL":"https://www.mountainproject.com/area/120182666/the-maze"}
{"AreaId":120179946,"ParentAreaId":109374035,"AreaName":"Metro Wall","Elevation":477.0,"ElevationUnits":"ft","Latitude":37.381,"Longitude":-88.673,"ViewsTotal":578,"ViewsMonth":107,"SharedOn":"Jan 11, 2021","Overview":null,"Description":"Slabby wall on the west side of the creek with climbs up to around 18\".","GettingThere":"Follow the creek past all of the largest immediate boulders and hike up to the west side of the canyon. This wall is marked with 3 prominent cracks, one in the left dihedral, and two to the left of it.","URL":"https://www.mountainproject.com/area/120179946/metro-wall"}
{"AreaId":109374617,"ParentAreaId":109374035,"AreaName":"New Year","Elevation":null,"ElevationUnits":null,"Latitude":37.381,"Longitude":-88.673,"ViewsTotal":834,"ViewsMonth":10,"SharedOn":"Aug 20, 2014","Overview":null,"Description":"This is a boulder containing a few fun moderates","GettingThere":"Walk Back into the Canyon. Stay on the left side of the trail, near the tall(60' or so) rock face. When you can see the powerlines that were recently added, you should be close.","URL":"https://www.mountainproject.com/area/109374617/new-year"}
{"AreaId":109374333,"ParentAreaId":109374035,"AreaName":"Persian Wall","Elevation":null,"ElevationUnits":null,"Latitude":37.381,"Longitude":-88.673,"ViewsTotal":1592,"ViewsMonth":19,"SharedOn":"Aug 20, 2014","Overview":null,"Description":"Climb, if you can, straight up the wall, through the notch, and over the overhang at it's widest part 45' to the top. This is certainly one of John Gill's most incredible mid-south routes!    John named the route after fellow climber Mohammed Shams who was from Iran.","GettingThere":"As the trail is mostly on the west side of the stream, you must cross to the east side to find the Persian Wall. Follow the cliffs which turn back into the woods almost perpendicular instead of parellel to the spring. They are marked at their corner by a huge overhang. In the middle of the wall you will see a V-shaped notch beneath an overhang resting on a smooth undercut bed of rock. this is the Persian Wall.","URL":"https://www.mountainproject.com/area/109374333/persian-wall"}
{"AreaId":109374632,"ParentAreaId":109374035,"AreaName":"Pluto's Cave","Elevation":477.0,"ElevationUnits":"ft","Latitude":37.381,"Longitude":-88.673,"ViewsTotal":929,"ViewsMonth":11,"SharedOn":"Aug 20, 2014","Overview":null,"Description":"Small cave with a fun moderate, probably needs some cleaning","GettingThere":"Walking into the canyon, follow the trail left when it splits over the creek. Walk a few hundred more yards along the trail and eventually you will see a cave a little bit off the trail to your left.","URL":"https://www.mountainproject.com/area/109374632/plutos-cave"}
{"AreaId":120254287,"ParentAreaId":109374035,"AreaName":"Railroad Boulder","Elevation":477.0,"ElevationUnits":"ft","Latitude":37.381,"Longitude":-88.673,"ViewsTotal":563,"ViewsMonth":119,"SharedOn":"Feb 1, 2021","Overview":null,"Description":"Beautiful irony crimpy face with sun exposure making it a great warm up wall on a cold day. There are 6 problems on it, one right after the other.","GettingThere":"Large boulder directly downhill from the metro wall.","URL":"https://www.mountainproject.com/area/120254287/railroad-boulder"}
{"AreaId":120223577,"ParentAreaId":109374035,"AreaName":"Trail Cave","Elevation":477.0,"ElevationUnits":"ft","Latitude":37.381,"Longitude":-88.673,"ViewsTotal":138,"ViewsMonth":27,"SharedOn":"Jan 22, 2021","Overview":null,"Description":"Large cave with some problems on surrounding boulders and on the cliffline around the cave.","GettingThere":"Stay right on the trail and don't cross the river. On the right side of the trail.","URL":"https://www.mountainproject.com/area/120223577/trail-cave"}
{"AreaId":120254629,"ParentAreaId":109374035,"AreaName":"USS Enterprise","Elevation":477.0,"ElevationUnits":"ft","Latitude":37.381,"Longitude":-88.673,"ViewsTotal":692,"ViewsMonth":151,"SharedOn":"Feb 1, 2021","Overview":null,"Description":"Best slab climbing east of the creek!","GettingThere":"Hike down the trail until you find the cave on the east side of the creek and keep hiking another 50 meters until you find the boulder.","URL":"https://www.mountainproject.com/area/120254629/uss-enterprise"}
{"AreaId":118898103,"ParentAreaId":118898067,"AreaName":"Rebuttal Boulder","Elevation":470.0,"ElevationUnits":"ft","Latitude":37.385,"Longitude":-88.669,"ViewsTotal":924,"ViewsMonth":70,"SharedOn":"May 19, 2020","Overview":null,"Description":"A beautifully featured boulder with slopey top outs","GettingThere":"The first boulder you drive by as you reach the Picnic Area Boulderfield","URL":"https://www.mountainproject.com/area/118898103/rebuttal-boulder"}
{"AreaId":116143951,"ParentAreaId":118898067,"AreaName":"Roadside Boulder","Elevation":461.0,"ElevationUnits":"ft","Latitude":37.385,"Longitude":-88.67,"ViewsTotal":1958,"ViewsMonth":63,"SharedOn":"Nov 27, 2018","Overview":null,"Description":"Overhanging Wall Directly Beside the Road. Has the Word “Miller” pained on a the rock.","GettingThere":"This wall is across the Road from the Pool. 50 years from the parking lot","URL":"https://www.mountainproject.com/area/116143951/roadside-boulder"}
{"AreaId":118984766,"ParentAreaId":118898067,"AreaName":"Shipwreck Boulder","Elevation":441.0,"ElevationUnits":"ft","Latitude":37.385,"Longitude":-88.67,"ViewsTotal":282,"ViewsMonth":22,"SharedOn":"Jun 4, 2020","Overview":null,"Description":"A large boulder, 20 ish feet from the Roadside Boulder. Mostly lowball stuff, but a Classic John Gill line and a few other lines are present here.","GettingThere":"Refer to photo and map.","URL":"https://www.mountainproject.com/area/118984766/shipwreck-boulder"}
{"AreaId":118898129,"ParentAreaId":118898067,"AreaName":"Warm Up Boulder","Elevation":462.0,"ElevationUnits":"ft","Latitude":37.385,"Longitude":-88.67,"ViewsTotal":271,"ViewsMonth":20,"SharedOn":"May 19, 2020","Overview":null,"Description":"A bunch of fun variation options available. A great boulder to start warming up on.","GettingThere":"Refer to photo/map","URL":"https://www.mountainproject.com/area/118898129/warm-up-boulder"}
{"AreaId":118898163,"ParentAreaId":118898067,"AreaName":"Gill Boulder","Elevation":468.0,"ElevationUnits":"ft","Latitude":37.385,"Longitude":-88.67,"ViewsTotal":323,"ViewsMonth":24,"SharedOn":"May 19, 2020","Overview":null,"Description":"A very uniquely featured boulder. Holds a classic traverse, but, some hard options still exist.","GettingThere":"Refer to photo/map","URL":"https://www.mountainproject.com/area/118898163/gill-boulder"}
{"AreaId":109374038,"ParentAreaId":118898067,"AreaName":"K Boulder","Elevation":455.0,"ElevationUnits":"ft","Latitude":37.385,"Longitude":-88.67,"ViewsTotal":3790,"ViewsMonth":46,"SharedOn":"Aug 20, 2014","Overview":null,"Description":"","GettingThere":"","URL":"https://www.mountainproject.com/area/109374038/k-boulder"}
{"AreaId":118898175,"ParentAreaId":118898067,"AreaName":"Perschbacher Boulder","Elevation":457.0,"ElevationUnits":"ft","Latitude":37.386,"Longitude":-88.67,"ViewsTotal":289,"ViewsMonth":22,"SharedOn":"May 19, 2020","Overview":null,"Description":"One of the most beautiful boulders in the park. Tall, proud, go check it out.","GettingThere":"Refer to photo/map","URL":"https://www.mountainproject.com/area/118898175/perschbacher-boulder"}
{"AreaId":112875190,"ParentAreaId":112875162,"AreaName":"Bouldering","Elevation":817.0,"ElevationUnits":"ft","Latitude":37.515,"Longitude":-89.042,"ViewsTotal":1157,"ViewsMonth":23,"SharedOn":"May 4, 2017","Overview":null,"Description":"Various boulders possibilities at Draper's Bluff","GettingThere":"I 57 South from Marion, IL to Lick Creek Exit. Go left for a few miles (it's on the right)","URL":"https://www.mountainproject.com/area/112875190/bouldering"}
{"AreaId":112875166,"ParentAreaId":112875162,"AreaName":"The Rubik's Cube","Elevation":826.0,"ElevationUnits":"ft","Latitude":37.515,"Longitude":-89.042,"ViewsTotal":2764,"ViewsMonth":55,"SharedOn":"May 4, 2017","Overview":null,"Description":"From Vertical Heartland, \"The Rubik's cube is the blockish formation making the upper section of the wall left of Bookshelf Blues. The often-photographed second pitch of Kittens is located mid-cube","GettingThere":"Left of Bookshelf Blues","URL":"https://www.mountainproject.com/area/112875166/the-rubiks-cube"}
{"AreaId":112875174,"ParentAreaId":112875162,"AreaName":"The Sociable Wall","Elevation":821.0,"ElevationUnits":"ft","Latitude":37.515,"Longitude":-89.042,"ViewsTotal":1890,"ViewsMonth":38,"SharedOn":"May 4, 2017","Overview":null,"Description":"As written in Vertical Heartland, \" it's the 40-foot high wall beneath a grassy ledge system (AKA The Upper Meadow) with trees. At the left end of the wall, a 4th class chimney up and right of a water runnel leads to the Upper Meadow for setting TR's. The oft-traveled routes on this wall are part of an on-going effort to provide more beginner-to moderate-level climbing opportunities for clients of Vertical Heartland Climbing School. By the time you read this, there may be another route or two in between Patriot and Leprechaun.","GettingThere":"The wall beneath the Upper Meadow","URL":"https://www.mountainproject.com/area/112875174/the-sociable-wall"}
{"AreaId":112875180,"ParentAreaId":112875162,"AreaName":"The Woodland Ledge","Elevation":819.0,"ElevationUnits":"ft","Latitude":37.515,"Longitude":-89.043,"ViewsTotal":3336,"ViewsMonth":66,"SharedOn":"May 4, 2017","Overview":null,"Description":"From Vertical Heartland, \"The Woodland Ledge is topped by an overhang and is roughly 100 yards long.\"","GettingThere":"To the left of Monarch","URL":"https://www.mountainproject.com/area/112875180/the-woodland-ledge"}
{"AreaId":112862845,"ParentAreaId":110019237,"AreaName":"Bouldering","Elevation":579.0,"ElevationUnits":"ft","Latitude":37.534,"Longitude":-88.983,"ViewsTotal":5274,"ViewsMonth":104,"SharedOn":"Apr 30, 2017","Overview":null,"Description":"The park has several nice boulders. Click on each individual boulder to see more.","GettingThere":"Refer to individual area directions","URL":"https://www.mountainproject.com/area/112862845/bouldering"}
{"AreaId":110019406,"ParentAreaId":110019237,"AreaName":"Main Wall","Elevation":null,"ElevationUnits":null,"Latitude":37.544,"Longitude":-88.98,"ViewsTotal":13621,"ViewsMonth":175,"SharedOn":"Feb 1, 2015","Overview":null,"Description":"The Main Wall is home to many quality top-rope climbs and a few natural leads.","GettingThere":"From the parking area, cross the stream with the artificial stepping stones, and follow the mowed grass trail to the main, west-facing bluff ahead and to the right. A sign in front of the bluff marks it as the only cliff in the park that is presently open for climbing.","URL":"https://www.mountainproject.com/area/110019406/main-wall"}
{"AreaId":120026950,"ParentAreaId":110019237,"AreaName":"Waterfall Trail","Elevation":574.0,"ElevationUnits":"ft","Latitude":37.534,"Longitude":-88.983,"ViewsTotal":213,"ViewsMonth":32,"SharedOn":"Dec 5, 2020","Overview":null,"Description":"Climbing access from the Waterfall Trail.","GettingThere":"Park in the Deer Ridge Campground lot.","URL":"https://www.mountainproject.com/area/120026950/waterfall-trail"}
{"AreaId":110019379,"ParentAreaId":112862845,"AreaName":"45 Degree Wall","Elevation":null,"ElevationUnits":null,"Latitude":37.534,"Longitude":-88.983,"ViewsTotal":1073,"ViewsMonth":14,"SharedOn":"Feb 1, 2015","Overview":null,"Description":"A small concentration of boulder problems offering moderates and one V6","GettingThere":"This boulder problem can be found by searching around the boulders near the route Grace On Fire.","URL":"https://www.mountainproject.com/area/110019379/45-degree-wall"}
{"AreaId":110019356,"ParentAreaId":112862845,"AreaName":"Assassin Wall","Elevation":null,"ElevationUnits":null,"Latitude":37.534,"Longitude":-88.983,"ViewsTotal":2996,"ViewsMonth":39,"SharedOn":"Feb 1, 2015","Overview":null,"Description":"Cool boulder boasting some hard lines. Come prepared to give them some TLC before bouldering.","GettingThere":"From the parking area, take the stepping stones across the creek Follow the grassy trail straight and then take the trail to the far right and you will see a sign for Rebman Trail. Continue walking straight and the cliff line will pick up on your left for about 100 yards. The first problem you come to is Desperado.","URL":"https://www.mountainproject.com/area/110019356/assassin-wall"}
{"AreaId":110019388,"ParentAreaId":112862845,"AreaName":"The Hole","Elevation":null,"ElevationUnits":null,"Latitude":37.534,"Longitude":-88.983,"ViewsTotal":972,"ViewsMonth":12,"SharedOn":"Feb 1, 2015","Overview":null,"Description":"The next set of boulders down from the 45 Degree Wall","GettingThere":"Refer to Sandstone Warrior","URL":"https://www.mountainproject.com/area/110019388/the-hole"}
{"AreaId":106612641,"ParentAreaId":106612569,"AreaName":"Shelter 1 Bluff","Elevation":502.0,"ElevationUnits":"ft","Latitude":37.626,"Longitude":-89.201,"ViewsTotal":55248,"ViewsMonth":392,"SharedOn":"Nov 27, 2009","Overview":null,"Description":"Extremely featured great quality sandstone. A truly unique climbing experience. This is the home of progressive climbing in Illinois. Come climb these historic routes and share in these classic test pieces.","GettingThere":null,"URL":"https://www.mountainproject.com/area/106612641/shelter-1-bluff"}
{"AreaId":108562355,"ParentAreaId":106612569,"AreaName":"Devils Standtable Area","Elevation":541.0,"ElevationUnits":"ft","Latitude":37.599,"Longitude":-89.193,"ViewsTotal":30626,"ViewsMonth":337,"SharedOn":"Jan 6, 2014","Overview":null,"Description":"The Devils Standtable Area is the main bouldering area in the park. Many boulder problems have been put up and this page will continually be updated with more and more information.     To help make this area easier to navigate via mountain project, the specific spots will be alphabetically grouped in the order you would walk to by coming up the main trail. The main trail from the parking lot leads to the Gill Roof first, and from there every other area continues on to the right.     Great sandstone bouldering as well as some traditional lead climbing opportunities are available. Perfect place for a day trip  since it is so close to Carbondale. Camping is available at the Giant City Park Campgrounds.","GettingThere":null,"URL":"https://www.mountainproject.com/area/108562355/devils-standtable-area"}
{"AreaId":114152883,"ParentAreaId":106612569,"AreaName":"Park Bouldering","Elevation":557.0,"ElevationUnits":"ft","Latitude":37.599,"Longitude":-89.193,"ViewsTotal":31708,"ViewsMonth":793,"SharedOn":"Mar 11, 2018","Overview":null,"Description":"Giant City is full of many great boulder problems. Be sure to check out the classics!","GettingThere":"Refer to specific areas for further information.","URL":"https://www.mountainproject.com/area/114152883/park-bouldering"}
{"AreaId":114152517,"ParentAreaId":108562355,"AreaName":"Gill Roof Area","Elevation":636.0,"ElevationUnits":"ft","Latitude":37.601,"Longitude":-89.193,"ViewsTotal":8646,"ViewsMonth":216,"SharedOn":"Mar 11, 2018","Overview":null,"Description":"This is the first area the parking lot trail leads you to. Follow the wooden framed, graveled trail to the cliff line and begin route finding. Refer to specific routes for location and further details.","GettingThere":"From the parking area follow the graveled trail.","URL":"https://www.mountainproject.com/area/114152517/gill-roof-area"}
{"AreaId":116567470,"ParentAreaId":108562355,"AreaName":"The Ampitheater","Elevation":634.0,"ElevationUnits":"ft","Latitude":37.6,"Longitude":-89.192,"ViewsTotal":5149,"ViewsMonth":182,"SharedOn":"Feb 27, 2019","Overview":null,"Description":"Similar to features commonly seen in the Red River Gorge. This is the massive, overhung amphitheater that is left of the Devils Standtable. The few routes that are here are very unique and offer a different feel to Giant City State Park Climbing.","GettingThere":"Hike up the main trail from the parking lot and continue to the right one you reach the cliffline. The trail continues along the bluff, then goes downhill to the amphitheater.","URL":"https://www.mountainproject.com/area/116567470/the-ampitheater"}
{"AreaId":109191325,"ParentAreaId":108562355,"AreaName":"Devils Stand Table","Elevation":628.0,"ElevationUnits":"ft","Latitude":37.6,"Longitude":-89.191,"ViewsTotal":3468,"ViewsMonth":41,"SharedOn":"Jul 6, 2014","Overview":null,"Description":"This is the actual stand table itself. The tower does not hold many routes, but what it does hold is fun to climb. There are no fixed anchors so bring a static line to tie off to trees on top of the bluff.","GettingThere":"From the parking area, hike to the bluff line where the Gill Roof is located. Then turn right and hike around the corner, past a natural amphitheater, and it will lead directly to the stand table.","URL":"https://www.mountainproject.com/area/109191325/devils-stand-table"}
{"AreaId":114151233,"ParentAreaId":114152883,"AreaName":"Devils Standtable","Elevation":533.0,"ElevationUnits":"ft","Latitude":37.599,"Longitude":-89.193,"ViewsTotal":23097,"ViewsMonth":577,"SharedOn":"Mar 11, 2018","Overview":null,"Description":"Dozens of boulder problems are within the park.","GettingThere":"Click on specific areas for more information","URL":"https://www.mountainproject.com/area/114151233/devils-standtable"}
{"AreaId":114152978,"ParentAreaId":114152883,"AreaName":"Shelter 1","Elevation":491.0,"ElevationUnits":"ft","Latitude":37.626,"Longitude":-89.201,"ViewsTotal":1453,"ViewsMonth":36,"SharedOn":"Mar 11, 2018","Overview":null,"Description":"A few good problems here. Make sure to check out the classic Return To Forever traverse.","GettingThere":"Refer to map.","URL":"https://www.mountainproject.com/area/114152978/shelter-1"}
{"AreaId":110301384,"ParentAreaId":114152883,"AreaName":"The Orchards","Elevation":807.0,"ElevationUnits":"ft","Latitude":37.569,"Longitude":-89.191,"ViewsTotal":6073,"ViewsMonth":80,"SharedOn":"Apr 7, 2015","Overview":null,"Description":"\"The old but new bouldering area near Giant City, located in a small, obscure section of Shawnee National Forest\"    This is a cool area with great boulder problems.","GettingThere":"(From the Standtable Area in Giant City)    1. Turn South on Albart Rd. from Stonefort Rd/Giant City Lodge Rd.    2. Drive 0.4 miles until the road \"T's\".   3. Turn left on Giant City Park Rd. and follow for EXACTLY 2.4 miles.   4. Pull off on right side of road.    There will be a faint clearing/pull-off (overgrown in the summer)    1. From the pull-off, hike straight down hurl, angling slightly right if anything for approx. 5 minutes.   2. There will be a small creek/drainage that you will be following that eventually leads to the top of \"cliff\".   3. From there follow the top of cliff right, for a few minutes (walking on exposed stone).    4. You should eventually see a rock corn, marking the way down and left into the canyon (or just get down whenever you can).    5. From there, walk the rock back and left until you see the bouldering cave.     Probably a little epic finding your way during the summer. It should take 10 minutes, top, if done correctly. Can't really describe any better.....","URL":"https://www.mountainproject.com/area/110301384/the-orchards"}
{"AreaId":108562416,"ParentAreaId":114151233,"AreaName":"Gill Roof","Elevation":639.0,"ElevationUnits":"ft","Latitude":37.6,"Longitude":-89.193,"ViewsTotal":10297,"ViewsMonth":113,"SharedOn":"Jan 6, 2014","Overview":null,"Description":"Awesome Sandstone roof loaded with boulder problems with lower end difficulty trad lines nearby. A frequented site by locals.","GettingThere":"From the parking area, follow the approach trail until you reach the bluff line. Look left and notice a roof loaded with problems. Approach it and have fun.","URL":"https://www.mountainproject.com/area/108562416/gill-roof"}
{"AreaId":110057989,"ParentAreaId":114151233,"AreaName":"Superball Slab Boulder","Elevation":null,"ElevationUnits":null,"Latitude":37.599,"Longitude":-89.193,"ViewsTotal":1194,"ViewsMonth":15,"SharedOn":"Feb 10, 2015","Overview":null,"Description":"Sits atop the slab on the popular 4th class scramble to the top of the bluff.","GettingThere":"When you reach the bluff go right for about 100 yds. climb up the short slab to the left leaning boulder.","URL":"https://www.mountainproject.com/area/110057989/superball-slab-boulder"}
{"AreaId":110091856,"ParentAreaId":114151233,"AreaName":"Amphitheater Boulders","Elevation":634.0,"ElevationUnits":"ft","Latitude":37.6,"Longitude":-89.191,"ViewsTotal":4254,"ViewsMonth":55,"SharedOn":"Feb 18, 2015","Overview":null,"Description":"The Amphitheater Boulders hold a high concentration of quality boulder problems and are some of the cleaner problems in the park thanks to the roofs protection.","GettingThere":"Follow the main trail to the Gill Roof until you reach the cliff line. At the cliff line take a right and follow the trail up and then down to descend into the natural amphitheater roof. Continue towards the boulder field that has fallen from the roof above and locate the larger boulders towards the end. These are the main boulders.","URL":"https://www.mountainproject.com/area/110091856/amphitheater-boulders"}
{"AreaId":116147076,"ParentAreaId":114151233,"AreaName":"Sloper Slab","Elevation":631.0,"ElevationUnits":"ft","Latitude":37.599,"Longitude":-89.191,"ViewsTotal":2663,"ViewsMonth":86,"SharedOn":"Nov 28, 2018","Overview":null,"Description":"A burly short clifflline that shirts out at the bottom to form one gigantic Sloper. Fight through a sloppy bulge on all the boulder problems here.","GettingThere":"Just past the Devils Stand Table and right before the Gill Wall.","URL":"https://www.mountainproject.com/area/116147076/sloper-slab"}
{"AreaId":110061458,"ParentAreaId":114151233,"AreaName":"Waterfall Roof","Elevation":631.0,"ElevationUnits":"ft","Latitude":37.599,"Longitude":-89.19,"ViewsTotal":2371,"ViewsMonth":31,"SharedOn":"Feb 11, 2015","Overview":null,"Description":"Fun roof with many featured holds, good for bouldering.","GettingThere":"This wall is located above the Gill Wall. Scramble up the back-right side of the Gill Wall to reach it.","URL":"https://www.mountainproject.com/area/110061458/waterfall-roof"}
{"AreaId":110057948,"ParentAreaId":114151233,"AreaName":"Gill Wall","Elevation":629.0,"ElevationUnits":"ft","Latitude":37.599,"Longitude":-89.191,"ViewsTotal":5043,"ViewsMonth":65,"SharedOn":"Feb 10, 2015","Overview":null,"Description":"Tall, smooth and gently overhanging","GettingThere":"To find the Gill Wall proceed past the devil's standtable a few hundred yards, staying on the trail. You'll come to a short hill, past which is a ~20ft tall sheer wall.","URL":"https://www.mountainproject.com/area/110057948/gill-wall"}
{"AreaId":110079355,"ParentAreaId":114151233,"AreaName":"Higher Education Area","Elevation":653.0,"ElevationUnits":"ft","Latitude":37.599,"Longitude":-89.19,"ViewsTotal":2506,"ViewsMonth":32,"SharedOn":"Feb 15, 2015","Overview":null,"Description":"Good bouldering area with walls 20ish feet tall","GettingThere":"On cliff line \"20ish yards\" just past the Gill Wall.","URL":"https://www.mountainproject.com/area/110079355/higher-education-area"}
{"AreaId":109345928,"ParentAreaId":109332535,"AreaName":"45 Degree Wall","Elevation":null,"ElevationUnits":null,"Latitude":37.782,"Longitude":-89.509,"ViewsTotal":7278,"ViewsMonth":87,"SharedOn":"Aug 12, 2014","Overview":null,"Description":"100 yards past the Warm-Up Wall","GettingThere":"Hike from the parking area","URL":"https://www.mountainproject.com/area/109345928/45-degree-wall"}
{"AreaId":109345949,"ParentAreaId":109332535,"AreaName":"Cemetery Wall","Elevation":null,"ElevationUnits":null,"Latitude":37.782,"Longitude":-89.509,"ViewsTotal":4917,"ViewsMonth":59,"SharedOn":"Aug 12, 2014","Overview":null,"Description":"The first wall after crossing the large ditch","GettingThere":"hike the path","URL":"https://www.mountainproject.com/area/109345949/cemetery-wall"}
{"AreaId":109345942,"ParentAreaId":109332535,"AreaName":"Warm-Up Wall","Elevation":null,"ElevationUnits":null,"Latitude":37.782,"Longitude":-89.509,"ViewsTotal":4896,"ViewsMonth":59,"SharedOn":"Aug 12, 2014","Overview":null,"Description":"About 75 yards past the Cemetery Wall across a dry creek bed","GettingThere":"Hike from parking area","URL":"https://www.mountainproject.com/area/109345942/warm-up-wall"}
{"AreaId":116566932,"ParentAreaId":110009688,"AreaName":"Chicago Ice Tower","Elevation":777.0,"ElevationUnits":"ft","Latitude":41.422,"Longitude":-87.714,"ViewsTotal":1214,"ViewsMonth":43,"SharedOn":"Feb 27, 2019","Overview":null,"Description":null,"GettingThere":null,"URL":"https://www.mountainproject.com/area/116566932/chicago-ice-tower"}
{"AreaId":120377817,"ParentAreaId":110009688,"AreaName":"Giant City","Elevation":561.0,"ElevationUnits":"ft","Latitude":37.627,"Longitude":-89.204,"ViewsTotal":55,"ViewsMonth":16,"SharedOn":"Mar 10, 2021","Overview":null,"Description":"While better known for great sandstone climbing, when the conditions allow, a few great ice flows will form.","GettingThere":"Use you phone's gps to take you to Giant City State Park and navigate to Shelter 1 once there.","URL":"https://www.mountainproject.com/area/120377817/giant-city"}
{"AreaId":120334565,"ParentAreaId":110009688,"AreaName":"Jackson Falls","Elevation":594.0,"ElevationUnits":"ft","Latitude":37.508,"Longitude":-88.683,"ViewsTotal":260,"ViewsMonth":70,"SharedOn":"Feb 28, 2021","Overview":null,"Description":"While Jackson is mostly known for stellar sport and trad climbing, great ice route do form when the conditions allow.","GettingThere":"From I24 turn North on highway 45 turn right (East) on Ozark road for about 4.5 miles. Turn left on Trigg Tower Road to the first farmhouse and turn right. The parking is about 2 miles down the dirt road just before crossing the creek.    Coming from the south, you can access Glen St Falls Road from Pope Co Road 2260.  However, it will require an off-road vehicle.","URL":"https://www.mountainproject.com/area/120334565/jackson-falls"}
{"AreaId":106656040,"ParentAreaId":110009688,"AreaName":"Starved Rock State Park","Elevation":466.0,"ElevationUnits":"ft","Latitude":41.321,"Longitude":-88.993,"ViewsTotal":28792,"ViewsMonth":207,"SharedOn":"Jan 21, 2010","Overview":null,"Description":"Starved Rock is an amazing vertical oasis along the Illinois River.  The rock is incredibly soft, but the creeks and a few seeps form lovely waterfalls that freeze in a good winter.The canyons open to ice climbing have varied over the years, and climbers must register.  Be sure to check in the Park Maintenance building before you hop on the ice, tickets are $195, an expensive day of climbing.Ice Climbing in only the following canyons, subject to changes from year to year:(2020-2021):Wildcat CanyonTonti CanyonLaSalle CanyonOttawa CanyonIce Climbing RegulationsSign in at Maintenance building. ALSO Sign out at the end of the day requiredClimbing allowed between 7am and DuskNo Climbing aloneNo Mixed ClimbingDo NOT wear your crampons on the the wooden bridges or walkway.","GettingThere":"Located along the Illinois River south of Utica, IL.The ice is 15-30 minutes along park trails.  See the individual canyons and the map for details.","URL":"https://www.mountainproject.com/area/106656040/starved-rock-state-park"}
{"AreaId":120305158,"ParentAreaId":106656040,"AreaName":"Lasalle Canyon","Elevation":613.0,"ElevationUnits":"ft","Latitude":41.311,"Longitude":-88.971,"ViewsTotal":127,"ViewsMonth":31,"SharedOn":"Feb 19, 2021","Overview":null,"Description":"A long walk to a short flow - Tonti's sister canyon.","GettingThere":"From Parkman's Plain.After you register at the Park Maintenance building, go up to Hwy 71 and drive to the east.  After a number of twists in the road, the Parkman's Plain parking area is on your left, with a sign that declares \"Lasalle and Tonti Canyons\".Follow the trail north, descend the Owl Canyon stairs (no crampons) to the river's edge, and head back west along the river trail.  Finally arrive at the mouth of Lasalle and Tonti Canyons, where a large arched bridge crosses the creek.  Head up the left side of the canyon, staying in the left (east) fork.","URL":"https://www.mountainproject.com/area/120305158/lasalle-canyon"}
{"AreaId":120305148,"ParentAreaId":106656040,"AreaName":"Other Canyons","Elevation":466.0,"ElevationUnits":"ft","Latitude":41.321,"Longitude":-88.993,"ViewsTotal":561,"ViewsMonth":135,"SharedOn":"Feb 19, 2021","Overview":null,"Description":"This is a holding area for historical information about ice climbing in canyons that are not currently open.","GettingThere":"Don't be a jerk.","URL":"https://www.mountainproject.com/area/120305148/other-canyons"}
{"AreaId":120305151,"ParentAreaId":106656040,"AreaName":"Ottawa Canyon","Elevation":609.0,"ElevationUnits":"ft","Latitude":41.307,"Longitude":-88.947,"ViewsTotal":180,"ViewsMonth":45,"SharedOn":"Feb 19, 2021","Overview":null,"Description":"Moderately-sized ice, a short half mile walk from the road.","GettingThere":"After you register at the Park Maintenance building, go up to Hwy 71 and drive to the east end of the Park.  After the road descends to the river's edge, find the first parking lot on the right.  The trail back into the canyon leads from the west corner of the lot.  After you pass Council Overhang, take the right (west) fork of the canyon.","URL":"https://www.mountainproject.com/area/120305151/ottawa-canyon"}
{"AreaId":120305166,"ParentAreaId":106656040,"AreaName":"Tonti Canyon","Elevation":585.0,"ElevationUnits":"ft","Latitude":41.311,"Longitude":-88.974,"ViewsTotal":274,"ViewsMonth":68,"SharedOn":"Feb 19, 2021","Overview":null,"Description":"Also spelled \"Tonty\".    A deep, secluded canyon with tall ice.","GettingThere":"The wooden trail structures are in horrible shape (2021) and have been closed to hiking for a couple of years.  Only registered ice climbers have permission to be back here!    From Parkman's Plain:    After you register at the Park Maintenance building, go up to Hwy 71 and drive to the east.  After a number of twists in the road, the Parkman's Plain parking area is on your left, with a sign that declares \"Lasalle and Tonti Canyons\".    Follow the trail north, descend the Owl Canyon stairs (no crampons) to the river's edge, and head back west along the river trail.  Finally arrive at the mouth of Lasalle and Tonti Canyons, where a large arched bridge crosses the creek.  Cross the bridge and head up the right side of the canyon, staying in the right (west) fork.","URL":"https://www.mountainproject.com/area/120305166/tonti-canyon"}
{"AreaId":120305180,"ParentAreaId":106656040,"AreaName":"Wildcat Canyon","Elevation":598.0,"ElevationUnits":"ft","Latitude":41.316,"Longitude":-88.983,"ViewsTotal":235,"ViewsMonth":59,"SharedOn":"Feb 19, 2021","Overview":null,"Description":"Tall ice!","GettingThere":"After registering at the Park Maintenance building, park in the main lot and follow the river trail to the east.","URL":"https://www.mountainproject.com/area/120305180/wildcat-canyon"}
{"AreaId":111108235,"ParentAreaId":106659441,"AreaName":"Kankakee River State Park","Elevation":591.0,"ElevationUnits":"ft","Latitude":41.204,"Longitude":-87.979,"ViewsTotal":3287,"ViewsMonth":47,"SharedOn":"Oct 3, 2015","Overview":null,"Description":"Kankakee River State Park is home to 30+ foot limestone walls and several bouldering areas. The rock tents to be blocky and characterized by shelves and small roofs. All of the routes are toprope or trad with no bolted anchors. Climbing access was revoked after a drunk camper (non-climber) fell down a cliff - this page is for historical completeness and in the hopes that climbing here will be reopened some day. Please do not climb here.","GettingThere":"The main entrance to the Park is 5314 W. Rt. 102, Bourbonnais, IL 60914. The entrance to Rock Creek is about 0.1 miles east on 102.","URL":"https://www.mountainproject.com/area/111108235/kankakee-river-state-park"}
{"AreaId":111108263,"ParentAreaId":111108235,"AreaName":"Bouldering Cave","Elevation":566.0,"ElevationUnits":"ft","Latitude":41.203,"Longitude":-87.982,"ViewsTotal":1862,"ViewsMonth":27,"SharedOn":"Oct 3, 2015","Overview":null,"Description":"An obvious limestone cave very near the main entrance to the state park. The bottom of it is often flooded in spring and summer. It is usually dry in fall. Most routes can still be climbed when flooded.","GettingThere":"From the entrance to the Park,take the first right turn on the road and park at the main parking lot on the right just after the turn. Walk down to the bike path and follow it right (west) to the bridge, a minute or so from the lot. Right before the bridge, veer left and follow the obvious, dry (usually) creekbed to the obvious limestone cave. This should take less than a few minutes.","URL":"https://www.mountainproject.com/area/111108263/bouldering-cave"}
{"AreaId":118064951,"ParentAreaId":118064939,"AreaName":"Starting Area","Elevation":645.0,"ElevationUnits":"ft","Latitude":41.298,"Longitude":-89.043,"ViewsTotal":5580,"ViewsMonth":287,"SharedOn":"Nov 18, 2019","Overview":null,"Description":"All of the problems that are east of the waterfall and on the main cliff faces as you enter the woods.","GettingThere":"On the cliff side of the trail near the start of the cliff band.","URL":"https://www.mountainproject.com/area/118064951/starting-area"}
{"AreaId":118065014,"ParentAreaId":118064939,"AreaName":"Broken Bridge Area","Elevation":645.0,"ElevationUnits":"ft","Latitude":41.298,"Longitude":-89.047,"ViewsTotal":7243,"ViewsMonth":375,"SharedOn":"Nov 18, 2019","Overview":null,"Description":"Middle section of the cliff band with some smaller sized free-standing boulders.","GettingThere":"Past the small waterfall and directly on the right of the trail headed up the hill by the broken bridge.","URL":"https://www.mountainproject.com/area/118065014/broken-bridge-area"}
{"AreaId":118064973,"ParentAreaId":118064939,"AreaName":"Blue Elephant Area","Elevation":646.0,"ElevationUnits":"ft","Latitude":41.299,"Longitude":-89.05,"ViewsTotal":1402,"ViewsMonth":73,"SharedOn":"Nov 18, 2019","Overview":null,"Description":"Newest area and the furthest down the cliff band from the trail start. Features mainly highball cliff line problems.","GettingThere":"This is in the NEW & developing Blue Elephant Area! From the entrance, travel all the way down past the waterfall, past the bridge ruins, past the mushroom slab, until you come to an old concrete shelter ruin. The Blue Elephant area is past the shelter ruin, up the hill on the left.","URL":"https://www.mountainproject.com/area/118064973/blue-elephant-area"}
{"AreaId":118179730,"ParentAreaId":118064939,"AreaName":"Christmas Area","Elevation":563.0,"ElevationUnits":"ft","Latitude":41.3,"Longitude":-89.055,"ViewsTotal":794,"ViewsMonth":44,"SharedOn":"Dec 25, 2019","Overview":null,"Description":"A solid area with a couple nice easy climbs. Area shows potential for expansion. There are a lot of chossy overhangs so please be careful. Just like the rest of the park, 95% of the rock is unstable. Fortunately, with some common sense and determination, solid routes can be found. I am not 100% sure what the legal access status of this section of woods is, but many locals use the trails and say the landowner keeps this area open to the public. Discovered on a 57 degree Christmas eve.","GettingThere":"From the east entrance, travel along the river until you come to a fence and a runoff waterfall that smells... great. on the right there is a gate where a grass drive starts. follow the drive about halfway between the start of the drive and the clearing with the mansion. Christmas area is on your left. The Red Rocket feature and the large Green boulder should stand out. You can enter from the west, although you have to use a private road. Locals use this road for ATV's and dirt bikes and say the road owner does not mind as long as you are respectful and do not disturb the residence. You can park at the end of the grass drive by the fence.","URL":"https://www.mountainproject.com/area/118179730/christmas-area"}
{"AreaId":113905129,"ParentAreaId":113878460,"AreaName":"Sentinel","Elevation":633.0,"ElevationUnits":"ft","Latitude":42.125,"Longitude":-90.157,"ViewsTotal":20105,"ViewsMonth":465,"SharedOn":"Dec 5, 2017","Overview":null,"Description":"The exact location of these routes is unknown. Please help mountain project determine their location.","GettingThere":"Approach from the first parking lot / trail at the South entrance to the park. If you're rapping in you can avoid hiking uphill by driving up to the Sentinel parking lot. In either case follow the signage to the Sentinel area.","URL":"https://www.mountainproject.com/area/113905129/sentinel"}
{"AreaId":115372896,"ParentAreaId":113878460,"AreaName":"Forgotten Wall","Elevation":710.0,"ElevationUnits":"ft","Latitude":42.125,"Longitude":-90.157,"ViewsTotal":6150,"ViewsMonth":186,"SharedOn":"Sep 30, 2018","Overview":null,"Description":"This area is currently closed to climbing.","GettingThere":"This is the area South of The Sentinel/Quad area.","URL":"https://www.mountainproject.com/area/115372896/forgotten-wall"}
{"AreaId":115363124,"ParentAreaId":113878460,"AreaName":"Sun Buttress","Elevation":702.0,"ElevationUnits":"ft","Latitude":42.124,"Longitude":-90.156,"ViewsTotal":4314,"ViewsMonth":130,"SharedOn":"Sep 27, 2018","Overview":null,"Description":"South and West facing buttress.","GettingThere":"North from the Whipporwill Hollow parking area.","URL":"https://www.mountainproject.com/area/115363124/sun-buttress"}
{"AreaId":113878474,"ParentAreaId":113878460,"AreaName":"Open Bible","Elevation":682.0,"ElevationUnits":"ft","Latitude":42.122,"Longitude":-90.156,"ViewsTotal":3640,"ViewsMonth":84,"SharedOn":"Nov 27, 2017","Overview":null,"Description":"Pillar located in the same clearing as Twin Sisters and Brother Buttress. There is no walk up top access. 'Access Route' (5.0) goes up the corner with the large tree growing into the rock above a horizontal crack. There is no hardware at the top but ample features for creating anchors.","GettingThere":"Park in the lot at the western leg of the Pine trail lot and follow the very short trail north to Twin Sisters. This pillar is located in the same clearing as Twin Sisters and Brother Buttress.","URL":"https://www.mountainproject.com/area/113878474/open-bible"}
{"AreaId":113878483,"ParentAreaId":113878460,"AreaName":"Twin Sisters","Elevation":675.0,"ElevationUnits":"ft","Latitude":42.122,"Longitude":-90.156,"ViewsTotal":6717,"ViewsMonth":154,"SharedOn":"Nov 27, 2017","Overview":null,"Description":"Refer to Photo","GettingThere":"Take the road leading downhill and south past Sentinel Trail parking to a sign pointing to Twin Sisters (north) and Indian Head (south). Park in the lot next to the outhouses. Twin Sisters and Brother Buttress are a short walk uphill and north from there. Or, you can walk from the base of Sentinel (access from bridge to the south of South Park entrance or from Sentinel Trail) and follow Rt. 84 to a dirt access road blocked by gate, near Twin Sisters parking. The trail direct from Sentinel is marked \"closed\" as of May 2018.","URL":"https://www.mountainproject.com/area/113878483/twin-sisters"}
{"AreaId":113878494,"ParentAreaId":113878460,"AreaName":"Brother Buttress","Elevation":715.0,"ElevationUnits":"ft","Latitude":42.122,"Longitude":-90.155,"ViewsTotal":5440,"ViewsMonth":126,"SharedOn":"Nov 27, 2017","Overview":null,"Description":"Refer to photo","GettingThere":"Take the road leading downhill and south past Sentinel Trail parking to a sign pointing to Twin Sisters (north) and Indian Head (south). Park in the lot next to the outhouses. Twin Sisters and Brother Buttress are a short walk uphill and north from there. Or, you can walk from the base of Sentinel (access from bridge to the south of South Park entrance or from Sentinel Trail) and follow Rt. 84 to a dirt access road blocked by gate, near Twin Sisters parking. The trail direct from Sentinel is marked \"closed\" as of May 2018.","URL":"https://www.mountainproject.com/area/113878494/brother-buttress"}
{"AreaId":113878489,"ParentAreaId":113878460,"AreaName":"Practice Wall","Elevation":679.0,"ElevationUnits":"ft","Latitude":42.122,"Longitude":-90.155,"ViewsTotal":850,"ViewsMonth":20,"SharedOn":"Nov 27, 2017","Overview":null,"Description":"Refer to photo","GettingThere":"Refer to photo","URL":"https://www.mountainproject.com/area/113878489/practice-wall"}
{"AreaId":114338186,"ParentAreaId":113878460,"AreaName":"Indian Head","Elevation":630.0,"ElevationUnits":"ft","Latitude":42.12,"Longitude":-90.156,"ViewsTotal":2769,"ViewsMonth":73,"SharedOn":"May 6, 2018","Overview":null,"Description":"Know this area? Click \"Improve This Page\" and add a description!","GettingThere":"Know this area? Click \"Improve This Page\" and add how to get here!","URL":"https://www.mountainproject.com/area/114338186/indian-head"}
{"AreaId":115363172,"ParentAreaId":113878460,"AreaName":"Bee Wall","Elevation":626.0,"ElevationUnits":"ft","Latitude":42.119,"Longitude":-90.157,"ViewsTotal":5210,"ViewsMonth":156,"SharedOn":"Sep 27, 2018","Overview":null,"Description":"Exposed, tall portion of the main rock wall between Indian Head and the Amphitheater.","GettingThere":"Approach from Orchard Hollow parking area near Indian Head Buttress. From the foot bridge over a gully below Indian Head, go South 75 yards to a faint fork in the trail. A set of stone steps trends left and uphill to the base of Bee Wall.","URL":"https://www.mountainproject.com/area/115363172/bee-wall"}
{"AreaId":115363163,"ParentAreaId":113878460,"AreaName":"Amphitheater Wall","Elevation":635.0,"ElevationUnits":"ft","Latitude":42.118,"Longitude":-90.157,"ViewsTotal":3662,"ViewsMonth":110,"SharedOn":"Sep 27, 2018","Overview":null,"Description":"Abandoned Quarry south of Indian Head and Bee Wall","GettingThere":"Parking along Highway 84 no longer exists. Park within the park by the Indian Head access. Attempt to stay on the trail just above the highway, avoiding the trail going left up the valley. The trail is terrible, and unmaintained, itch weed, etc.  History: The left side and center of Amphitheater Wall was a popular rappel spot. In the late 90's several large boulders fell from this section of the wall. The park put up a sign to close the wall. It was unfortunate, as the climbs on the right were not near the fall area.  Fear of Flying is an excellent climb, a rare two pitch climb if lead.  No close signs currently exist, and brochures posted still indicate the area south of twin sisters is open.","URL":"https://www.mountainproject.com/area/115363163/amphitheater-wall"}
{"AreaId":115363191,"ParentAreaId":113878460,"AreaName":"Butter Walls","Elevation":649.0,"ElevationUnits":"ft","Latitude":42.116,"Longitude":-90.158,"ViewsTotal":2316,"ViewsMonth":69,"SharedOn":"Sep 27, 2018","Overview":null,"Description":"Two closely spaced rock outcrops above the trail, 300 yards south of the Amphitheater parking area.","GettingThere":"Hike South from the Amphitheater Wall on the Upton's Cave trail. Just north of a footbridge, a faint trail goes tot eh top of the Butter Walls.","URL":"https://www.mountainproject.com/area/115363191/butter-walls"}
{"AreaId":115373322,"ParentAreaId":113878460,"AreaName":"Dihedrals Area","Elevation":662.0,"ElevationUnits":"ft","Latitude":42.107,"Longitude":-90.158,"ViewsTotal":2858,"ViewsMonth":86,"SharedOn":"Sep 30, 2018","Overview":null,"Description":"A set of dihedrals with a handful of climbs.","GettingThere":"Two tenths of a mile North of the Savanna-Sabula bridge, there is a small semi-circular turnout on the East side of Highway 84. A faint trail scrambles up the hill to the base of the cliff band.","URL":"https://www.mountainproject.com/area/115373322/dihedrals-area"}
{"AreaId":117761908,"ParentAreaId":113878460,"AreaName":"Bouldering","Elevation":603.0,"ElevationUnits":"ft","Latitude":42.143,"Longitude":-90.167,"ViewsTotal":292,"ViewsMonth":14,"SharedOn":"Sep 19, 2019","Overview":null,"Description":"Lots of bouldering potential located throughout the park.  Also, DO NOT BOULDER IN CLOSED AREAS!","GettingThere":"Check out specific areas for more details.","URL":"https://www.mountainproject.com/area/117761908/bouldering"}
{"AreaId":111749622,"ParentAreaId":110006134,"AreaName":"Dropzone Area","Elevation":650.0,"ElevationUnits":"ft","Latitude":37.517,"Longitude":-88.46,"ViewsTotal":2017,"ViewsMonth":32,"SharedOn":"Apr 4, 2016","Overview":null,"Description":"South-facing \"Domes\" area. 45 degree wall with tall, proud slab top outs.","GettingThere":"For easiest directions refer to Illinois' bouldering guidebook, \"Sandstone Warrior\" by Matt Bliss. This area is located at the south facing \"domes\" area. If you have found Canabanoid then just walk around to the other side of those large boulders and you will come to a 45 degree wall with side pulls and pockets. This area has a number of really aesthetic projects waiting to be solved.","URL":"https://www.mountainproject.com/area/111749622/dropzone-area"}
{"AreaId":111738786,"ParentAreaId":110006134,"AreaName":"The Gap Area","Elevation":700.0,"ElevationUnits":"ft","Latitude":37.518,"Longitude":-88.459,"ViewsTotal":2205,"ViewsMonth":35,"SharedOn":"Mar 30, 2016","Overview":null,"Description":"This area is home to several quality warm ups. Problems are short and technical, consisting of one or two moves before transitioning on to the slab top out section.","GettingThere":"From the one horse gap cut-out pathway leading from the top of the outcrop to the lower section, head right and begin seeking out lines on the short bulbous boulder/cliff line.","URL":"https://www.mountainproject.com/area/111738786/the-gap-area"}
{"AreaId":111735044,"ParentAreaId":110006134,"AreaName":"Nimbus Boulder","Elevation":697.0,"ElevationUnits":"ft","Latitude":37.518,"Longitude":-88.459,"ViewsTotal":1508,"ViewsMonth":24,"SharedOn":"Mar 29, 2016","Overview":null,"Description":"Large boulder with a proud arete line. Nimbus faces south east and is directly across from the River to River trail.","GettingThere":"Follow the one horse gap cut-out pathway that leads down from the top of the rock outcrop. Once down in the lower area head left and you will immediately be faced with several large boulders. The Nimbus boulder will be easy to identify as it is the larger of the boulders in this area.","URL":"https://www.mountainproject.com/area/111735044/nimbus-boulder"}
{"AreaId":110006149,"ParentAreaId":110006134,"AreaName":"Ryan's Area","Elevation":637.0,"ElevationUnits":"ft","Latitude":37.518,"Longitude":-88.461,"ViewsTotal":1575,"ViewsMonth":20,"SharedOn":"Jan 29, 2015","Overview":null,"Description":"This cluster of boulders is noted for the tall prow of Cookie Monster","GettingThere":"Refer to Matt Bliss's Sandstone Warrior","URL":"https://www.mountainproject.com/area/110006149/ryans-area"}
{"AreaId":112240933,"ParentAreaId":112240918,"AreaName":"Lily Wall","Elevation":639.0,"ElevationUnits":"ft","Latitude":38.971,"Longitude":-90.487,"ViewsTotal":24598,"ViewsMonth":432,"SharedOn":"Oct 17, 2016","Overview":null,"Description":"The first wall the trail leads you to","GettingThere":"refer to map","URL":"https://www.mountainproject.com/area/112240933/lily-wall"}
{"AreaId":112240930,"ParentAreaId":112240918,"AreaName":"Lucky Strike Pillar","Elevation":634.0,"ElevationUnits":"ft","Latitude":38.971,"Longitude":-90.488,"ViewsTotal":6609,"ViewsMonth":116,"SharedOn":"Oct 17, 2016","Overview":null,"Description":"Stand alone pillar directly left of the Lily Wall","GettingThere":"To the left of the main wall","URL":"https://www.mountainproject.com/area/112240930/lucky-strike-pillar"}
{"AreaId":112249281,"ParentAreaId":112240918,"AreaName":"Hornbein's Wall","Elevation":632.0,"ElevationUnits":"ft","Latitude":38.971,"Longitude":-90.488,"ViewsTotal":6746,"ViewsMonth":119,"SharedOn":"Oct 20, 2016","Overview":null,"Description":"To honor Tom Hornbein. This is the old school traditional wall of the park. This wall is chuck full of good traditional leads that all end at bolted anchors and are great for top roping","GettingThere":"The wall beginning just past the Lucky Strike Pillar","URL":"https://www.mountainproject.com/area/112249281/hornbeins-wall"}
{"AreaId":112494774,"ParentAreaId":112240918,"AreaName":"Community Effort Wall","Elevation":627.0,"ElevationUnits":"ft","Latitude":38.971,"Longitude":-90.488,"ViewsTotal":6492,"ViewsMonth":123,"SharedOn":"Feb 14, 2017","Overview":null,"Description":"This wall lies between the Hornbein Wall and Ryan's Balcony. Its distinguishing feature is the thin finger crack that splits the middle of the wall.","GettingThere":"First wall past Hornbein's Wall","URL":"https://www.mountainproject.com/area/112494774/community-effort-wall"}
{"AreaId":112257214,"ParentAreaId":112240918,"AreaName":"Ryan's Balcony","Elevation":620.0,"ElevationUnits":"ft","Latitude":38.971,"Longitude":-90.488,"ViewsTotal":7700,"ViewsMonth":136,"SharedOn":"Oct 23, 2016","Overview":null,"Description":"This short wall, just past Hornbein's Wall, has several routes on it. The majority of the routes are short, but there are two routes on the left side that are worthy","GettingThere":"Just walk past the Hornbein's Wall begin looking for a sharp arete with a sizable tree at the base of it. This is the beginning of Ryan's Balcony","URL":"https://www.mountainproject.com/area/112257214/ryans-balcony"}
{"AreaId":112242636,"ParentAreaId":112240918,"AreaName":"Tombstone","Elevation":620.0,"ElevationUnits":"ft","Latitude":38.971,"Longitude":-90.488,"ViewsTotal":9532,"ViewsMonth":167,"SharedOn":"Oct 18, 2016","Overview":null,"Description":"Beautiful tall face shaped like a tombstone","GettingThere":"refer to map","URL":"https://www.mountainproject.com/area/112242636/tombstone"}
{"AreaId":112275208,"ParentAreaId":112240918,"AreaName":"The Wall of Wild Things","Elevation":626.0,"ElevationUnits":"ft","Latitude":38.971,"Longitude":-90.488,"ViewsTotal":10043,"ViewsMonth":177,"SharedOn":"Oct 30, 2016","Overview":null,"Description":"The easiest wall in the park, enjoy these easy warm ups","GettingThere":"First wall past the Tombstone","URL":"https://www.mountainproject.com/area/112275208/the-wall-of-wild-things"}
{"AreaId":112540461,"ParentAreaId":112240918,"AreaName":"Eagle Wall","Elevation":632.0,"ElevationUnits":"ft","Latitude":38.971,"Longitude":-90.488,"ViewsTotal":8354,"ViewsMonth":160,"SharedOn":"Mar 9, 2017","Overview":null,"Description":"This wall is most notably marked by the two splitter cracks that run up the wall","GettingThere":"First wall directly left of the Wall of Wild Things.","URL":"https://www.mountainproject.com/area/112540461/eagle-wall"}
{"AreaId":112240927,"ParentAreaId":112240918,"AreaName":"Meadow Slab","Elevation":625.0,"ElevationUnits":"ft","Latitude":38.971,"Longitude":-90.489,"ViewsTotal":17086,"ViewsMonth":300,"SharedOn":"Oct 17, 2016","Overview":null,"Description":"This is a steep angle slab in the former quarry","GettingThere":"Farthest left climbing is allowed in the park","URL":"https://www.mountainproject.com/area/112240927/meadow-slab"}
{"AreaId":112440470,"ParentAreaId":112240918,"AreaName":"Boy Scout Cove","Elevation":609.0,"ElevationUnits":"ft","Latitude":38.971,"Longitude":-90.489,"ViewsTotal":11397,"ViewsMonth":211,"SharedOn":"Jan 12, 2017","Overview":null,"Description":"The short cove to the left of the Meadow Slab","GettingThere":"Follow the main paved/gravel trail uphill. When you reach the crossroad go straight and hike past the sign the has a horse with a circle and line through it (so no horses allowed). It will be the first wall you come to.","URL":"https://www.mountainproject.com/area/112440470/boy-scout-cove"}
{"AreaId":118057006,"ParentAreaId":112240918,"AreaName":"Bouldering","Elevation":533.0,"ElevationUnits":"ft","Latitude":38.971,"Longitude":-90.487,"ViewsTotal":3485,"ViewsMonth":179,"SharedOn":"Nov 17, 2019","Overview":null,"Description":"Bouldering options exist all over Pere Marquette State Park. Many boulders are still waiting to be climbed. Feel free to post and claim FA of any boulder problem you develop.","GettingThere":"Click on specific boulders for more information","URL":"https://www.mountainproject.com/area/118057006/bouldering"}
{"AreaId":113942085,"ParentAreaId":118057006,"AreaName":"Jenga Diseaster Boulders","Elevation":535.0,"ElevationUnits":"ft","Latitude":38.971,"Longitude":-90.487,"ViewsTotal":3963,"ViewsMonth":93,"SharedOn":"Dec 19, 2017","Overview":null,"Description":"There is potential for about a half dozen boulder problems to the right of the Lily Wall.","GettingThere":"Follow the trail around to the top of the cliff line.","URL":"https://www.mountainproject.com/area/113942085/jenga-diseaster-boulders"}
{"AreaId":119979038,"ParentAreaId":119978970,"AreaName":"The Grateful Fin","Elevation":561.0,"ElevationUnits":"ft","Latitude":37.643,"Longitude":-89.34,"ViewsTotal":571,"ViewsMonth":83,"SharedOn":"Nov 25, 2020","Overview":null,"Description":"This fin feature has very high rock quality and some great problems.","GettingThere":"From the painted footprint roof boulder, look up the hill. The fin is the right side of the next rock feature.","URL":"https://www.mountainproject.com/area/119979038/the-grateful-fin"}
{"AreaId":119979015,"ParentAreaId":119978970,"AreaName":"Main Cliff","Elevation":578.0,"ElevationUnits":"ft","Latitude":37.644,"Longitude":-89.341,"ViewsTotal":569,"ViewsMonth":81,"SharedOn":"Nov 25, 2020","Overview":null,"Description":"Hosts the easiest lines and some fun harder ones. Be sure to have a property line map if you explore further down the cliff line. It does intersect with private property at some unmarked point.","GettingThere":"Walk left of the grateful fin feature and around two other large blocks.","URL":"https://www.mountainproject.com/area/119979015/main-cliff"}
{"AreaId":119979070,"ParentAreaId":119978970,"AreaName":"Shawnee Solitaire","Elevation":559.0,"ElevationUnits":"ft","Latitude":37.647,"Longitude":-89.339,"ViewsTotal":1008,"ViewsMonth":147,"SharedOn":"Nov 25, 2020","Overview":null,"Description":"The Shawnee Solitaire area offers the best in terms of aesthetic lines and quality hard movement.","GettingThere":"To get to the Shawnee Solitaire area, from the right side of the grateful fin walk further from the footprint boulder and over the ridge. You will see that the cliff line ‘turns a corner’ and continues on the other side of the ridge. Follow this cliff line quite a ways further down past its breaks. Worth the walk. There are a few problems on the cliff on the way there.","URL":"https://www.mountainproject.com/area/119979070/shawnee-solitaire"}
{"AreaId":116605186,"ParentAreaId":116546100,"AreaName":"Main Area","Elevation":463.0,"ElevationUnits":"ft","Latitude":37.622,"Longitude":-88.271,"ViewsTotal":5309,"ViewsMonth":191,"SharedOn":"Mar 14, 2019","Overview":null,"Description":"The main boulder field. Several classic problems here","GettingThere":"From the parking area, hike downhill and to the right alongside the lake. Continue walking until you reach a concrete spillway. Once here, hike uphill towards the rock.","URL":"https://www.mountainproject.com/area/116605186/main-area"}
{"AreaId":116608652,"ParentAreaId":116546100,"AreaName":"Bull Area","Elevation":464.0,"ElevationUnits":"ft","Latitude":37.624,"Longitude":-88.27,"ViewsTotal":2152,"ViewsMonth":78,"SharedOn":"Mar 15, 2019","Overview":null,"Description":"A small but great area with some classic Southern Illinois bouldering","GettingThere":"Hike north from the main area for a few minutes then you will find the Bull Area","URL":"https://www.mountainproject.com/area/116608652/bull-area"}
{"AreaId":114354343,"ParentAreaId":114406593,"AreaName":"The Dawn Wall","Elevation":718.0,"ElevationUnits":"ft","Latitude":42.319,"Longitude":-89.071,"ViewsTotal":1475,"ViewsMonth":39,"SharedOn":"May 10, 2018","Overview":null,"Description":"East facing limestone walls about 20-25 ft high with decent bouldering potential. Rock quality appears moderate to poor and worsens towards the broken bands at the top.","GettingThere":"Approach is short; about a half mile. Look for Cliff breakers resort and secure parking near by. Take the bike trail down the hill on the North side of the road and follow the bike trail until you reach the wall.","URL":"https://www.mountainproject.com/area/114354343/the-dawn-wall"}
{"AreaId":109348416,"ParentAreaId":107017143,"AreaName":"Cooker's Cave","Elevation":null,"ElevationUnits":null,"Latitude":37.498,"Longitude":-88.719,"ViewsTotal":2965,"ViewsMonth":36,"SharedOn":"Aug 13, 2014","Overview":null,"Description":"Located just past Spirit Cave, the bulk of problems begin on a short overhung cliffline. & proceed to a large cave. This area will undoubtedly see some future development.","GettingThere":"Refers to Matt Bliss's guidebook Sandstone Warrior","URL":"https://www.mountainproject.com/area/109348416/cookers-cave"}
{"AreaId":109348453,"ParentAreaId":107017143,"AreaName":"Lake Boulders","Elevation":null,"ElevationUnits":null,"Latitude":37.498,"Longitude":-88.719,"ViewsTotal":1774,"ViewsMonth":21,"SharedOn":"Aug 13, 2014","Overview":null,"Description":"Beyond the Kung Fu Wall, trend left on the trail down towards the lake. You will find Screaming Eagle, a tall sharp arete just beside the lake. Several other problems are located on this boulder & the tall boulder just behind it.","GettingThere":"Refer to Matt Bliss's guidebook Sandstone Warrior","URL":"https://www.mountainproject.com/area/109348453/lake-boulders"}
{"AreaId":109348374,"ParentAreaId":107017143,"AreaName":"Oriole Boulder","Elevation":null,"ElevationUnits":null,"Latitude":37.498,"Longitude":-88.719,"ViewsTotal":3517,"ViewsMonth":42,"SharedOn":"Aug 13, 2014","Overview":null,"Description":"This area is a few minutes hike from Cooker's Cave. Follow the cliffline on your right. There will be a trail on the ridge leading to the next area of boulders.","GettingThere":"Refer to Matt Bliss's guidebook Sandstone Warrior","URL":"https://www.mountainproject.com/area/109348374/oriole-boulder"}
{"AreaId":112441284,"ParentAreaId":107017143,"AreaName":"The Spirit Cave","Elevation":650.0,"ElevationUnits":"ft","Latitude":37.5,"Longitude":-88.719,"ViewsTotal":1172,"ViewsMonth":22,"SharedOn":"Jan 13, 2017","Overview":null,"Description":"The Spirit Cave is a tall roof that looks like the Rock was scorched by fire.","GettingThere":"When first entering the Roost, head left and up the hill to the cliff line.","URL":"https://www.mountainproject.com/area/112441284/the-spirit-cave"}
{"AreaId":116111818,"ParentAreaId":116111802,"AreaName":"Staircase Rock","Elevation":421.0,"ElevationUnits":"ft","Latitude":38.587,"Longitude":-87.643,"ViewsTotal":1053,"ViewsMonth":33,"SharedOn":"Nov 19, 2018","Overview":null,"Description":"This is the furthest rock formation down the bank with metal staircases going up them.","GettingThere":"Once to the park/boat dock, follow park drive alongside the river until rock formation is on your right (metal staircase).","URL":"https://www.mountainproject.com/area/116111818/staircase-rock"}
{"AreaId":116111858,"ParentAreaId":116111802,"AreaName":"Woods Rock","Elevation":402.0,"ElevationUnits":"ft","Latitude":38.592,"Longitude":-87.642,"ViewsTotal":1356,"ViewsMonth":43,"SharedOn":"Nov 19, 2018","Overview":null,"Description":"The tallest sandstone wall in the St. Francisville area.","GettingThere":"Once approaching the river (boat dock), if the ground is dry, you can turn left into the woods trail and follow it out to an opening, you'll see the rock face once you're on the trails. If its wet, you can easily access this by walking. Approach time is based off of walking, if you drive, you'll be able to drive right up to where you climb.","URL":"https://www.mountainproject.com/area/116111858/woods-rock"}
{"AreaId":113905467,"ParentAreaId":113905423,"AreaName":"Tiny Tim","Elevation":936.0,"ElevationUnits":"ft","Latitude":42.356,"Longitude":-90.294,"ViewsTotal":372,"ViewsMonth":9,"SharedOn":"Dec 5, 2017","Overview":null,"Description":"This page is under construction. When more information is known, it will be posted","GettingThere":"Refer to general directions to find the area.","URL":"https://www.mountainproject.com/area/113905467/tiny-tim"}
{"AreaId":113905599,"ParentAreaId":113905423,"AreaName":"Veteran's Boulder","Elevation":935.0,"ElevationUnits":"ft","Latitude":42.356,"Longitude":-90.294,"ViewsTotal":343,"ViewsMonth":8,"SharedOn":"Dec 5, 2017","Overview":null,"Description":"Refer to photo","GettingThere":"Refer to general directions and use photo","URL":"https://www.mountainproject.com/area/113905599/veterans-boulder"}
{"AreaId":113905455,"ParentAreaId":113905423,"AreaName":"Winston's Boulder","Elevation":935.0,"ElevationUnits":"ft","Latitude":42.356,"Longitude":-90.294,"ViewsTotal":670,"ViewsMonth":16,"SharedOn":"Dec 5, 2017","Overview":null,"Description":"This page is under construction. When more information is known, it will be posted","GettingThere":"Refer to general directions to find area","URL":"https://www.mountainproject.com/area/113905455/winstons-boulder"}
{"AreaId":116192337,"ParentAreaId":116192325,"AreaName":"Pistol","Elevation":502.0,"ElevationUnits":"ft","Latitude":38.411,"Longitude":-90.247,"ViewsTotal":3807,"ViewsMonth":125,"SharedOn":"Dec 17, 2018","Overview":null,"Description":"An Omage to Colorado’s Rifle. An old Thurmond area that has some seriously steep terrain. A few bolt lines are all that’s left visible. Evidence shows there used to be 12 routes established at one time.This area has potential but is extremely off limits. Maybe purchase the property if you're interested.","GettingThere":"Bluff Road South of Columbia Illinois. Look for the waterfall pouring out of the side of the bluff","URL":"https://www.mountainproject.com/area/116192337/pistol"}
{"AreaId":116192353,"ParentAreaId":116192325,"AreaName":"Rock City","Elevation":403.0,"ElevationUnits":"ft","Latitude":38.304,"Longitude":-90.309,"ViewsTotal":511,"ViewsMonth":17,"SharedOn":"Dec 17, 2018","Overview":null,"Description":"A small Limestone boulder field. Kimmeswick limestone that was blasted out of the side of the bluff back when it was a quarry. This area is extremely sensitive and should never be climbed. Its sole purpose on Mountain Project is to let the public know that this is not some undiscovered area and that it is extremely off limits.","GettingThere":"Near Valmeyer Illinois","URL":"https://www.mountainproject.com/area/116192353/rock-city"}
{"AreaId":116214477,"ParentAreaId":116192337,"AreaName":"Left Of Waterfall","Elevation":465.0,"ElevationUnits":"ft","Latitude":38.354,"Longitude":-90.263,"ViewsTotal":2276,"ViewsMonth":75,"SharedOn":"Dec 26, 2018","Overview":null,"Description":"Note: this is private property and no climbing access. A handful of bolted routes exist left of the waterfall. The hardware is aging.","GettingThere":"Walk left of the waterfall","URL":"https://www.mountainproject.com/area/116214477/left-of-waterfall"}
{"AreaId":116214506,"ParentAreaId":116192337,"AreaName":"Right Of Waterfall","Elevation":467.0,"ElevationUnits":"ft","Latitude":38.355,"Longitude":-90.263,"ViewsTotal":676,"ViewsMonth":22,"SharedOn":"Dec 26, 2018","Overview":null,"Description":"A few routes exist right of the waterfall. Only one has hardware left on it.","GettingThere":"Walk right of the waterfall","URL":"https://www.mountainproject.com/area/116214506/right-of-waterfall"}
