{"CommentId":105912461,"AreaId":105911816,"UserId":105828100,"UserName":"JJ Schlick","CommentBody":"Oh I am going to Jackson, going get ma fill.","CommentTime":"Jan 25, 2007","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":106277307,"AreaId":105911816,"UserId":10363,"UserName":"Ben Bruestle","CommentBody":"Illinois Climbers Association: iclimb-ica.org/pages/index.…","CommentTime":"Oct 13, 2008","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106323021,"AreaId":105911816,"UserId":106127860,"UserName":"cuclimbing","CommentBody":"To all you climbers stuck in Charleston, IL, don't feel bad. I grew up in the countryside, and go down any creek for long enough you'll find something to climb. The map I posted above has a spot of mine with a 20-30ft sandstone cliff. Rock quality is so so, if I still lived there I'd get a pic of the face. The Embarrass River has some faces too, but you gotta wade upstream for a few hours. Happy climbing!","CommentTime":"Dec 16, 2008","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106610861,"AreaId":105911816,"UserId":106071383,"UserName":"Woodchuck ATC","CommentBody":"Took me long enough to get some Illinos photos posted up here. These are all 80-83 vintage Kankakee River State Park. It would be a very popular bouldering location today with many roof moves just off the deck and most walls less than 30 ft in height. many routes are 5.8 and 5.9 A shame the DNR would not budge on requests allowing us to continue climbing there as of June 1983.","CommentTime":"Nov 24, 2009","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106610893,"AreaId":105911816,"UserId":106157684,"UserName":"sweatpants","CommentBody":"Why did the DNR stop allowing climbing?","CommentTime":"Nov 24, 2009","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106611150,"AreaId":105911816,"UserId":106071383,"UserName":"Woodchuck ATC","CommentBody":"They removed access stairs and forbid climbing because drunk kids with coolers of beer, in the park at night illegally, have trashed it up and fallen down or off the cliffs too. THAT in their mind was related to the use of cliffs for anything vertical. Senseless. But climbing had not yet become a widely known indoor sport back then; no X Games, no MTV or action sports media, so nothing for them to relate to except guys who fall off cliffs with coolers full of beer. We wrote letters, made calls, had a meeting, explained our simple use, clean climbing, no pitons, toprope mostly, etc..and they still said NO. This was long before the Access Fund got started to the degree it is today. Chalk was not an issue, as it was the same substance and color as the dusty calcium carbonate limestone rocks. Fishermen leave bait containers and trash, and hike down the same rugged cliff trail that we do,but they get to stay. (they pay for stuff, we didn't; so go figure) Trespass and you would get your gear taken away plus a fine. Since then, with the lack of climbing traffic on the cliffs, there is a major increase of plants on the blocky rocks. Many holds are gone from dirt and invasive plant roots prying them off the walls. Hard to believe we were safer than nature turns out to be.","CommentTime":"Nov 25, 2009","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106643792,"AreaId":105911816,"UserId":106005596,"UserName":"JamesW","CommentBody":"If you visit Rock Creek you can see the remnants of past climbing...fixed pins on a lot of the walls. Rumor has it that Mike McCarrin had authored a hand drawn guidebook... I have also heard of some harder routes being established in the creek (.13ish) by McCarrin??? FYI; A few years ago i was speaking with a local & was told that another canyon exists in the area. apparently it is on private property, but is supposedly deeper and more undercut than rock creek...does anyone have any info on this???","CommentTime":"Jan 4, 2010","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106840105,"AreaId":105911816,"UserId":106028618,"UserName":"Dan Roberts","CommentBody":"I am looking for old guide books. Midwest preferably, but I'd be interested in most anything. Kind of a hobby. I like to know the history and true route names of the places I climb.","CommentTime":"Jul 27, 2010","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106968270,"AreaId":105911816,"UserId":105866584,"UserName":"Lee Frazer","CommentBody":"Where's the best place to boulder in S. IL? Jackson Falls? Somewhere else? Any advice would be appreciated. In S. IL. for Thanksgiving, but going through rock withdrawal. Thanks folks.","CommentTime":"Nov 22, 2010","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106969774,"AreaId":105911816,"UserId":11156,"UserName":"Tradiban","CommentBody":"Lee, lots of Boulders down there. Jackson Falls will have the most easily found high quality problems. Bring your harness and shoes as you will probably be able to hook up with some people for some belays.","CommentTime":"Nov 23, 2010","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106986940,"AreaId":105911816,"UserId":106950123,"UserName":"mattmaxwell","CommentBody":"Lee -- check out \"The Sandstone Warrior\" guidebook by Matt Bliss. book dedicated to bouldering in So Ill. popular (as in just a few people) areas: Jackson Falls, One Horse Gap, Dixon Springs, Holy Boulders, Giant City.......","CommentTime":"Dec 13, 2010","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":111368831,"AreaId":105911816,"UserId":109212991,"UserName":"Ted Pinson","CommentBody":"Multi pitch in Illinois? Where?? On a possibly related note: any idea where the cover photo of Vertical Heartland was taken?","CommentTime":"Nov 30, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":111380816,"AreaId":105911816,"UserId":108541430,"UserName":"AaronJ","CommentBody":"Ted: The photo on the Vertical Heartland cover is of Fancy Lads at Draper's Bluff, which has been closed to public climbing for a few years. There are some multi-pitch climbs at Giant City State Park and Cedar Bluff, but I think it's mostly short pitches or traversing. Also this: pursuitofexploration.com/20…","CommentTime":"Dec 4, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":111396592,"AreaId":105911816,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"Hey Ted, In my opinion, the best multi-pitch route in the state is Tempura Tour at Giant City. Last year some friends and I spent a lot of time scrubbing and digging out cracks to open up three more pitches to make the route climb from the Makanda Layback to Georges. The route is well protected, has been throughly cleaned, and is very adventurous. Here is the link: mountainproject.com/v/tempu…","CommentTime":"Dec 8, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":116698326,"AreaId":105911816,"UserId":200181148,"UserName":"Robin Parker","CommentBody":"Old thread but maybe someone will see this... Is Sandstone Warrior worth picking up if I’m mostly looking to boulder at Holy Boulders? I know that area specifically doesn’t have its own guidebook","CommentTime":"Apr 6, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":116700742,"AreaId":105911816,"UserId":112519290,"UserName":"Jacob Luciani","CommentBody":"Holy Boulders is only mentioned in Sandstone Warrior as being closed at the time of publication. That being said, there are a bunch of other areas listed in SW to make up for it, including a few in the vicinity of the Holies. For example, coming from St. Louis you've actually got a shorter drive to The Beach and The Graveyard, both of which have more complete info in the guidebook.","CommentTime":"Apr 6, 2019","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":106070682,"AreaId":106017458,"UserId":105943577,"UserName":"Ladd Raine","CommentBody":"Dr. Topo guidebook","CommentTime":"Nov 28, 2007","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106176941,"AreaId":106017458,"UserId":105841087,"UserName":"Christian Lenn","CommentBody":"Vertical Heartland,Eric Ulner The comprehensive guidebook for southern illinois","CommentTime":"Jun 4, 2008","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106362250,"AreaId":106017458,"UserId":105966977,"UserName":"chris tregge","CommentBody":"The Dr. Topo guide says turn right on Glenn Falls Road, which apparently has been renamed Street Road. The rest is accurate. 12/2015: sadly the Dr. Topo guide is no longer available, PM me if you would like a copy","CommentTime":"Feb 22, 2009","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106373325,"AreaId":106017458,"UserId":106369527,"UserName":"Dave Pool","CommentBody":"I don't know how to add the lat/long stuff to this post but these are the coordinates according to Google Earth: 37°29'40\"N 88°39'55\"W","CommentTime":"Mar 10, 2009","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106418383,"AreaId":106017458,"UserId":106053296,"UserName":"Bob Kryzer","CommentBody":"The most beautiful climbing area I have ever been to. Large amounts of rock and amazing routes!","CommentTime":"Apr 29, 2009","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106985120,"AreaId":106017458,"UserId":105966977,"UserName":"chris tregge","CommentBody":"A lot of the routes posted for Jackson Falls contain sparse info. If you post something better or more descriptive, or have any FA info, etc, post a comment under the route and I'll fix it. Thanks.","CommentTime":"Dec 11, 2010","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107008371,"AreaId":106017458,"UserId":106280199,"UserName":"JBroom","CommentBody":"Beautiful area! No matter how many destinations I go to Jackson will always be a favorite of mine. Amazing sandstone sport climbing, free camping and you can have the place pretty much to yourself during the week!","CommentTime":"Jan 12, 2011","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107163895,"AreaId":106017458,"UserId":107132942,"UserName":"Chicagio","CommentBody":"Sorry to double post but this didn't seem appropriate for a condition report. After an intense day of climbing this campground was about 25 minutes away and had hot showers for $3 a person. They also sell ice and firewood. maps.google.com/maps?f=q&so…","CommentTime":"Jun 6, 2011","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107343410,"AreaId":106017458,"UserId":106550044,"UserName":"Juggler Jones","CommentBody":"Looking to see if anyone want to fly(in a plane) down with me for the wknd. to Jackson Falls leaving Friday(10/28) AM and returning Sun. Aft? LMK and I will send you the cost sharing details. Flying makes a 6 hr drive a 2 hour flight. LMK right away- Thanks","CommentTime":"Oct 25, 2011","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107693611,"AreaId":106017458,"UserId":107038511,"UserName":"Ted Peterson","CommentBody":"MP is great for new routes and getting the lay of the land, but if you are going to be spending some time at the Falls, might as well buy the guidebook and support the local climbing community. Vertical Heartland, 3rd edition. Order online, from Eric, or pick it up at Shawnee Trails in Carbondale. FYI, there are many new sport routes not in the guidebook, so perhaps MP is great as an addendum.","CommentTime":"Jul 8, 2012","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":109016994,"AreaId":106017458,"UserId":109016992,"UserName":"Collin Carlier","CommentBody":"I'm going to be camping around this area the weekend of 5/31/14 and am looking for someone willing to loan a rope. I would gladly pay a rental fee. Just message me here in the comments. Thanks!","CommentTime":"May 25, 2014","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":109061986,"AreaId":106017458,"UserId":107372778,"UserName":"Grey Satterfield","CommentBody":"How does the rock hold up after the rain? Will moist holds break off? I want to climb here this weekend but the weather looks threatening.","CommentTime":"Jun 4, 2014","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":109093522,"AreaId":106017458,"UserId":106045790,"UserName":"Dreez","CommentBody":"We tried to climb when it was moist and not possible. All the holds have buckets of water and moss and fungus in them. You have to let it dry out for a couple days. We camped at: plus.google.com/11099173902… Cedar Lake Campground for 2 nights $15/night. Wifi, electricity, showers, super friendly people. Showers need to be cleaned and redone but usable. But this is about 5 miles from JF.","CommentTime":"Jun 12, 2014","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":110624313,"AreaId":106017458,"UserId":110624289,"UserName":"Matt Hodges","CommentBody":"Jackson Falls just became our local crag and I'm looking for more partners! My wife and I currently go out about once a week. We mostly climb moderates and I'm starting to get back on harder stuff. If you are around let's climb! PS: Anyone know where to pick up a guide book? The topo is super outdated.","CommentTime":"Jun 16, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":110632475,"AreaId":106017458,"UserId":110632441,"UserName":"Travis Crane","CommentBody":"Matt Hodges, my friend Yusuf actually just created a brand new guidebook for Jacskon Falls. It's completely updated with great route support. Here's the link: brayackmedia.com/jfalls/jfa… Also, I have a friend and his wife who want to start climbing at JF but have never climbed outdoors before. They're planning on going this weekend. If you're willing to help them get up and going I'm sure they'd love the company. PM me if you'd like their info.","CommentTime":"Jun 18, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":110790794,"AreaId":106017458,"UserId":109744782,"UserName":"Max Cody","CommentBody":"Does anyone know the story on the large blocks that look to have been pushed into the stream at the top of the waterfall next to the dog walk? Some reason behind it? Or just assholes being assholes? That spot was always so nice. Now between that and the big tree that fell, it looks fucked up.","CommentTime":"Jul 23, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":110997152,"AreaId":106017458,"UserId":107622637,"UserName":"Justin Meyer","CommentBody":"The bolt hangers at the top of the route next to the north waterfall were wrapped in tape (so people could rap in on them) so I added quick links 9/7/15. Hope this is ok. I didn't have a wrench and won't be back to the area any time soon so if someone else could crank them down I would appreciate it. Anyone know the name of that route?","CommentTime":"Sep 8, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":110998977,"AreaId":106017458,"UserId":107201250,"UserName":"J.Kruse","CommentBody":"Justin Meyer, name of the route is Lovin Lizards","CommentTime":"Sep 8, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":110999481,"AreaId":106017458,"UserId":105966977,"UserName":"chris tregge","CommentBody":"Comments from user Justin Meyer: See maps at mountainproject.com/v/10675… and mountainproject.com/v/10835… for parking, camping, and access points to the canyon. There is free primitive camping available at the main parking lot as well as on the side of the dirt road after crossing the creek. There are poison ivy and ground bees throughout the forest including near camping areas, next to trails and next to climbing routes. Be able to identify poison ivy and avoid it. A great place to cool off after climbing in hot weather is in Bell Smith Springs fs.usda.gov/recarea/shawnee/re... just a few miles away. The water is tinted but relatively clean and cool. If cliff jumping be careful as the water is not consistently deep and may hide rocks or logs. Follow an experienced local.","CommentTime":"Sep 8, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":111705954,"AreaId":106017458,"UserId":107821162,"UserName":"Eli Primmer","CommentBody":"Went here for the first time last weekend. I would recommend driving an suv on the road there. I would also recommend just doing the primitive camping at Jackson Falls. Definitely a sweet place!","CommentTime":"Mar 18, 2016","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":112441033,"AreaId":106017458,"UserId":108626486,"UserName":"mike varlotta","CommentBody":"I have the month of July to climb around the midwest. Our goal is to climb in as many states as possible. We will be climbing from OH & MI down through IN, IL and all the rest to OK and possibly TX and AR. I know that it's not a great month to be climbing in those parts, but it's when i have the time off so I'm going to have to make due. I've heard Jackson Falls is probably the best of IL climbing. If we are strategic in how we chase shade, can I hope to get a decent sampling of the place? Just as important, are there any other destinations in IL (or any of the neighboring states) that are go to places when the temps and humidity are high? Any other beta about destinations in the region not to be missed would be greatly appreciated. Thanks!","CommentTime":"Jan 13, 2017","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114290712,"AreaId":106017458,"UserId":200174046,"UserName":"Danny Andrews","CommentBody":"What's the anchor situation like here? Are there a lot of sport clips, or mainly rap rings? Gotta figure out if I should teach my girlfriend how to clean anchors before we head out there this weekend.","CommentTime":"Apr 23, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":116999094,"AreaId":106017458,"UserId":200351523,"UserName":"Daniel Ruzich","CommentBody":"Has anyone been within the last two weeks or so? How is the tick situation? Pretty buggy overall?","CommentTime":"May 20, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118961464,"AreaId":106017458,"UserId":109230058,"UserName":"Aidan Zuber","CommentBody":"There are a few hard trad lines past the graduation area. Don’t forget the micros.","CommentTime":"May 31, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":119036377,"AreaId":106017458,"UserId":108225547,"UserName":"Shane Kenyon","CommentBody":"Looking for a partner/partners Tue/Wed this coming week. I have one 60 and a full (trad) rack. Comfortable to lead trad up to 5.6 (ADK sandbag grade) and sport to 5.9. Happy to meet at the trailhead in the morning. PM me.","CommentTime":"Jun 14, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120281738,"AreaId":106017458,"UserId":201032312,"UserName":"Craig Shawman","CommentBody":"One of the finest areas for trekking.","CommentTime":"Feb 9, 2021","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120295494,"AreaId":106017458,"UserId":201034992,"UserName":"Kent Brunner","CommentBody":"What a beautiful place to hangout.","CommentTime":"Feb 14, 2021","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120369066,"AreaId":106017458,"UserId":201049423,"UserName":"Zoie Hamby","CommentBody":"Going to boulder here next week! Which guidebook is the best for bouldering? Does the Sandstone Warrior cover the following areas? A. North Canyon Yosemite Slab G. Big Star Boulders Can't find a copy online that will let me peek inside the book...","CommentTime":"Mar 8, 2021","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":108425545,"AreaId":108116766,"UserId":108425517,"UserName":"Lucas Chisausky","CommentBody":"Hey I am just wondering if there is primitive camping in the holy boulders area, and if not where the closest camping would be?","CommentTime":"Nov 6, 2013","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":110036006,"AreaId":108116766,"UserId":108084510,"UserName":"JD Borgeson","CommentBody":"Best camping we found was at Murphysboro lake. we tried out devils backbone, but it was kind of sketchy. also read about a place called turkey bayou (?), but didn't check it out.","CommentTime":"Feb 5, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":110778232,"AreaId":108116766,"UserId":109744782,"UserName":"Max Cody","CommentBody":"Anyone have beta for the trad lines here?","CommentTime":"Jul 20, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":111096106,"AreaId":108116766,"UserId":108351531,"UserName":"Dylan Pike","CommentBody":"I know of three traditional lines. From the large roof at the cliffline, head to the climber's right. You will see an offwidth, which I haven't climbed. If you continue (maybe 50 yards) you will come to a nice hand crack. I've climbed it a couple times. It probably goes at 5.7 If you head back the other way, pass the roof, and stop across from the shadow of a man area, you will see another roof with a fist crack leading up to it. Climb the crack to the roof, crawl to the left and finish in a slot. This line is pretty tame (5.6?) The cliff is pretty short (40ft). Plan on bringing slings if you want to set up a toprope. You can scramble up to the top of the cliff, so no need to rap.","CommentTime":"Sep 30, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":111096665,"AreaId":108116766,"UserId":109744782,"UserName":"Max Cody","CommentBody":"Thanks a bunch! I'm going to head out there in a few hours and try 'em out.","CommentTime":"Sep 30, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":111781260,"AreaId":108116766,"UserId":111781256,"UserName":"Daniel Arnold","CommentBody":"Has there been a guidebook released yet for holy boulders? If not, are there any downloadable topos or other info anybody knows of?","CommentTime":"Apr 15, 2016","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":112153311,"AreaId":108116766,"UserId":111428715,"UserName":"Chris Arnold","CommentBody":"Recently picked up a crashpad and will be heading out here a bit from the St. Louis area if anyone is interested this season. Daniel, there is no guidebook as of yet. I assume they will make a killer one soon enough because there are millions of routes out there. There are some good guides on here actually, if you look through the photos on here, there are two \"BETA photo: from comp 2014\" that actually help a ton in locating routes. Plus I'd download Mountain Project on your phone and download the photos before you go out there. You can use it offline and locate routes that way as well.","CommentTime":"Sep 15, 2016","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":112185427,"AreaId":108116766,"UserId":108175999,"UserName":"Cfresh","CommentBody":"Hey guys and gals I finally got a chance to make it down to the holy last weekend and had a blast thanks for having me had a hard time figuring out where I was at first but eventually figured it out just wondering if someone could tell me which claims these were a couple I really dug Any one know which climb this is Which climb is this one? It had a giant hole in the face","CommentTime":"Sep 27, 2016","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":112211072,"AreaId":108116766,"UserId":112211049,"UserName":"Jeremy Meyer","CommentBody":"Chris, I'm going down this weekend from st. louis, I don't have a crash pad/ could use a partner. I'm just starting out so like v2/ v3's but I'm from that area so I know it well.","CommentTime":"Oct 7, 2016","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":112306993,"AreaId":108116766,"UserId":110095505,"UserName":"Climbsoill","CommentBody":"Pine Hills Campground is close and pretty nice. fs.usda.gov/recarea/shawnee…","CommentTime":"Nov 10, 2016","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114026036,"AreaId":108116766,"UserId":200198617,"UserName":"James Burnes","CommentBody":"Turkey Bayou campground is close by, at the end of the Oakwood Bottoms road. It's on Forest service land, but is totally kept open and managed by a local group. Quiet, nice pond, clean, close to the river. There is a donation box. Primitive camping.","CommentTime":"Jan 20, 2018","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":114222115,"AreaId":108116766,"UserId":112225989,"UserName":"James Haydock","CommentBody":"I put together a list of beta videos for my gumby friends. Figured it would be relevant here> docs.google.com/document/d/…","CommentTime":"Apr 3, 2018","BetaVotes":8,"AdditionalInfo":null}
{"CommentId":118636474,"AreaId":108116766,"UserId":200701390,"UserName":"Randy Dray","CommentBody":"I stayed at the Murphysboro Campsite on 3/8 and it was very clean. I would recommend it. It is located about 28 minutes from the Holy Boulders.","CommentTime":"Mar 10, 2020","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":118639908,"AreaId":108116766,"UserId":106709875,"UserName":"Christian Prellwitz","CommentBody":"How quickly do the boulders dry out after a rain? (I guess this also includes the consideration of how long you should wait to climb after a rain, given that the rock is sandstone.) Any info would be appreciated. Thanks!","CommentTime":"Mar 11, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118641512,"AreaId":108116766,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"Hey Christian, The Holy Boulders dry out very quickly. If it rained the day before, then should dry out overnight, especially if it’s windy. Now obviously everything won’t be dry, but enough problems will be dry to make a good session out of it.","CommentTime":"Mar 11, 2020","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":120397993,"AreaId":108116766,"UserId":200106666,"UserName":"Sam Hoffman","CommentBody":"Anyone know why it's called Holy Boulders?","CommentTime":"Mar 16, 2021","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107887318,"AreaId":107014884,"UserId":107234104,"UserName":"AKSClimbs","CommentBody":"There is no \"trail\" down the hill after the atv trail. I would just recommend following the atv trail all the way until it butts up against the river. I ran into a hunter while walking down the atv trail and he doesn't care as long as you stay on the trail.","CommentTime":"Nov 13, 2012","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":109250235,"AreaId":107014884,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"youtube.com/watch?v=Cq-QnBf… Some fine beach bouldering","CommentTime":"Jul 20, 2014","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":109250466,"AreaId":107014884,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"youtube.com/watch?v=uODdsX6… More Beach bouldering","CommentTime":"Jul 20, 2014","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":111321550,"AreaId":107014884,"UserId":111321539,"UserName":"Sarah1514","CommentBody":"Can anyone give directions to get here? Or an address to somewhere nearby?","CommentTime":"Nov 18, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":111630855,"AreaId":107014884,"UserId":107234104,"UserName":"AKSClimbs","CommentBody":"Good article for info on the Beach. terrain-mag.com/climbing-th…","CommentTime":"Feb 18, 2016","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":114547857,"AreaId":114335250,"UserId":111901865,"UserName":"Mikeyy Blisz","CommentBody":"There are quite a few things but be careful","CommentTime":"Jul 3, 2018","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":109261119,"AreaId":107286103,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"youtube.com/watch?v=lRCdCak…","CommentTime":"Jul 22, 2014","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120183902,"AreaId":107286103,"UserId":107234104,"UserName":"AKSClimbs","CommentBody":"This area could and should have endless roof problems established. Just overhang after overhang.","CommentTime":"Jan 12, 2021","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":109363795,"AreaId":106226290,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"vimeo.com/15494863","CommentTime":"Aug 17, 2014","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":106259503,"AreaId":112875162,"UserId":10363,"UserName":"Ben Bruestle","CommentBody":"Park at the \"Vertical Heartland\" parking lot and make sure to register. The approach is about 10 minutes. Camping is available just a little further down Lick Creek Road at Twin Bluffs Bed n' Breakfast. The proprietors Neil and Laurie will let you camp in their field for a nominal donation. They also have a bunkhouse with fireplace for winter climbers.","CommentTime":"Sep 21, 2008","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106310880,"AreaId":112875162,"UserId":106310306,"UserName":"Courtney Coe","CommentBody":"Directions are a little difficult to follow....it's exit #36 from I-57, and when you head east, you go for about 2.4 miles and the parking area and trailhead are on the left, not the right. There's a sign there that says \"Vertical Heartland.\" It's an awesome place, but none of the climbs are marked, so try to find a guide book if you can!!","CommentTime":"Nov 26, 2008","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106435862,"AreaId":112875162,"UserId":106340071,"UserName":"KEN tucky","CommentBody":"With the new changes in illinois state laws this area has closed. Info @ rockclimbing.com/cgi-bin/fo…;page=unread#unread","CommentTime":"May 19, 2009","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106441000,"AreaId":112875162,"UserId":105841087,"UserName":"Christian Lenn","CommentBody":"Draper's Bluff is now closed to all public use. Apparently a change in the Illinois public or Recreational use statute exposed the owners to unconscionable liability(prohibited non climbers also caused some unexplained risks to the climbers) this is a tragic situation. the Ulners(property owners) actively supported climbing at their crag which I felt was unique for SoIll.(instead of climbing down in a hollow the upper part of the cliff was exposed and offered fabulous panoramic views. I am sorry to report this.","CommentTime":"May 25, 2009","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106455757,"AreaId":112875162,"UserId":106385627,"UserName":"Corey Morris","CommentBody":"This truly is a crying shame.","CommentTime":"Jun 8, 2009","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106722662,"AreaId":112875162,"UserId":106633965,"UserName":"Glbj","CommentBody":"W.T.F.","CommentTime":"Apr 7, 2010","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106754954,"AreaId":112875162,"UserId":106079052,"UserName":"J Evans","CommentBody":"The Illinois Climbers Association (ICA) needs your help to get Drapers reopened. The Illinois General Assembly has a bill in the house to reestablish protection for private property owners (the Ulners'). Please, whether you live in Illinois or are out of state, visit the ICA's website ilclimbers.org for more information. Also, the Access Fund has an Action Alert the simplifies the process of contacting the Representatives in Illinois, accessfund.org/action.","CommentTime":"May 6, 2010","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107648493,"AreaId":112875162,"UserId":106030894,"UserName":"Brian Aitken","CommentBody":"I'm trying to find out the names of some climbs here... maybe someone has a history book they can tap into since it looks like the State killed climbing here. 1. 'Unknown Sport #2' 5.6: walk up to base of cliff, walk right, short bolted route in right facing corner. 2. 'Unknown Slabby Sport #1' 5.7: Just before right facing corner mentioned above. Bolted. 3. 'Unknown Easy Dyno' 5.6: walk up to base of cliff, walk left to buggy bolted route with small mantle towards top. Dyno up and right to the mantle for extra fun points. I climbed here back in 2003. Sad to see it closed. If anyone knows if there are other accepted names for these routes please let me know. Hope to see the area open again, soon.","CommentTime":"Jun 9, 2012","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107867789,"AreaId":112875162,"UserId":107867781,"UserName":"Chris Smudde","CommentBody":"The southern face is available for climbing through Vertical Heartland. There's a website. I took a Boy Scout troop there last weekend and we all had a great time. Fantastic setting and view from the bluff.","CommentTime":"Oct 31, 2012","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114639992,"AreaId":110019237,"UserId":111690225,"UserName":"Taylor Gemperline","CommentBody":"Does the waterfall often run year round, and has anyone had the pleasure of rapping it for a fun cool down in the summer?","CommentTime":"Jul 23, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107843536,"AreaId":106612569,"UserId":106511729,"UserName":"roger fritz from rockford, IL","CommentBody":"We took a side trip from jackson falls to Giant city shelter one climbing area. There are some fine lines there. Why has no-one posted these? Are you locals keeping them secret? Come-on share them with us!!!","CommentTime":"Oct 15, 2012","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":119114384,"AreaId":106612569,"UserId":200631412,"UserName":"SAR Chasm","CommentBody":"I have not climbed there since 1978 but it was my first exposure to rock crags.","CommentTime":"Jun 27, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":110024210,"AreaId":110009688,"UserId":110024194,"UserName":"Jolyn","CommentBody":"There are four canyons available for climbing at Starved Rock State Park. They are Wildcat Canyon, Tonti Canyon, La Salle Canyon, and Ottawa Canyon. For more information contact park staff at 815-667-4726.","CommentTime":"Feb 2, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118283556,"AreaId":110009688,"UserId":106550044,"UserName":"Juggler Jones","CommentBody":"NOTE: Tonti Canyon is NOW closed to access...","CommentTime":"Jan 26, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118087389,"AreaId":118064939,"UserId":200522248,"UserName":"Connor Petersen","CommentBody":"I recently explored past blue elephant and found that this park is twice as big as whats posted on this page! There is so much rock. 95% of it is unclimbable choss, but that 5% is solid. Much potential. If anyone wants to come put up some FA's w me, send a message my way. I'm steady lookin' for more people to climb here with.","CommentTime":"Nov 24, 2019","BetaVotes":2,"AdditionalInfo":null}
{"CommentId":118092832,"AreaId":118064939,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"Connor Petersen, add the new boulders/walls as a sub area. Name it whatever you want. This page needs to stay organized for anyone who goes to climb there. If you have found multiple boulders/walls, then add them as separate sub areas. Thanks!","CommentTime":"Nov 25, 2019","BetaVotes":3,"AdditionalInfo":null}
{"CommentId":118112395,"AreaId":118064939,"UserId":200433862,"UserName":"Sean Koala","CommentBody":"Connor, glad you found the \"Blue Elephant\" and starting finding routes on it. I'm assuming you are one of the guys me and my GF ran into that day. Msg me when you plan on coming back out and I'll try and meet you out there!","CommentTime":"Dec 1, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118112398,"AreaId":118064939,"UserId":200433862,"UserName":"Sean Koala","CommentBody":"Also Connor, how bad has the area around Blue elephant regrow? I know we hadn't finished clearing the brush and small trees, but was it at least manage up there?","CommentTime":"Dec 1, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118115520,"AreaId":118064939,"UserId":200522248,"UserName":"Connor Petersen","CommentBody":"Yes Sean, it was manageable. Some of the mossy rock just needs a scrub. I'm usually available Monday - Wed. Next time there's no rain for a few days prior I'll be out there. Ill shoot you a message.","CommentTime":"Dec 2, 2019","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":119632408,"AreaId":118064939,"UserId":200265626,"UserName":"Brandon White","CommentBody":"The derecho brought down a bunch of trees on the approach slope. Sort of an obstacle course to get between solid bands of rock.","CommentTime":"Sep 27, 2020","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":119662411,"AreaId":118064939,"UserId":200933203,"UserName":"Andy Lane","CommentBody":"Is it legal to climb here? I have been near this area in the past to go hiking (Starved Rock and Matthiessen State Park) and I remember seeing signs posted that prohibits climbing.","CommentTime":"Oct 2, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":119667424,"AreaId":118064939,"UserId":107234104,"UserName":"AKSClimbs","CommentBody":"It isn't in either of those parks. Once climbing here in the early days, I spoke with a local cop and he said it was fine to climb.","CommentTime":"Oct 3, 2020","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":120698039,"AreaId":118064939,"UserId":201001562,"UserName":"Zach Taylor","CommentBody":"youtu.be/9MhKSoxBFQY Video of our trip to Oglesby in the early spring. We also had a run in with law enforcement while leaving, they we much more concerned about our out of state plates than the fact that we were climbing","CommentTime":"May 12, 2021","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":111781839,"AreaId":110006134,"UserId":109717839,"UserName":"Wellssllew","CommentBody":"vimeo.com/163045552","CommentTime":"Apr 15, 2016","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":115178200,"AreaId":114405527,"UserId":107234104,"UserName":"AKSClimbs","CommentBody":"Use to boulder here off and on when visiting my parents in the area. Not sure about the grades, but I know the quality was pretty muddy. I'll be around in September and if people are putting up new stuff, would love to meet up and check it out! With all of that said, I think there are other small patches like this around Peoria and would love to build a community to start hunting around.","CommentTime":"Sep 8, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118028505,"AreaId":114405527,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"Was here on Saturday. I feel this place has some serious potential. It will just take some dedicated folks to first get permission, and second develop the bouldering. Look the obvious is that the area has been sprayed with graffiti, and there is some loose rock. But so many other areas have been plagued with the same issues. Get some wire brushes, Elephant Snot (for removing Graffiti), and some trail building tools and im certain something worthwhile can be made of this area.","CommentTime":"Nov 11, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":112280752,"AreaId":112240918,"UserId":107234104,"UserName":"AKSClimbs","CommentBody":"Any bouldering?","CommentTime":"Nov 1, 2016","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":112303208,"AreaId":112240918,"UserId":106071383,"UserName":"Woodchuck ATC","CommentBody":"Looking forward to exploring this new place on dedication date Nov.21st. Hope to get some pics of various routes, and hope to find a printout list at park office of these said new bolted routes too.","CommentTime":"Nov 8, 2016","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":112463129,"AreaId":112240918,"UserId":106234044,"UserName":"Bill McKirgan","CommentBody":"The hike in from the Great River Road parking areas is easy, but close to traffic so be alert and look out for each other. Once you are inside the gate the path is wide enough for one way traffic in a car! The picnic area is very nice and the trails are very well built.","CommentTime":"Jan 25, 2017","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":112503478,"AreaId":112240918,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"Hey Tyler, Im doing my best to stay on top of the route database. Thanks for giving me an extra kick. As for the routes you say you \"ticked\" not sure what your talking about. everything in the \"Meadow Slab\" area is up and online, and as for a route with a bouldery start left of Ring Neck, those are all up to. Now we have added about 10 more routes recently, and you will see them up this upcoming week","CommentTime":"Feb 19, 2017","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":112518976,"AreaId":112240918,"UserId":112518973,"UserName":"Zee DreamLife","CommentBody":"Lived here my whole life and without any climbing in this area, I literally moved to California for climbing opportunities. Just came back last week and went out today for a hike with a friend and noticed the anchors and bolts and we just looked at each other and smiled like kids with cake. This is epic! Definitely will be climbing here on a regular basis. So glad to see we are FINALLY getting some legit climbing out here! So Stoked! Would love to join the team making this all happen!","CommentTime":"Feb 26, 2017","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":112519405,"AreaId":112240918,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"Follow the Illinois Climbers Association on Facebook and check the website to stay up to date.","CommentTime":"Feb 27, 2017","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":112803545,"AreaId":112240918,"UserId":200035038,"UserName":"Ed Henry","CommentBody":"I would like to post a suggestion and a warning about the parking area after my last few climbing trips to Pere Marquette. First, please don't park parallel to the highway at the gravel pull-off parking area. Many more cars (and thus, climbers!) will be able to safely get to the crag if we park perpendicular to the road in this area. Second, when my crew and I were there this past weekend we noticed two pieces of gnarly metal poking out of the ground, right next to each other, in the center of the parking area. Beware! This stuff will surely cause a flat tire eventually. I should be going back to the bluffs in the next week or two and I'll take a sledge hammer to flatten this stuff. If someone gets there first and fixes this problem please post about it. Oh! Hats off to the trail crew and the recent work they have done. Amazing!","CommentTime":"Apr 6, 2017","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114113493,"AreaId":112240918,"UserId":200197629,"UserName":"Tim King","CommentBody":"I’m headed down to climb end of March, Any recommendations on places to stay? We usually camp but we will only be there for the weekend and since its still March and weather may be schechy a hotel with a pool wouldn’t suck. Thanks!","CommentTime":"Feb 25, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114114375,"AreaId":112240918,"UserId":111859956,"UserName":"Pokey819","CommentBody":"There is nothing really close that i'm aware of with a pool other than the Pere Marquette Lodge itself. I stayed there a long time ago and it was nice, but can't speak for now.","CommentTime":"Feb 26, 2018","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":114117766,"AreaId":112240918,"UserId":112350123,"UserName":"Patrick R","CommentBody":"The lodge is nice, there are also a few places to stay in Grafton but probably no pool. Closest chain hotel with a pool would be in Alton, figure 20-30 minute drive depending on where you stay.","CommentTime":"Feb 27, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114185903,"AreaId":112240918,"UserId":200197629,"UserName":"Tim King","CommentBody":"Thanks for the comments. We ended up renting a cabin at the SP campground for a night, It was clean and super convienant. Spent the second night at the Fairfield inn in Pontoon beach, Also super new and clean. Great hot tub and pool. Climbing area was perfect for the first trip of our season. Thanks ICA for all the efforts here.","CommentTime":"Mar 24, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114278627,"AreaId":112240918,"UserId":200253075,"UserName":"Nicholas Carroll","CommentBody":"Any sport multi pitch? Seems like there are a few trad and a few trad+bolted, and the pitches are in the description, but these aren't categorized as multipitch in the route finder on MP. I don't have trad gear yet, so can anything be multi pitched with just draws and a few cordalette?","CommentTime":"Apr 20, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":115790123,"AreaId":112240918,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"Notice to the Public: Just as a heads up, every fall different species of wasps tend to congregate around the “crack climbs” found in the park. It’s been that way ever since we began developing in 2014. They always seemed to be docile and myself nor any other developer was ever stung. But I recommend treading carefully. The wasps tend to hang out only for a few weeks, then go away. All sport climbs seem to be left alone, so have fun on them during early fall.","CommentTime":"Oct 31, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":116580233,"AreaId":112240918,"UserId":112519290,"UserName":"Jacob Luciani","CommentBody":"Heya, I'm wondering if the bouldering on the far end of the are is open for exploration. I know the description says no development without approval, and I wanted to know if that's just the sport climbing or if it includes bouldering as well. Thanks to everyone who put in time to put this place on the map!","CommentTime":"Mar 4, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":116582017,"AreaId":112240918,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"Hey Jacob. Only Route Development (in specific, bolt placing) required the ICA. Get after the boulders!","CommentTime":"Mar 5, 2019","BetaVotes":3,"AdditionalInfo":null}
{"CommentId":116745283,"AreaId":112240918,"UserId":200261674,"UserName":"Anthony _","CommentBody":"Does anyone know if the climbing area is still accessible with the road being flooded? Can you come in through the back?","CommentTime":"Apr 16, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":116831319,"AreaId":112240918,"UserId":200261674,"UserName":"Anthony _","CommentBody":"Its a little more than a mile from the horse parking lot off of Graham Hollow Rd. You have to wade through knee deep water for about 100 feet to continue on the trail. We didnt know that going in and bush whacked 3.5 miles through the woods. Don’t do that.","CommentTime":"May 5, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118164508,"AreaId":112240918,"UserId":7040235,"UserName":"Paul Winfield","CommentBody":"Is a 40m (130ft) rope long enough to lower off most of the walls? From the pictures looks like most routes are less than 60ft tall, but can’t tell for sure. Thanks!","CommentTime":"Dec 20, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118876995,"AreaId":112240918,"UserId":200759844,"UserName":"Kyla Ritnour","CommentBody":"Can anyone assist with gps coordinates or directions? A road or trail to look out for? Would love try out some routes, but cannot find this info. - a directionally challenged gal","CommentTime":"May 15, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118878636,"AreaId":112240918,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"Kyla Ritnour and anyone else needing more info. To access the climbing area, type the gps coordinates (in the exact same format) into your phone/gps. The GPS Coordinates are (38.969548, -90.488101)","CommentTime":"May 16, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":119052991,"AreaId":112240918,"UserId":200279734,"UserName":"Joe Ernest","CommentBody":"This is a great area to climb and fairly unique for the area since it is a limestone crag. It amazes me sometimes how few of my friends have climbed on limestone yet. The area is full of moderate climbs both sport and trad and is super easy to get to. Definitely worth the trip if you are in the area. I did an episode of my Climbing YouTube channel about a year ago covering a trip there. It answers some of the questions that have been asked recently by other users so I thought I would post it here. Also shows a few of the climbs so you can get an idea what its like. Check it out and I hope its helpful to some people. youtu.be/s_BZjTQUjR4","CommentTime":"Jun 16, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":119081436,"AreaId":112240918,"UserId":200582006,"UserName":"Ben Silver","CommentBody":"Any beta on how long the rock takes to dry out after rain? Any good crags to hit day after?","CommentTime":"Jun 21, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120006942,"AreaId":119978970,"UserId":200655412,"UserName":"k zega","CommentBody":"Glad you are having fun out in the woods, Ross! We call this area the \"Pomona Bottoms.\" A decent amount of problems were climbed here a few years back, so you might want to touch base with Phillip C., Andy S., and Eric M. As you said, there is some great stone hidden away. Looks like you put up some fun stuff in the Shawnee Solitaire cluster!","CommentTime":"Nov 30, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120007000,"AreaId":119978970,"UserId":113584628,"UserName":"Ross Caputo","CommentBody":"k zega I figured y'all had climbed on a lot of this before. Logging areas like these will hopefully take some congestion away from the holies, but I seriously doubt it. Thanks for the info!!","CommentTime":"Nov 30, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120217567,"AreaId":116546100,"UserId":107234104,"UserName":"AKSClimbs","CommentBody":"Sad to see this area still doesn't get much traffic. With a little more love, it could be a gem.","CommentTime":"Jan 20, 2021","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107017146,"AreaId":107017143,"UserId":106280199,"UserName":"JBroom","CommentBody":"Youtube short featuring a few problems at the Roost youtube.com/watch?v=hry5Mth… Year of the Renegade FA by Jason Kehl youtube.com/watch?v=clHC03b…","CommentTime":"Jan 22, 2011","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107099186,"AreaId":107017143,"UserId":107099175,"UserName":"Forever V2","CommentBody":"Went down to the roost for the first time this past weekend. Some cool stuff up there. Took a little footage. Does anyone recognize this problem? Probably weighs in around a V2. vimeo.com/22234097","CommentTime":"Apr 12, 2011","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107099226,"AreaId":107017143,"UserId":106157684,"UserName":"sweatpants","CommentBody":"The roost is great! I'm not familiar with that problem though looks fun.","CommentTime":"Apr 12, 2011","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107099229,"AreaId":107017143,"UserId":106157684,"UserName":"sweatpants","CommentBody":"youtube.com/watch?v=KYgLQAZ…","CommentTime":"Apr 12, 2011","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107099232,"AreaId":107017143,"UserId":106157684,"UserName":"sweatpants","CommentBody":"youtube.com/watch?v=gmPKy0h…","CommentTime":"Apr 12, 2011","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107099233,"AreaId":107017143,"UserId":106157684,"UserName":"sweatpants","CommentBody":"youtube.com/watch?v=_615Erp…","CommentTime":"Apr 12, 2011","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107099238,"AreaId":107017143,"UserId":106157684,"UserName":"sweatpants","CommentBody":"youtube.com/watch?v=L3Ce7s0…","CommentTime":"Apr 12, 2011","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107099247,"AreaId":107017143,"UserId":106157684,"UserName":"sweatpants","CommentBody":"youtube.com/watch?v=Thd17TJ…","CommentTime":"Apr 12, 2011","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107099251,"AreaId":107017143,"UserId":106157684,"UserName":"sweatpants","CommentBody":"youtube.com/watch?v=EvgDkVu…","CommentTime":"Apr 12, 2011","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120301587,"AreaId":116192325,"UserId":201036194,"UserName":"Maggie Bearing","CommentBody":"Why is this area closed to the public?","CommentTime":"Feb 17, 2021","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120301630,"AreaId":116192325,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"Because it’s either private property or they don’t allow for climbing due to it being a natural area","CommentTime":"Feb 17, 2021","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107017119,"AreaId":106920435,"UserId":106280199,"UserName":"JBroom","CommentBody":"To find the Promised Land walk due west until you reach the railroad tracks. Once you reach the tracks head south down them until you see a cliff line on your right/west (maybe 1/2 mile). Stay on the tracks until the cliff line starts to recede further west away from you. As this happens watch for the \"marker boulder\" (a lone boulder sitting by itself in between the tracks and the cliff). As you see this watch for a foot path and take it. This will lead you to the boulder and then to the cliff. You are now in the Promise Land. The Promise Land has another 50 or so routes to add to the rest of the beautiful routes at Jackson Falls. The concentration of five star routes here is astonishing! Some of the best looking walls in the Midwest are here. There are a handful of easier routes but this area is best suited for the 5.12 climber. Because of the 30-40 minute approach and the tougher climbs this area can easily be a ghost town or have one maybe two other parties climbing on a busy weekend.","CommentTime":"Jan 21, 2011","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":118862451,"AreaId":116100052,"UserId":109007098,"UserName":"Alan Rader","CommentBody":"So it seems maybe the L>R listing on these routes is a little off, or some are missing. Pretty sure I did Procrastination. There was another route to the left of this one about 15 feet or so, but it was wet. Then to the right is supposed to be a 10c, then 12c, then the 5.8 trad, but there is only one bolted route between Procrastination and the Love trad route. Pics of Procrastination and the trad route look correct. \"Shrug\"","CommentTime":"May 12, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":111239523,"AreaId":106931770,"UserId":107734618,"UserName":"Jeff Edge","CommentBody":"This is called the \"Dynasty Wall\" in the new guidebook","CommentTime":"Oct 31, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106214260,"AreaId":106125042,"UserId":105934987,"UserName":"Remo","CommentBody":"A great place to climb in the dark.","CommentTime":"Jul 27, 2008","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":113141473,"AreaId":107017152,"UserId":106112509,"UserName":"Kris S","CommentBody":"Great place to escape the crowds.","CommentTime":"Jun 12, 2017","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106989377,"AreaId":106958063,"UserId":106653710,"UserName":"Jennifer Barton","CommentBody":"What is the bolted line farthest to the right - technically outside of the roof? Easy climb, but couldn't find info in the guidebook.","CommentTime":"Dec 16, 2010","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":107017180,"AreaId":106958063,"UserId":106280199,"UserName":"JBroom","CommentBody":"To reach the Rainy Day Roof walk down the dog walk and take a left (west) and walk down the cliff line for four or so minutes. This is the first large roof you will come to with four short sport routes surrounded by two gear routes. The climbs are almost always dry but are short and can be greasy from the condensation, footwork is helpful!","CommentTime":"Jan 22, 2011","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114318558,"AreaId":107090482,"UserId":200174046,"UserName":"Danny Andrews","CommentBody":"The order of these routes is wrong. For one thing, Monkey Shower, Katie Did, and Spank you very much are all adjacent and are on the Town Square boulder (I believe). I think a new sub-area should be added for the Town Square since it receives one in the guide book.","CommentTime":"Apr 30, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":108339955,"AreaId":108188747,"UserId":108339947,"UserName":"aubrey Joe","CommentBody":"Worthy new addition that needs traffic to help clean the routes. The routes get better as you go down the wall to the right.","CommentTime":"Sep 16, 2013","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":108188740,"AreaId":108112038,"UserId":107942247,"UserName":"J. Frizzell","CommentBody":"Original start traverses in from the right. Thomas completed the direct start at 11a","CommentTime":"Jun 11, 2013","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":111222115,"AreaId":108112038,"UserId":107734618,"UserName":"Jeff Edge","CommentBody":"routes here are mega-dirty right now, starting the routes requires some unconventional techniques. As such, this makes for an exciting day of adventure-sport climbing. Might become good routes with some traffic, but as for now the fact that you have to scrape the moss off the holds makes it a bit of a frustrating experience. Also spiderwebs, and pockets full of acorns. Interesting.","CommentTime":"Oct 27, 2015","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120080136,"AreaId":112464387,"UserId":111710269,"UserName":"Clay Thomas","CommentBody":"I am a bit confused by the directions to get to this boulder. So you cannot simply cross the powerline cut behind Red Sea, as indicated in the comp map here: imgur.com/SjDlixd ?","CommentTime":"Dec 17, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120055452,"AreaId":110027701,"UserId":110052690,"UserName":"befozz","CommentBody":"added some problems on the boulder behind atlas, they could all use a little traffic and they will be great. The dead tree hanging out over this boulder feels very solid but should probably be removed at some point.","CommentTime":"Dec 10, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":112519323,"AreaId":108312132,"UserId":112519290,"UserName":"Jacob Luciani","CommentBody":"There's a short but cool looking crimp line on the other side of the first boulder past the Mollusk, does anyone have any info on it?","CommentTime":"Feb 27, 2017","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":113866055,"AreaId":112510408,"UserId":109228346,"UserName":"Marshall King","CommentBody":"Cool climb, Hard to find. Hope this helps. Latitude 37.6191, Longitude -89.4134","CommentTime":"Nov 25, 2017","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":116226895,"AreaId":112296291,"UserId":111710269,"UserName":"Clay Thomas","CommentBody":"There's at least one gorgeous moderate highball here if you're into that!","CommentTime":"Dec 31, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":111495971,"AreaId":110006430,"UserId":107281528,"UserName":"MattH","CommentBody":"I thought this cave had some of the best bouldering in southern Illinois. The rock was bomber, the holds were comfortable, and the moves were fun and gymnastic. The rock felt like poured concrete. Maybe I'm spilling the beans on a local secret but I'm stumped as to why this place isn't packed. I'll admit I'm biased against the characteristic sandiness and 80-grit feel of most southeast sandstone, but this felt like someone stole a cave from magic wood and dumped it in SoIll (minus the polished holds from thousands of climbers). I've added route descriptions for the most obvious distinct lines.","CommentTime":"Jan 4, 2016","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":111750268,"AreaId":110006430,"UserId":111658068,"UserName":"Jerome Penner","CommentBody":"Was just here yesterday and I cannot believe there aren't more established problems in this area and maybe there are in a guidebook somewhere but nothing really online about it. The rock is comfortable and the landing area is mostly just soft dirt. There is a lot of potential here!","CommentTime":"Apr 4, 2016","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120163574,"AreaId":119859063,"UserId":200784047,"UserName":"Cal Romens","CommentBody":"Cool to see somebody put this up on MP. Bridges all along the trail offers easy climbing. I wrapped a 30ft piece of webbing around one of the main pillars and taught my buddies how to belay off a TR. My personal favorite bridge among the ones worth messing around on is the one coming off Lawrence Ave by the Montrose dog beach.","CommentTime":"Jan 7, 2021","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120163985,"AreaId":119859063,"UserId":200961049,"UserName":"Peter Dirks","CommentBody":"Cal, I started climbing on the southernmost bridge pretty late in the 2020 season but I'm definitely looking forward to trying out some of the other bridges this spring!","CommentTime":"Jan 7, 2021","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":116543175,"AreaId":116484487,"UserId":112519290,"UserName":"Jacob Luciani","CommentBody":"Classic Jemmy Wabb rig.","CommentTime":"Feb 18, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118078136,"AreaId":116484487,"UserId":200157079,"UserName":"Max DeSalvo","CommentBody":"What am I looking at","CommentTime":"Nov 22, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114622334,"AreaId":114583975,"UserId":200197629,"UserName":"Tim King","CommentBody":"Fun beginner climbing. Outdoors and free!","CommentTime":"Jul 23, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120441418,"AreaId":114583975,"UserId":200738021,"UserName":"kevin kubik","CommentBody":"Areil Wegrzyniak last i checked the parking area was blocked off. we had no problems parking on 87th at the barrier when I was teaching my girlfriend how to lead, set and clean. this just makes the approach about 5-10 minutes instead of the 100 foot walk described in the beta above. be careful of spinners. last year almost every route had at least one.","CommentTime":"Mar 26, 2021","BetaVotes":0,"AdditionalInfo":"Temporary Report"}
{"CommentId":116243124,"AreaId":116243066,"UserId":200128055,"UserName":"Conor Windels","CommentBody":"There is a V2/3 on the right corner of this boulder as well. Will get pictures up for that soon.","CommentTime":"Jan 5, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114106853,"AreaId":114073502,"UserId":111895157,"UserName":"David Suckstorff","CommentBody":"Did someone drill bolts into the railroad bridge? The description mentions sport climbing...","CommentTime":"Feb 22, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118716797,"AreaId":114073130,"UserId":200265626,"UserName":"Brandon White","CommentBody":"I guess this is a no-go nowadays. I set up a top rope solo on this today. Guess people saw me from Stearns Road and called the cops reporting a \"possible jumper\". A Kane County Sherriff's Department officer showed up like 20 minutes into my climbing and asked me to leave. He was nice about it at least.","CommentTime":"Mar 31, 2020","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":118716875,"AreaId":114073130,"UserId":200214283,"UserName":"Michael Ross","CommentBody":"As of 2020 a new no trespassing sign was placed at the bottom of the bridge. This was due to a kid falling off the iron part of the bridge. (Non Climbing Related) The other bridge is still open for business. Forest preserve may approach you, but once they figure out your not spray painting your golden.","CommentTime":"Mar 31, 2020","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":119412174,"AreaId":114564422,"UserId":200879985,"UserName":"Richard Litecki","CommentBody":"How exactly do i get there? Can I park my car at the park nearby and hike it up over there?","CommentTime":"Aug 19, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":119412896,"AreaId":114564422,"UserId":200197629,"UserName":"Tim King","CommentBody":"If you back out the map you can see the driveway on the south side of the road. You can pull right up to the pillars.","CommentTime":"Aug 19, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114356505,"AreaId":114335381,"UserId":111492936,"UserName":"Stephen Lander","CommentBody":"How can there be 4 star problems on a 5 foot boulder? I get that you're excited about real rock in the city but come on.","CommentTime":"May 11, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114503569,"AreaId":114335381,"UserId":111633381,"UserName":"Branden L","CommentBody":"Honestly, this is my first time trying to gauge something, so I don't know that it is. It's just my opinion, other people may come climb and give it a lower rating. Then that's that!","CommentTime":"Jun 20, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114503598,"AreaId":114335381,"UserId":108489578,"UserName":"Branden LaCour","CommentBody":"Actually after giving it some thought, I brought them all down a star because of it being a lowball. I guess it should be insane to get a 4 star.","CommentTime":"Jun 20, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118819722,"AreaId":114335381,"UserId":200346291,"UserName":"Conor Wellman","CommentBody":"Nothing super exciting but cool that there is a boulder in the city if you have nothing else to do","CommentTime":"May 2, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":109378205,"AreaId":109374035,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"youtube.com/watch?v=qdfBH0s…","CommentTime":"Aug 21, 2014","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":112167301,"AreaId":106612641,"UserId":105792806,"UserName":"Healyje","CommentBody":"It should be noted that almost none of these routes were originally ever led, nor did we ever have any intention or desire to lead them as we had plenty of other rock elsewhere for that purpose. A couple of easy ones were led, but the rest that saw leads were more one-time 'exhibition' leads and could just have easily been free solos at the time. In fact, the cliff originally saw way more free solos than gear leads. The challenge of leading these routes came way after the fact by decades and to some extent still remain more a high-end novelty. Another note is none of these routes were put up or climbed with chalk which isn't necessary and destroys the 'puzzle' aspect of figuring out these routes and make no mistake, the puzzle factor was half the fun of the place and just seeing the routes at all to do the FAs was as much a challenge as actually doing them. David Hug, the administrator here, has done a lot of these bold new leads and has amended the ratings here to reflect that. But please don't let the r/x ratings here dissuade you from climbing these routes - just TR them as they were originally done. In the process you may find that might not be as easy as your typical over-hung sport route as on TR you're either climbing or flying - there's no hanging to sort out the details. It should also be noted that all these Giant City routes represent the well-spring of the skills that went on to develop Drapers and Jackson Falls - if you ever get curious about where the developers of those areas cut their teeth then this is the place to come.","CommentTime":"Sep 20, 2016","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":116622513,"AreaId":106612641,"UserId":200343877,"UserName":"Jarrod Patrone","CommentBody":"How long does this bluff typically take to dry off after a rainstorm?","CommentTime":"Mar 18, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":116629455,"AreaId":106612641,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"Shelter 1 dries quickly after rainstorms, especially if the wind is blowing. A few routes will take longer to dry such as Dead Dog, but most dry quickly.","CommentTime":"Mar 20, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":117091567,"AreaId":106612641,"UserId":200472689,"UserName":"Jeff Sigho","CommentBody":"Healyje's comments really hit the nail on the head. I witnesses a few of those exhibition leads and since I was not ready physically, let alone mentally to solo at a very high level at the time, it was an intimidating sight. The regulars at Shelter 1 back in the 70s were a ton of fun - encouraging but with plenty of flack if you were having a high gravity day. I got started climbing in southern Illinois in the mid-60s but didn't really get into Shelter 1 until I was an undergrad at SIU-C in the mid-70's. Adam and Alan were particularly strong influences on me to get stronger and get bolder. Seeing Joe, Craig, Jim and others climb was an eye-opener. Less experienced climbers need to see just how much there is to learn and do.","CommentTime":"Jun 9, 2019","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120169399,"AreaId":110301384,"UserId":200383722,"UserName":"Devin .","CommentBody":"Does anyone have info on Sizzler? Duraflame and Southern Sizzler are obvious and easy to find, so it should’ve been simple to find Sizzler that is allegedly just to the left, but I saw nothing obvious for Sizzler. The only crimps currently in that area are definitely not sufficient for V8. Perhaps it has broken since the FA? Or was this ever even climbed in the first place? Perhaps Sizzler was just a placeholder name from someone who was just eyeballing a hypothetical line?","CommentTime":"Jan 9, 2021","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120169421,"AreaId":110301384,"UserId":200383722,"UserName":"Devin .","CommentBody":"Similar question regarding the “V12? project” Did someone just look at the blank belly of the middle of the roof and come up with a random number? Or was there something there that was seriously tried and discussed? Because the 20-something-foot wide swath of rock between Appleknocker and the maybe-broken-Sizzler doesn’t appear to have anything on it, certainly not anything that I would ever think could be V12. But if there is something there that was, or is, being seriously tried then I would be keen to know what line people are referring to trying.","CommentTime":"Jan 9, 2021","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":109363921,"AreaId":108562416,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"vimeo.com/95943825 Great beta video for the majority of problems in the Gill Roof. Video credit No ILL Bouldering","CommentTime":"Aug 17, 2014","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":115969227,"AreaId":108562416,"UserId":200383722,"UserName":"Devin .","CommentBody":"Was out at the Gill Roof last weekend and it seems like 2 pretty obvious link-ups exist but I don't see them listed on MP. The first is Sit starting as for Pinch Me but then traversing left along the base into the start of Devil on a Leash and then finishing as per DOAL. The second is almost the same, sit starting at Pinch Me, except then traversing past the start of DOAL until you get into the start of Leashless Angel and then finishing as per LA. I assume both have been done before, but I am curious if these link ups have distinct names, or if they are simply referred to as \"Pinch Me into Devil on a Leash\" and \"Pinch Me into Leashless Angel\" Anyone know?","CommentTime":"Nov 5, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":116198092,"AreaId":108562416,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"Devin, I am absolutely sure the link ups you speak of have been done. Some seriously strong climbers have literally done some of those problems one handed.","CommentTime":"Dec 19, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":119759669,"AreaId":116566932,"UserId":106550044,"UserName":"Juggler Jones","CommentBody":"Mixed climbing(dry tooling) now open f or 2020-21 season! chicagoicetower.com/","CommentTime":"Oct 17, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106659435,"AreaId":106656040,"UserId":106071383,"UserName":"Woodchuck ATC","CommentBody":"Ice climbing 'legally' began here in Feb, 1980. Many ice climbs were done before that on the sly I've been told. At the start, we had access to any kind of ice we could find, in numerous canyons. Due to changes in park regulations and removal of many key trails, staircases and bridges, all the other canyons are closed now to climbing. Only LaSalle, Ottowa, Tonti, Wildcat and French are left. Most have only one formation in the canyon. Hennepin, Kickapoo, Sac, Aurora, Pontiac, Lone Tree, Basswood Canyons are locations of other ice formations. Illinois Canyon is still closed to climbing, and had up to 6 ice formations there with names like Warbonnet, Chief Illiniwek, Indian Princess, the Arrow, etc. It was a popular destination until the trails and stairs were removed during the 'boardwalk' building phase the park went through in the late 90s. Water flow throughout the park seems to have changed much in the last 15 years, leaving us with much less ice than the winters of 70's-80's provided.","CommentTime":"Jan 25, 2010","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":106683341,"AreaId":106656040,"UserId":14152,"UserName":"Alex A","CommentBody":"Jack Gorby got the ball rolling for legal ice climbing in the park, in 1979, 80, had to carry a sigh saying ice climbing dangers, should only done with proper gear, and all climbs were legal, but Hennepin, then the Photographer's started to complain about the climber,s destroying the ice, so that's why, St Louis canyon was closed to climbing, the fattest ice in the park, twice as wide as Wild Cat, now it looks like we lost a lot more climbs, there's still skunk falls canyon, outside of the park, an a very short sport route, there, private property?","CommentTime":"Feb 25, 2010","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106684510,"AreaId":106656040,"UserId":106071383,"UserName":"Woodchuck ATC","CommentBody":"Yeah that sign was a trip. You hauled this thick wood sign; 'to inform others about the sport' we were told, along with like this huge angle iron 30 lb tripod to put it on. They had 2 sign-in locations then, and a sign at each one. If you came late enough for the day, you got out of the sign hauling duty. Often we would just take it and pitch it for the day under some snow in the woods, then pick it up on the way back to sign out at end of the day. We had ANY and ALL the ice we chose back then. Hennepin only required a team of 4 and knowledge of first aid. There were very few of us, fewer restrictions, and we climbed in fine style (wool knickers and such at times),,considering the crap tools available back then. Alot of smashed up knuckles with no curved tools, that's for sure.","CommentTime":"Feb 26, 2010","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106685675,"AreaId":106656040,"UserId":11156,"UserName":"Tradiban","CommentBody":"Really cool area and well worth the drive from Madison. Over the last two weeks I got a chance get on just about everything that was legal. It has been my impression that this has been a good year for ice here, we got on The Virgin which apparently rarely comes in and the right pillar at Ottawa Canyon, which is rare as well?","CommentTime":"Feb 28, 2010","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106687008,"AreaId":106656040,"UserId":106071383,"UserName":"Woodchuck ATC","CommentBody":"Yes, for some reason there is good ice this season. You never know how the flow will go for water runoff. I'm sure there are some other rare formations in too, but they are all illegal to climb these days. But since I'm seeing 8 or 10 sign-in's for 'Wildcat' yet only 4 bodies, I'm guessing there is some illegal access taking place unannounced. I envy them, but fear the consequences if someone gets caught. Kudos on the Virgin and the also rare Ottowa right side. Haven't seen that one since the 80's for sure.","CommentTime":"Mar 1, 2010","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":106721781,"AreaId":106656040,"UserId":105886426,"UserName":"Leo Hski","CommentBody":"Most scared I've ever been- following the closed trail that ran along then up the riverside bluff. \"Closed? Hah- we're experience mountaineers!\" I can remember sketchy mantel upon sketchy mantel on icy, snow covered, rounded sandstone bulges WAY above the river with ice floes banging ominously on the dam gates below. Of course we wouldn't rope up on what had been a summer hiking trail. Of course we were way off route in the snow. Second coldest I've ever been- Starved Rock climbing LaSalle. The end of my pick broke off about halfway up. Top-quality Welsh metallurgy- a Curver axe from the early 80's- better for bar fights than steep ice. Great days indeed!","CommentTime":"Apr 6, 2010","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":120375304,"AreaId":118179730,"UserId":107234104,"UserName":"AKSClimbs","CommentBody":"This area is not on the same land as the rest of the Lehigh Park boulders, which reside on public land owned by the City of Oglesby. Since this is private land and there is not direct permission from landowners allowing climbing, it is best to remove this info and avoid further climbing in the area.","CommentTime":"Mar 9, 2021","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118901405,"AreaId":115372896,"UserId":200403889,"UserName":"Simon Mrowiec","CommentBody":"\"In the spring of 1991, park officials and a group of Palisades climbers met to address concerns about damage to endangered plants growing in areas frequented by climbers. As this issue was going to press, this issue was still not resolved, but climbers were strongly encouraged not to climb on Forgotten Wall or Sun Buttress, at least until further study can determine to what degree these areas are affected by climbing.\" -River Rock (p.6) Not sure if this is the current state but always good to keep in mind.","CommentTime":"May 20, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":118901406,"AreaId":115363124,"UserId":200403889,"UserName":"Simon Mrowiec","CommentBody":"\"In the spring of 1991, park officials and a group of Palisades climbers met to address concerns about damage to endangered plants growing in areas frequented by climbers. As this issue was going to press, this issue was still not resolved, but climbers were strongly encouraged not to climb on Forgotten Wall or Sun Buttress, at least until further study can determine to what degree these areas are affected by climbing.\" -River Rock (p.6) Not sure if this is the current state but always good to keep in mind.","CommentTime":"May 20, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":119633807,"AreaId":115363124,"UserId":113306774,"UserName":"Eric Mack","CommentBody":"This area as 'returned to nature' even more so than open bible (vegetated), bee wall (vegetated), amphitheater wall (trail/belay overgrown), and butter walls (trail overgrown). I didn't see anything to work with for anchors, at least for the right side of the wall.","CommentTime":"Sep 27, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":119633705,"AreaId":115363172,"UserId":113306774,"UserName":"Eric Mack","CommentBody":"There are at least two rap stations at the top of bee wall. The chain-in-tubing is near the top off Buzz Off and Shady Lane. The tat is set back from Decapitator and Wise Crack. It would be convenient for rapping the gully climber's right of Decapitator.","CommentTime":"Sep 27, 2020","BetaVotes":2,"AdditionalInfo":null}
{"CommentId":115381551,"AreaId":115363163,"UserId":200367410,"UserName":"Jesse Wilson","CommentBody":"I'm having trouble finding this in the park. do you have an pics? MOSKEETOS chased me out. they are huge and tried to carry me away","CommentTime":"Oct 2, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":115381938,"AreaId":115363163,"UserId":112025009,"UserName":"Andrew Krajnik","CommentBody":"Unfortunately, no pics yet. The location in MP was estimated by overlaying the map area (mountainproject.com/photo/1…) from the guidebook over google maps. The roads and such in the guidebook don't line up perfectly, and the area is just indicated by an arrow, so right now, the map location is a best-guess, and needs improvement. I'll take a look in the guidebook tonight to see if I can get you some better beta, but I think this was supposed to be a short approach from the road. If you're able to find it (or any of the other recently-added walls, for that matter), let me know, and I can update with a better location, etc.","CommentTime":"Oct 2, 2018","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":115963401,"AreaId":115363163,"UserId":200253075,"UserName":"Nicholas Carroll","CommentBody":"Anyone know the name / grade of the single sport bolted route in this area? Bolts look pretty old but solid with chains one pitch up (inspecting from the ground, mind you) and must be at least a moderate - hard enough that someone left a bail biner. Not sure there are any other sport routes in the whole park, so I find this interesting! Mosquitos and gnats can get bad during hatches in the summer, but go in late fall or early spring and it's paradise.","CommentTime":"Nov 4, 2018","BetaVotes":1,"AdditionalInfo":null}
{"CommentId":119633926,"AreaId":115363191,"UserId":113306774,"UserName":"Eric Mack","CommentBody":"Short climbs. Nice belay. Anchor trees. Trail up to the belay has been 'reclaimed by nature' as of posting. Trail to the top is decent.","CommentTime":"Sep 27, 2020","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":113167378,"AreaId":112240927,"UserId":111653221,"UserName":"Robert McKenney","CommentBody":"Found some gear that someone might have lost .... mid-march. Shoot me a message and I'll return. I'll use for development if nobody claims.","CommentTime":"Jun 16, 2017","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":113552028,"AreaId":112440470,"UserId":112533203,"UserName":"Jeffrey Boone","CommentBody":"I think some of the left to right order of the routes is incorrect. I think the correct order is (left to right): Water Wings Training Wheels Boy Scout Route Scout's Dihedral NLC NARB Cody's First Lead","CommentTime":"Sep 5, 2017","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114366799,"AreaId":114354343,"UserId":108373400,"UserName":"Dave Hug","CommentBody":"Any fixed anchors?","CommentTime":"May 14, 2018","BetaVotes":0,"AdditionalInfo":null}
{"CommentId":114371579,"AreaId":114354343,"UserId":200184189,"UserName":"Evan McKearn","CommentBody":"Nope, because of the broken bands at the top any fixed anchors would probably need to be placed around 20' up; not really enough to bother with. Best bet would probably be to wrap a tree on the top and TR.","CommentTime":"May 15, 2018","BetaVotes":0,"AdditionalInfo":null}
